{"Q_ID": "1211310026", "S_NAME": "Input and Output", "Q_NAME": "Xenny and Alternating Tasks ", "Q_DESC": "Xenny and Yana were very keen to celebrate Valentine's Day at their home. To make preparations for the celebration, they listed down N tasks that they had to complete.\n\nTo complete the ith task, Xenny takes Xi seconds and Yana takes Yi seconds. In order to minimize the disparity in tasks performed, they decide to do the tasks alternatingly. If Xenny did the 1st task, then Yana would just wait and watch him until he completes the task. After that, Yana would start the 2nd task, and while she does her task, Xenny would just watch her. He would start the 3rd task only after her completion, and they would keep doing tasks alternatingly uptil the Nth task. They could also do tasks in the other order - that is, Yana could do the 1st task, after that Xenny could do the 2nd task, and so on. Their eventual goal was to minimize the total time taken by them to complete all N tasks.\n\nPlease help them find the minimum total time they would take to complete all N tasks.\n\nInput\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each testcase contains a positive integer N - the number of tasks to be completed.\n\nThe second line contains N space-separated positive integers representing the time taken in seconds by Xenny to complete the ith task.\n\nThe third line contains N space-separated positive integers representing the time taken in seconds by Yana to complete the ith task.\n\nOutput\n\nFor each testcase, print a single line containing the minimum total time in seconds Xenny and Yana would take to complete the tasks.", "TESTCASE_1": "1\n3\n2 1 2\n3 2 1\n###---###SEPERATOR---###---\n5", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}