{"Q_ID": "1212310005", "S_NAME": "Control Statements", "Q_NAME": "Little Elephant and Permutations", "Q_DESC": "The Little Elephant likes permutations. This time he has a permutation A[1], A[2], ..., A[N] of numbers 1, 2, ..., N.\nHe calls a permutation A good, if the number of its inversions is equal to the number of its local inversions. The number of inversions is equal to the number of pairs of integers (i; j) such that 1  i  j  N and A[i]  A[j], and the number of local inversions is the number of integers i such that 1  i  N and A[i]  A[i+1].\nThe Little Elephant has several such permutations. Help him to find for each permutation whether it is good or not. Print YES for a corresponding test case if it is good and NOotherwise.\nINPUT\nThe first line of the input contains a single integer T, the number of test cases. T test cases follow. The first line of each test case contains a single integer N, the size of a permutation. The next line contains N space separated integers A[1], A[2], ..., A[N]\nOutput\nFor each test case output a single line containing the answer for the corresponding test case. It should be YES if the corresponding permutation is good and NO otherwise.\nConstraints\n1  T  474 \n\n1  N  100 \n\nIt is guaranteed that the sequence A[1], A[2], ..., A[N] is a permutation of numbers 1, 2, ..., N.\nExample\nInput:\n4\n1\n1\n2\n2 1\n3\n3 2 1\n4\n1 3 2 4\n\nOutput:\nYES\nYES\nNO\nYES\nExplanation\nCase 1. Here N = 1, so we have no pairs (i; j) with 1  i  j  N. So the number of inversions is equal to zero. The number of local inversion is also equal to zero. Hence this permutation is good.\nCase 2. Here N = 2, and we have one pair (i; j) with 1  i  j  N, the pair (1; 2). Since A[1] = 2 and A[2] = 1 then A[1]  A[2] and the number of inversions is equal to 1. The number of local inversion is also equal to 1 since we have one value of i for which 1  i  N (the value i = 1) and A[i]  A[i+1] for this value of i since A[1]  A[2]. Hence this permutation is also good.\nCase 3. Here N = 3, and we have three pairs (i; j) with 1  i  j  N. We have A[1] = 3, A[2] = 2, A[3] = 1. Hence A[1]  A[2], A[1]  A[3] and A[2]  A[3]. So the number of inversions is equal to 3. To count the number of local inversion we should examine inequalities A[1]  A[2] and A[2]  A[3]. They both are satisfied in our case, so we have 2 local inversions. Since 2  3 this permutations is not good.\nCase 4. Here we have only one inversion and it comes from the pair (2; 3) since A[2] = 3  2 = A[3]. This pair gives also the only local inversion in this permutation. Hence the number of inversions equals to the number of local inversions and equals to one. So this permutation is good.\n", "TESTCASE_1": "4\n1\n1\n2\n2 1\n3\n3 2 1\n4\n1 3 2 4\n###---###SEPERATOR---###---\nYES\nYES\nNO\nYES", "TESTCASE_2": "9\n10\n1\n2\n2 1 4\n3\n3 2 1 6\n4\n1 3 2 5\n###---###SEPERATOR---###---\nNO\nYES\nYES\nYES\nYES\nYES\nYES\nYES\nYES", "TESTCASE_3": "1\n6\n9\n10\n1\n2\n2 1 4\n3\n3 2 1 6\n###---###SEPERATOR---###---\nNO", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}