{"Q_ID": "1213310012", "S_NAME": "Strings", "Q_NAME": "Little Elephant and Balance", "Q_DESC": "A Little Elephant from the Zoo of Lviv likes lucky strings, i.e., the strings that consist only of the lucky digits 4 and 7.\n\nThe Little Elephant calls some string T of the length M balanced if there exists at least one integer X (1  X  M) such that the number of digits 4 in the substring T[1, X - 1] is equal to the number of digits 7 in the substring T[X, M]. For example, the string S = 7477447 is balanced since S[1, 4] = 7477 has 1 digit 4 and S[5, 7] = 447 has 1 digit 7. On the other hand, one can verify that the string S = 7 is not balanced.\n\nThe Little Elephant has the string S of the length N. He wants to know the number of such pairs of integers (L; R) that 1  L  R  N and the substring S[L, R] is balanced. Help him to find this number.\n\nNotes.\n\nLet S be some lucky string. Then\n|S| denotes the length of the string S;\nS[i] (1  i  |S|) denotes the ith character of S (the numeration of characters starts from 1);\nS[L, R] (1  L  R  |S|) denotes the string with the following sequence of characters: S[L], S[L + 1], ..., S[R], and is called a substring of S. For L  R we mean by S[L, R] an empty string.\nInput\nThe first line of the input file contains a single integer T, the number of test cases. Each of the following T lines contains one string, the string S for the corresponding test case. The input file does not contain any whitespaces.\n\nOutput\nFor each test case output a single line containing the answer for this test case.\nConstraints\n1  T  10\n\n1  |S|  100000\n\nS consists only of the lucky digits 4 and 7.\n\nExample\nInput:\n4\n47\n74\n477\n4747477\n\nOutput:\n2\n2\n3\n23\n\nExplanation\nIn the first test case balance substrings are S[1, 1] = 4 and S[1, 2] = 47.\n\nIn the second test case balance substrings are S[2, 2] = 4 and S[1, 2] = 74.", "TESTCASE_1": "4\n47\n74\n477\n4747477\n###---###SEPERATOR---###---\n2\n2\n3\n23", "TESTCASE_2": "4\n45\n44398\n967482\n4334554\n###---###SEPERATOR---###---\n3\n15\n20\n28", "TESTCASE_3": "3\n986\n56723\n342214\n###---###SEPERATOR---###---\n6\n14\n21", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}