{"Q_ID": "1217110042", "S_NAME": "Pointers", "Q_NAME": "Pupils Redistribution", "Q_DESC": "In Berland each high school student is characterized by academic performance  integer value between 1 and 5.\n\nIn high school 0xFF there are two groups of pupils: the group A and the group B. Each group consists of exactly n students. An academic performance of each student is known  integer value between 1 and 5.\n\nThe school director wants to redistribute students between groups so that each of the two groups has the same number of students whose academic performance is equal to 1, the same number of students whose academic performance is 2 and so on. In other words, the purpose of the school director is to change the composition of groups, so that for each value of academic performance the numbers of students in both groups are equal.\n\nTo achieve this, there is a plan to produce a series of exchanges of students between groups. During the single exchange the director selects one student from the class A and one student of class B. After that, they both change their groups.\n\nPrint the least number of exchanges, in order to achieve the desired equal numbers of students for each academic performance.\n\nInput\nThe first line of the input contains integer number n (1=n=100)  number of students in both groups.\n\nThe second line contains sequence of integer numbers a1,a2,...,an (1=ai=5), where ai is academic performance of the i-th student of the group A.\n\nThe third line contains sequence of integer numbers b1,b2,...,bn (1=bi=5), where bi is academic performance of the i-th student of the group B.\n\nOutput\nPrint the required minimum number of exchanges or -1, if the desired distribution of students can not be obtained.\n\n", "TESTCASE_1": "4\n5 4 4 4\n5 5 4 5\n###---###SEPERATOR---###---\n1", "TESTCASE_2": "6\n1 1 1 1 1 1\n5 5 5 5 5 5\n###---###SEPERATOR---###---\n3", "TESTCASE_3": "9\n3 2 5 5 2 3 3 3 2\n4 1 4 1 1 2 4 4 1\n###---###SEPERATOR---###---\n4", "TESTCASE_4": "1\n5\n3\n###---###SEPERATOR---###---\n-1", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}