{"Q_ID": "1217110041", "S_NAME": "Pointers", "Q_NAME": "Anastasia and pebbles", "Q_DESC": "Anastasia loves going for a walk in Central Uzhlyandian Park. But she became uninterested in simple walking, so she began to collect Uzhlyandian pebbles. At first, she decided to collect all the pebbles she could find in the park.\n\nShe has only two pockets. She can put at most k pebbles in each pocket at the same time. There are n different pebble types in the park, and there are wi pebbles of the i-th type. Anastasia is very responsible, so she never mixes pebbles of different types in same pocket. However, she can put different kinds of pebbles in different pockets at the same time. Unfortunately, she can't spend all her time collecting pebbles, so she can collect pebbles from the park only once a day.\n\nHelp her to find the minimum number of days needed to collect all the pebbles of Uzhlyandian Central Park, taking into consideration that Anastasia can't place pebbles of different types in same pocket.\n\nInput\nThe first line contains two integers n and k (1= n=105, 1=k=109)  the number of different pebble types and number of pebbles Anastasia can place in one pocket.\n\nThe second line contains n integers w1,w2,...,wn (1 =wi=104)  number of pebbles of each type.\n\nOutput\nThe only line of output contains one integer  the minimum number of days Anastasia needs to collect all the pebbles.\n\nNote\nIn the first sample case, Anastasia can collect all pebbles of the first type on the first day, of second type  on the second day, and of third type  on the third day.\n\nOptimal sequence of actions in the second sample case:\n\nIn the first day Anastasia collects 8 pebbles of the third type.\nIn the second day she collects 8 pebbles of the fourth type.\nIn the third day she collects 3 pebbles of the first type and 1 pebble of the fourth type.\nIn the fourth day she collects 7 pebbles of the fifth type.\nIn the fifth day she collects 1 pebble of the second type.\n\n", "TESTCASE_1": "3 2\n2 3 4\n###---###SEPERATOR---###---\n3", "TESTCASE_2": "3 2\n2 3 4\n###---###SEPERATOR---###---\n3", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "5 4\n3 1 8 9 7\n###---###SEPERATOR---###---\n5", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}