{"Q_ID": "1511110011", "S_NAME": "CPU Scheduling", "Q_NAME": "Process Passengers With Intervention", "Q_DESC": "Semester break has started and Bravo is going home from College (SRM UNIVERSITY). He is taking flight from Chennai to Delhi. After entering the Airport, he was asked to get into queue of the Boarding Pass. \n\nThe Airline staff (Jet Airways) follows the Pre-emptive Priority algorithm (In case if a passenger with higher priority comes when processing of a passenger with lower priority is taking place in this case the processing of the boarding pass of the passenger with lower priority is altered and processing of boarding pass of passenger with higher priority is started) and first process the request of the person with the highest priority that is if he is a Jet Privilege member.\n\nBravo is a programmer and wanted to gift a program to the airline which shows the service time (time at which that person will reach the counter), waiting time (service time -arrival time) for each person in the queue and turnaround time (total time from arrival till person gets boarding pass). Also, Calculate average waiting and average turnaround time. \n\nAssume passenger with the highest priority number has the highest priority. \n\nInput: \nThe first line contains the Number of Passengers n. The next n line contains the Arrival time, Burst time and the priority number of that passenger.\n\nOutput:\nThe first n lines should print passenger nameArrival time, burst time ,priority and  waiting time for each person in the queue.In next two lines Print average waiting and average turnaround time (total time from arrival till person gets boarding pass) in next two lines respectively", "TESTCASE_1": "4\n8 13 4\n7 17 11\n23 35 1\n19 58 5\n###---###SEPERATOR---###---\nB 7 17 11 0\nD 19 58 5 5\nA 8 13 4 74\nC 23 35 1 72\nAverage waiting time:37.750000\nAverage Turnaround Time:68.500000", "TESTCASE_2": "5\n10 29 3\n30 42 9\n47 70 4\n21 25 2\n17 27 6\n###---###SEPERATOR---###---\nA 10 29 3 0\nB 30 42 9 9\nE 17 27 6 64\nC 47 70 4 61\nD 21 25 2 157\nAverage waiting time:58.200001\nAverage Turnaround Time:96.800003", "TESTCASE_3": "3\n2 12 4\n1 19 5\n7  34 1\n###---###SEPERATOR---###---\nB 1 19 5 0\nA 2 12 4 18\nC 7 34 1 25\nAverage waiting time:14.333333\nAverage Turnaround Time:36.000000", "TESTCASE_4": "6\n3 23 11\n3 45 5\n4 34 10\n5 44 12\n6 30 3\n7 45 2\n###---###SEPERATOR---###---\nA 3 23 11 0\nD 5 44 12 21\nC 4 34 10 66\nB 3 45 5 101\nE 6 30 3 143\nF 7 45 2 172\nAverage waiting time:83.833336\nAverage Turnaround Time:120.666664", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}