{"Q_ID": "1511110009", "S_NAME": "CPU Scheduling", "Q_NAME": "Quick Menu First", "Q_DESC": "Dhoni a student of SRM UNIVERSITY On his birthday took his n Friends (F1, F2, F3. Fn) to SRM Restaurant for a treat. The waiter noted the order of F1, F2, F3. Fn as O1, O2, O3 and so on respectively. \n\nDhoni asked the waiter about the type of algorithm he follows to give order to chef to prepare. Waiter told Dhoni that he follows the SJF (shortest job first algorithm) as it minimizes the waiting time so more number of customers are happy from their service and so they come back. Print the waiting time, time at which chef starts to prepare the order (Preparation start time) (service time) and time in which the order completes (turnaround time) for each one of them. \n\nPrint the average waiting and average turnaround time. Assume F1 gets the menu first and orders first then F2 and so on Therefore the time at which the order is given to the waiter (Arrival time) changes for each friend. \n\nInput: \nThe first line contains the Number of friend/s. The next n line contains  order give time for F1, F2, F3. Fn. \n\nOutput:\nThe first n lines should print  Order given time, waiting time and Time in which the order completes (Turnaround Time) for each friend in each line. Print average waiting and average turnaround time in next two lines respectively.", "TESTCASE_1": "5\n34\n21\n5\n2\n19\n###---###SEPERATOR---###---\nF4 2 0 2\nF3 5 2 7\nF5 19 7 26\nF2 21 26 47\nF1 34 47 81\nAverage Waiting Time:16.400000\nAverage Turnaround Time:32.599998", "TESTCASE_2": "3\n18\n8\n14\n###---###SEPERATOR---###---\nF2 8 0 8\nF3 14 8 22\nF1 18 22 40\nAverage Waiting Time:10.000000\nAverage Turnaround Time:23.333334", "TESTCASE_3": "6\n19\n45\n32\n89\n56\n22\n###---###SEPERATOR---###---\nF1 19 0 19\nF6 22 19 41\nF3 32 41 73\nF2 45 73 118\nF5 56 118 174\nF4 89 174 263\nAverage Waiting Time:70.833336\nAverage Turnaround Time:114.666664", "TESTCASE_4": "7\n56\n33\n47\n24\n11\n32\n19\n###---###SEPERATOR---###---\nF5 11 0 11\nF7 19 11 30\nF4 24 30 54\nF6 32 54 86\nF2 33 86 119\nF3 47 119 166\nF1 56 166 222\nAverage Waiting Time:66.571426\nAverage Turnaround Time:98.285713", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}