{"Q_ID": "1511110010", "S_NAME": "CPU Scheduling", "Q_NAME": "Deliver Part of Menu Regularly", "Q_DESC": "Raina a student of SRM UNIVERSITY On his birthday took his n Friends (F1, F2, F3. Fn) to SRM Restaurant for a treat. The waiter noted the order of F1, F2, F3. Fn as O1, O2, O3 and so on respectively.\n\nConsider F1, F2, F3. Fn as different customers. Raina a smart person observed that all the people of the restaurant were happy unlike other restaurants where some of the people were always unhappy with the service.\n\n So, Raina asked the waiter about this and the waiter told they follow the Round Robin algorithm in their restaurant so a fairness is seen in every order unlike priority algorithm therefore every customer feel special and are happy as they can see that their order has been given to chef and he/she has started the preparation of his/her order. Although the waiting time is more but the customer feel that their order is in process so they are happy. \n\nHe also told Raina that they maintain a database which records how much time the order of a customer will be needing more for completion after it passes the time quantum and shifts that order to last in the queue of the orders that are under preparation. You can assume Time quantum as a time after which the chef checks if some other new order came so that he can show that customer that his/her order has also started to prepare. \n\nPrint the Bust time, time in which the order completes (turnaround time)  and waiting time for each one of them. Print the average waiting and average turnaround time. Assume F1 gets the menu first and orders first then F2 and so on Therefore the time at which the order is given to the waiter (Arrival time) changes for each friend. \n\nInput: \nThe first line contains the Number of friend/s n. The next n line contains the arrival time and the bust time for F1, F2, F3. Fn.\n\nOutput: \nThe first n lines should print Burst time,turn around time and Waiting time for each friend in each line. Print average waiting and average turnaround time in next two lines respectively.", "TESTCASE_1": "3\n3 10 \n6 28\n2 35\n6\n###---###SEPERATOR---###---\nF1 10 19 9\nF2 28 56 28\nF3 35 71 36\nAverage Waiting Time:24.333334\nAverage Turnaround Time:48.666668", "TESTCASE_2": "4\n4 75 \n6 28\n2 35\n5 29\n5\n###---###SEPERATOR---###---\nF2 28 107 79\nF4 29 117 88\nF3 35 130 95\nF1 75 163 88\nAverage Waiting Time:87.500000\nAverage Turnaround Time:129.250000", "TESTCASE_3": "5\n3 60\n6 28\n2 35\n5 29\n1 72\n10\n###---###SEPERATOR---###---\nF2 28 112 84\nF4 29 132 103\nF3 35 160 125\nF1 60 199 139\nF5 72 223 151\nAverage Waiting Time:120.400002\nAverage Turnaround Time:165.199997", "TESTCASE_4": "4\n4 22\n2 74\n6 55\n5 35\n5\n###---###SEPERATOR---###---\nF1 22 78 56\nF4 35 122 87\nF3 55 161 106\nF2 74 184 110\nAverage Waiting Time:89.750000\nAverage Turnaround Time:136.250000", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}