{"Q_ID": "1511110006", "S_NAME": "CPU Scheduling", "Q_NAME": "Semester Break ", "Q_DESC": "Semester break has started and Bogar is going home from College (Tamil Siddha). He is taking flight from Chennai to Delhi. After entering the Airport, he was asked to get into queue of the Boarding Pass. The Airline staff follows the FCFS algorithm and first process the request of the person who came first that is who is at first position in the queue. \n\nBogar is a programmer and wanted to gift a program to the airline which shows the service time (time at which that person will reach the counter), waiting time (service time -arrival time) for each person in the queue and turnaround time (total time from arrival till person gets boarding pass). Also, Calculate average waiting and average turnaround time. \n\nInput: The first line contains the Number of Passengers n. The next n line contains the Burst time and Arrival time.\n\nOutput: - The first n lines should print input values, service time (time at which that person will reach the counter), waiting time (service time -arrival time) for each person in the queue and turnaround time (total time from arrival till person gets boarding pass). \n\nIn next two lines Print average waiting and average turnaround time in next two lines respectively.", "TESTCASE_1": "4\n4 9 8 3\n0 2 4 3\n###---###SEPERATOR---###---\nPassenger0 0 4\nPassenger1 2 11\nPassenger2 9 17\nPassenger3 18 21\nAverage waiting time=7.250000\nAverage turn around time=13.250000", "TESTCASE_2": "5\n4 9 8 3 4\n0 2 4 3 2\n###---###SEPERATOR---###---\nPassenger0 0 4\nPassenger1 2 11\nPassenger2 9 17\nPassenger3 18 21\nPassenger4 22 26\nAverage waiting time=10.200000\nAverage turn around time=15.800000", "TESTCASE_3": "4\n4 11 8 3\n0 2 4 3\n###---###SEPERATOR---###---\nPassenger0 0 4\nPassenger1 2 13\nPassenger2 11 19\nPassenger3 20 23\nAverage waiting time=8.250000\nAverage turn around time=14.750000", "TESTCASE_4": "5\n4 13 8 3 4\n0 2 4 3 2\n###---###SEPERATOR---###---\nPassenger0 0 4\nPassenger1 2 15\nPassenger2 13 21\nPassenger3 22 25\nPassenger4 26 30\nAverage waiting time=12.600000\nAverage turn around time=19.000000", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}