{"Q_ID": "1511110012", "S_NAME": "CPU Scheduling", "Q_NAME": "Process Passengers Without Intervention", "Q_DESC": "Semester break has started and Ashwin is going home from College (SRM UNIVERSITY). He is taking flight from Chennai to Delhi. After entering the Airport, he was asked to get into queue of the Boarding Pass. \n\nThe Airline staff (Jet Airways) follows the Non Pre-emptive Priority algorithm (Even In case if a passenger with higher priority comes when processing of a passenger with lower priority is taking place in this case the processing of the boarding pass of the passenger with lower priority should not be altered and the passenger with the highest priority has to weight until his turn comes according to the priority )\n\nAshwin is a programmer and wanted to gift a program to the airline which shows the service time (time at which that person will reach the counter), waiting time (service time -arrival time) for each person in the queue and turnaround time (total time from arrival till person gets boarding pass). Also, Calculate average waiting and average turnaround time. \n\nAssume passenger with the lowest priority number has the highest priority. \n\nInput: \nThe first line contains the Number of Passengers n. The next n line contains the Burst Time and the priority number of that passenger. \n\nOutput:\nThe first n lines should print Process ID,Burst time waiting time and turn around time (total time from arrival till person gets boarding pass) for each person in the queue . In next two lines Print average waiting and average turnaround time in next two lines respectively\n", "TESTCASE_1": "6\n12 5\n19 2\n34 1\n23 4\n76 5\n11 3\n###---###SEPERATOR---###---\nP3 34 0 34\nP2 19 34 53\nP6 11 53 64\nP4 23 64 87\nP5 76 87 163\nP1 12 163 175\nAverage Waiting Time:66.000000\nAverage Turnaround Time:96.000000", "TESTCASE_2": "5\n18 3\n29 2\n42 7\n11 5\n17 1\n###---###SEPERATOR---###---\nP5 17 0 17\nP2 29 17 46\nP1 18 46 64\nP4 11 64 75\nP3 42 75 117\nAverage Waiting Time:40.000000\nAverage Turnaround Time:63.000000", "TESTCASE_3": "3\n10 3\n28 7\n12 1\n###---###SEPERATOR---###---\nP3 12 0 12\nP1 10 12 22\nP2 28 22 50\nAverage Waiting Time:11.000000\nAverage Turnaround Time:28.000000", "TESTCASE_4": "4\n45 2\n59 5\n70 1\n64 4\n###---###SEPERATOR---###---\nP3 70 0 70\nP1 45 70 115\nP4 64 115 179\nP2 59 179 238\nAverage Waiting Time:91.000000\nAverage Turnaround Time:150.000000", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}