{"Q_ID": "1512110004", "S_NAME": "File Allocation ", "Q_NAME": "Spacecraft", "Q_DESC": "A spacecraft is all set to travel through a long inter-galactic tunnel. The tunnel consists of N stationary space debris. In order to successfully complete the mission the spacecraft needs to destroy all the space debris. The control unit of the spacecraft has M buttons which can be used to destroy the space debris. Pressing a particular button may result in the destruction of some (possibly multiple) particular space debris. Once a space debris is destroyed its mass is converted into energy, which is eventually absorbed by the spacecraft in order to increase its speed. The amount of energy released from the disintegration of a particular space debris depends upon the button which has been used to destroy that space debris. A matrix E which contains this information is known as \"Energy Vector\". For each space debris i and each button j, E[i][j] is a positive integer between 0 and 100, which is the energy released after destroying space debris i using button j. The value of E[i][j] is -1 if space debris i cannot be destroyed using button j.\n\nSome space debris have dependencies on other space debris in order to get destroyed. The spacecraft must destroy some specific space debris before causing the destruction of some other space debris. There are a total of K unique dependencies. Each dependency contains two space separated integers i and j, which denotes that the space debris i must be destroyed before destroying space debris j.\nA particular button can be pressed only once and the buttons can be pressed only in order from 1 to M (ie. button 2 cannot be pressed before button 1 ). While pressing a specific button a binary string T of length N called as \"Target Vector\" is passed to the control unit of the spacecraft. For each space debris i, T[i] is 1 if you want to destroy that space debris with that button otherwiseT[i] is 0. When the button is pressed all the space debris mentioned in the Target Vector simultaneously gets destroyed.\n\nThe spacecraft may destroy any number of space debris using a particular button, including none, as long as they can be destroyed by that button and the spacecraft has already destroyed any required prerequisite space debris.Find the allocation of file.", "TESTCASE_1": "4 10\n###---###SEPERATOR---###---\n4->1\n5->1\n6->1\n7->1\n8->1\n9->1\n10->1\n11->1\n12->1\n13->1\nthe file is allocated to disk", "TESTCASE_2": "5 6\n###---###SEPERATOR---###---\n5->1\n6->1\n7->1\n8->1\n9->1\n10->1\nthe file is allocated to disk", "TESTCASE_3": "6 6\n###---###SEPERATOR---###---\n6->1\n7->1\n8->1\n9->1\n10->1\n11->1\nthe file is allocated to disk", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}