{"Q_ID": "1811210010", "S_NAME": "Input and Output", "Q_NAME": "Greedy Actor", "Q_DESC": "Tuzik is a little dog. But despite the fact he is still a puppy he already knows about the pretty things that coins are. He knows that for every coin he can get very tasty bone from his master. He believes that some day he will find a treasure and have loads of bones.\n\nAnd finally he found something interesting. A wooden chest containing N coins! But as you should remember, Tuzik is just a little dog, and so he can't open it by himself. Actually, the only thing he can really do is barking. He can use his barking to attract nearby people and seek their help. He can set the loudness of his barking very precisely, and therefore you can assume that he can choose to call any number of people, from a minimum of 1, to a maximum of K.\n\nWhen people come and open the chest they divide all the coins between them in such a way that everyone will get the same amount of coins and this amount is maximal possible. If some coins are not used they will leave it on the ground and Tuzik will take them after they go away. Since Tuzik is clearly not a fool, he understands that his profit depends on the number of people he will call. While Tuzik works on his barking, you have to find the maximum possible number of coins he can get.\n\nInput\nThe first line of the input contains an integer T denoting the number of test cases. Each of next T lines contains 2 space-separated integers: N and K, for this test case.\n\nOutput\nFor each test case output one integer - the maximum possible number of coins Tuzik can get.\n\nConstraints\n1<=T<=50\n1<=N, K<=105", "TESTCASE_1": "2\n5 2\n11 3\n###---###SEPERATOR---###---\n1\n2", "TESTCASE_2": "10\n2 2\n5 7\n3 4\n12 7\n5 4\n5 2\n98 6\n109 110\n123 156\n10 2\n###---###SEPERATOR---###---\n0\n5\n3\n5\n2\n1\n3\n109\n123\n0", "TESTCASE_3": "12\n2 2\n5 7\n3 4\n12 7\n5 4\n5 2\n98 6\n109 110\n123 156\n10 2\n5 2\n11 3\n###---###SEPERATOR---###---\n0\n5\n3\n5\n2\n1\n3\n109\n123\n0\n1\n2", "TESTCASE_4": "24\n2 2\n5 7\n3 4\n12 7\n5 4\n5 2\n98 6\n109 110\n123 156\n10 2\n5 2\n11 3\n2 2\n5 7\n3 4\n12 7\n5 4\n5 2\n98 6\n109 110\n123 156\n10 2\n5 2\n11 3\n\n###---###SEPERATOR---###---\n0\n5\n3\n5\n2\n1\n3\n109\n123\n0\n1\n2\n0\n5\n3\n5\n2\n1\n3\n109\n123\n0\n1\n2", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}