{"Q_ID": "1812110020", "S_NAME": "Control Stmt - if-elif-el", "Q_NAME": "Note To Frequency - B NOTE", "Q_DESC": "The following table lists an octave of music notes, beginning with middle B, along  with their frequencies.\n\nNote                Frequency (Hz)\nB4                    493.88  \n\nBegin by writing a program that reads the name of a note from the user and displays the notes frequency. Your program should support all of the notes listed previously.\n\nOnce you have your program working correctly for the notes listed previously you should add support for all of the notes from A0 to A8. \n\nWhile this could be done by adding many additional cases to your if statement, such a solution is cumbersome,\ninelegant and unacceptable for the purposes of this exercise. Instead, you should exploit the relationship between notes in adjacent octaves. In particular, the frequency of any note in octave n is half the frequency of the corresponding note in octave n+1.\n\nBy using this relationship, you should be able to add support for the additional notes without adding additional cases to your if statement.\n\n\nHint: To complete this exercise you will need to extract individual characters from the two-character note name so that you can work with the letter and the octave number separately. \n\nOnce you have separated the parts, compute the frequency of the note in the fourth octave using the data in the table above. \n\nThen divide the frequency by 2 power(4-x ), where x is the octave number entered by the user. This will halve or double the frequency the correct number of times.\n\nThen divide the frequency by 2 power(4-x ), where x is the octave number entered by the user.  (freq=freq/2**(4-octave))\n", "TESTCASE_1": "B2\n###---###SEPERATOR---###---\n123.47", "TESTCASE_2": "B7\n###---###SEPERATOR---###---\n3951.04", "TESTCASE_3": "B4\n###---###SEPERATOR---###---\n493.88", "TESTCASE_4": "B6\n###---###SEPERATOR---###---\n1975.52", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}