{"Q_ID": "1311310018", "S_NAME": "Input and Output Statemen", "Q_NAME": "Counting Games", "Q_DESC": "Henry and Derek are waiting in a room. They have successfully qualified for the Snackdown Finals 2016, and decide to pass the time by playing a new game.\n\nBefore the game starts, they select N numbers: v(0), v(1), ..., v(N-1). These numbers will stay fixed throughout the game.\n\nThe initial state of the game consists of K integers x1, x2, ..., xK, each of which is in the range [0, N-1]. Thus, there are NK distinct states all in all. Then the players take turns, starting with Henry. In a turn, a player selects one of the integers, say xi, and decreases it by some positive multiple of 2v(xi). However, this is only valid if the resulting number is nonnegative. A player loses if there are no more valid moves left.\n\nHenry and Derek have gotten really good at playing this game, so much that they have figured out the optimal strategy, and they always play optimally! This made the game really boring for them, because the winner is solely determined by the initial state of the game. So instead of playing the game, they decided to just answer the following question instead:\n\nOf all the NK possible initial states, how many of them result in a win for Henry?\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each test case contains two integers, N and K.\n\nThe second line contains N space-separated integers v(0), v(1), ..., v(N-1).\n\nOutput\n\nFor each test case, output a single line containing a single integer, the number of initial states that result in a win for Henry. This number can be very large, so output it modulo 109 + 7.\n\nConstraints\n\n1  T  3\n1  K  106\n1  N  105\n0  v(i)  104", "TESTCASE_1": "3\n2 3\n1 0\n5 3\n2 0 1 0 0\n5 3\n2 0 1 0 1\n###---###SEPERATOR---###---\n4\n94\n100", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}