{"Q_ID": "1311210029", "S_NAME": "Input and Output Statemen", "Q_NAME": "Brackets", "Q_DESC": "A valid parentheses sequence is a non-empty string where each character is either ( or ), which satisfies the following constraint:\n\nYou can find a way to repeat erasing adjacent pairs of parentheses () until it becomes empty.\n\nFor example, (()) and ()((()())) are valid parentheses sequences, but )()( and (() are not.\n\nMike has a valid parentheses sequence. He really likes everything about his sequence, except the fact that it is quite long. So Mike has recently decided that he will replace his parentheses sequence with a new one in the near future. But not every valid parentheses sequence will satisfy him. To help you understand his requirements we'll introduce the pseudocode of function F(S):\n\n FUNCTION F( S - a valid parentheses sequence )\n BEGIN\n  balance = 0\n  max_balance = 0\n  FOR index FROM 1 TO LENGTH(S)\n  BEGIN\n   if S[index] == ( then balance = balance + 1\n   if S[index] == ) then balance = balance - 1\n   max_balance = max( max_balance, balance )\n  END\n  RETURN max_balance\n END\nIn other words, F(S) is equal to the maximal balance over all prefixes of S.\n\nLets denote A as Mikes current parentheses sequence, and B as a candidate for a new one. Mike is willing to replace A with B if F(A) is equal to F(B). He would also like to choose B with the minimal possible length amongst ones satisfying the previous condition. If there are several such strings with the minimal possible length, then Mike will choose the least one lexicographically, considering ( to be less than ).\n\nHelp Mike!\n\nInput\n\nThe first line of the input contains one integer T denoting the number of testcases to process.\n\nThe only line of each testcase contains one string A denoting Mike's parentheses sequence. It is guaranteed that A only consists of the characters (and). It is also guaranteed that A is a valid parentheses sequence.\n\nOutput\n\nThe output should contain exactly T lines, one line per each testcase in the order of their appearance. The only line of each testcase should contain one string B denoting the valid parentheses sequence that should be chosen by Mike to replace A.\n\nConstraints\n\n1<=T<=5;\n\n1<=|A|<=100000(105).", "TESTCASE_1": "1\n()((()()))\n###---###SEPERATOR---###---\n((()))", "TESTCASE_2": "1\n()(())()())\n###---###SEPERATOR---###---\n(())", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}