{"Q_ID": "1311210030", "S_NAME": "Input and Output Statemen", "Q_NAME": "Good Joke!", "Q_DESC": "Vadim and Roman like discussing challenging problems with each other. One day Vadim told his friend following problem:\n\nGiven N points on a plane. Each point p is defined by it's two integer coordinates  px and py. The distance between points a and b is min(|ax - bx|, |ay - by|). You should choose a starting point and make a route visiting every point exactly once, i.e. if we write down numbers of points in order you visit them we should obtain a permutation. Of course, overall distance walked should be as small as possible. The number of points may be up to 40.\n\n\"40? Maybe 20? Are you kidding?\"  asked Roman. \"No, its not a joke\"  replied Vadim. So Roman had nothing to do, but try to solve this problem. Since Roman is really weak in problem solving and you are the only friend, except Vadim, with whom Roman can discuss challenging tasks, he has nobody else to ask for help, but you!\nInput\n\nInput description.\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.The first line of each test case contains a single integer N denoting the number of points on a plane. The following N lines contain two space-separated integers each  coordinates of points.\nOutput\n\nOutput description.\n\nOutput the answer for every test case in a separate line. The answer for every test case is a permutation of length N. In case there are several solutions that lead to minimal distance walked, you should choose the lexicographically smallest one. Let P denote such permutation. To make output smaller, you should output H(P). H(P) = P1 xor P2 xor ... xor PN. Have a look at the example and it's explanation for better understanding.\nConstraints\n\n1<=T <=10\n1 <=N <= 40\n0 <=absolute value of each coordinate <=1000\n1 <= sum over all N in a single test file <= 120", "TESTCASE_1": "2\n2\n1 2\n0 0\n3\n3 3\n0 0\n0 3\n###---###SEPERATOR---###---\n3\n0", "TESTCASE_2": "2\n2\n1 2\n0 0\n3\n3 3\n1 1 \n0 3\n###---###SEPERATOR---###---\n3\n0", "TESTCASE_3": "2\n2\n2 2\n2 2\n3\n3 1\n3 2 \n3 4\n###---###SEPERATOR---###---\n3\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}