{"Q_ID": "1311210010", "S_NAME": "Input and Output Statemen", "Q_NAME": "Quentin Tarantino", "Q_DESC": "Quentin Tarantino is a famous Hollywood filmmaker and actor. His films have a unique characteristic of connecting with youth by using popular culture references. They are usually divided into various sub-parts denoted by chapters. His plot of stories is never linear, he always make sure that the chapters should never be shown in the order of Chapter 1, Chapter 2, Chapter 3, ,.. Chapter n linearly. He believes doing this an insult to the intelligence of viewers. For example, Chapter 1, Chapter 2, Chapter 3 can never be a chapter sequence in Tarantino's movies.. He can have a sequence of Chapter 2, Chapter 3, Chapter 1 instead.\n\nRecently Santa gifted Tom a movie which consists of n chapters. This movie can possibly be directed by your favorite Tarantino or by someone else. Directors in hollywood can sometimes be very sloppy, they sometimes drop some chapters too and stupid they are that they will leave numbering of the chapters as it is and one can easily identify the chapters that were dropped. For example, if you find the sequence of chapters as - chapter 1, chapter 5, chapter 3, don't be surprised, they did not even take burden of renumbering the chapters to chapter 1, chapter 3, chapter 2. They can sometimes repeat the chapter numbers too. Remember that Tarantino is not a sloppy director, so he never makes this kind of stupid mistakes.\n\nTom happened to find the sequence of chapters in the movie, this sequence contains n chapters, i-th of which is denoted by chapteri. Tom is a big fan of movies of Tarantino. So, Tom would like to check whether the movie could possibly be directed by Tarantino or not? Please help Tom, he really needs it.\n\nInput\n\nThe first line contains an integer T denoting the number of test cases. T test cases follow.\n\nThe first line of each test case contains an integer n denoting number of chapters of the movie.\n\nThe second line of each test case contains n space separated integers chapteri, denoting numbering of ith chapter.\n\nOutput\n\nFor each test case, output \"yes\" or \"no\" in a separate line.\n\nConstraints\n\n1<=T<=100\n2<=N <=100\n1<=chapteri <=500", "TESTCASE_1": "4\n3\n2 3 1\n3\n1 5 3\n3\n1 2 3\n2\n1 1\n###---###SEPERATOR---###---\nyes\nno\nno\nno", "TESTCASE_2": "4\n3\n1 8 10\n3\n4 5 7\n3\n11 12 13\n2\n50 40\n###---###SEPERATOR---###---\nno\nno\nno\nno", "TESTCASE_3": "3\n2\n103 70\n3\n458 110 789\n1\n1183946\n###---###SEPERATOR---###---\nno\nno\nno", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}