{"Q_ID": "1311310015", "S_NAME": "Input and Output Statemen", "Q_NAME": "Dividing into Regions", "Q_DESC": "ChefLand develops very fast. Recently, there were a few new cities built, so the total number of cities in ChefLand have become N. Input\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nIn order not to make this problem I/O related, we will give you the road system in the compressed form. The first and only line of the test case will contain six space-separated integers N, A, B, C, D, E with the following meaning:\n\nThe road system contains N cities and N-1 roads.\nThe ith road (1-indexed) connects the cities with the numbers i+1 and ((A + B * (i - 1)) % i) + 1 and has the length equal to (C * i + D) % E.\nIt is guaranteed that the road system, generated this way will be connected.\nOutput\n\nIn order not to make this problem I/O-related, we will ask you the hash function of the answer to each test case.\n\nThe hash function is calculated this way:\n\nFirst, an 1-indexed sequence Q of 2(N-1) answers is created.\nThe (2*i-1)th term of this sequence is the smallest of the inconvenience values after removing the ith edge.\nThe (2*i)th term of this sequence is the greatest of the inconvenience values after removing the ith edge.\nThen, the value of the hash function is a sum of Qi * (1000000 + 3)i-1, modulo 109+7.\nConstraints\n\n1  T  105\n2  N, sum of N  5  106\n0  A, B, C, D  104\n2  E  200\n\nIn order to communicate, the cities are connected with N-1 bidirectional roads in such a way that there is exactly one way to get from one city to another. In other words, the graph with cities as nodes and roads as edges is a tree.\n\nNow, the King of ChefLand thinks that the country is too big to be ruled by one person, so he decided to split in two parts, each of which will be ruled by one of two his sons. The split should be made by blocking one road. After doing that, there will be two connected parts which will be ruled by sons.\n\nHowever, not every division is good. In some cases, one of the parts will still be very large, thus, it will be very hard for some of the sons to rule it. So, for every connected part, there's a value called inconvenience. The inconvenience of the part equals to the distance between two most distance cities belonging to this part.\n\nSo for every split, there are two inconvenience values that should be calculated. Please help the King to find them!", "TESTCASE_1": "2\n5 1 2 3 4 5\n89 189 111 34 7 200\n###---###SEPERATOR---###---\n99116027\n515191750", "TESTCASE_2": "2\n7 2 3 1 5 8\n101 780 121 4 5 100\n###---###SEPERATOR---###---\n802482758\n596182915", "TESTCASE_3": "2\n1 3 2 4 5 6\n13 21 12 18 707 110\n###---###SEPERATOR---###---\n0\n884074508", "TESTCASE_4": "2\n1 2 1 6 7 5\n54 12 08 81 33 999\n###---###SEPERATOR---###---\n0\n95670600", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}