{"Q_ID": "1311310016", "S_NAME": "Input and Output Statemen", "Q_NAME": "Provinces of ChefLand", "Q_DESC": "Following the example of ByteLand, the King of ChefLand has decided to divide the country into provinces. Input\n\nThe first line of the input contains three space-separated integers: N, M, K, denoting the number of rows in the map, the number of columns in the map and the number of cities in one province.\n\nEach of the following N lines contain M space-separated integers, denoting the populations of the cities.\n\nOutput\n\nOutput a single line containing the productivity value of the kingdom.\n\nConstraints\n\n1  N  100\n1  M  10\n1  K  min(10, N * M)\n1  Ai, j  1000\n\nThe map of ChefLand is a rectangular matrix consisting of N rows and M columns. The cell at the crossing of the ith row and the jth column denotes a single ChefLand city. So, there are N  M cities. There are Ai, j people living in the city at the crossing of the ith row and the jth column.\n\nWithout enough contemplation, the King has decided that any connected region, consisting of exactly K cities should form a province. Two cities are said to be connected to each other if their corresponding cells share a side. The set of cities is said to be a connected region, if you can get from any city of the set to any other city of the set by moving only via side-adjacent cities from the set. It appears that a single city can belong to more than one province, but the King is happy with it: after all, the more provinces - the better.\n\nNow the King wants to calculate the productivity number of the kingdom. This number is defined to be the product of the populations of all the provinces. The population of a province is the sum of the populations of all the cities in the province.\n\nThe King's servants had finally found the productivity number. However, the King is not sure whether they're correct or not. So he asks you to help him to check this. Please find the productivity number of the kingdom. Since it can be quite large, output it modulo 109+7", "TESTCASE_1": "2 2 2\n1 2\n3 4\n###---###SEPERATOR---###---\n504", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}