{"Q_ID": "1312310018", "S_NAME": "Data types and Operators", "Q_NAME": "Coffee Breaks", "Q_DESC": "Sergey works as a programmer. Like all programmers, he is a coffee fan. He likes coffee so much that has K cups of coffee daily. However, having more than K cups doesn't suit him, because the excess caffeine won't allow him to sleep at night.\n\nSergey's working day is divided into N periods. For every period, he knows how many kilobytes of code he can produce.\n\nDuring each of the periods, Sergey can either have or not to have one cup of coffee. If he is having a cup of coffee in some period, the amount of code he writes in this period drops to zero. But he also gets a productivity boost  if he decides to skip coffee during a period and the last cup of coffee he had was no more than D periods ago, the amount of code he writes during such a period is M times the usual.\n\nAs his productivity advisor (congrats on your new job!), help Sergey plan his coffee breaks optimally. Please find the maximum number of lines of code he can write, provided that he has exactly K coffee breaks during the day.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each test case contains four space separated integers N, K, D and M denoting the number of the working periods, the number of coffee-breaks and two more parameters as described in the statement.\n\nThe second line contains N space-separated integers A1, A2, ... , AN denoting the number of kilobytes of code that Sergey writes during each period.\n\nOutput\n\nFor each test case, output a single line containing the maximum number of kilobytes of code that Sergey can produce if he takes exactly K coffee breaks.\n\nConstraints\n\n1  T  200\nIn subtasks 1-3 it holds that 1  sum of all N over the test case  1000\nSubtask 1 (15 points): K = 1, 1  D < N  18\nSubtask 2 (25 points): 1  K, D < N  18\nSubtask 3 (30 points): 1  K, D < N  200\nSubtask 4 (30 points): 1  K, D < N  5000, 1  sum of all N over the test case  5000\n1  M, Ai  1000", "TESTCASE_1": "1\n5 2 2 10\n1 2 3 4 5\n###---###SEPERATOR---###---\n110", "TESTCASE_2": "2\n2 3 4 5\n2 3\n3 3 4 5\n2 4 5\n###---###SEPERATOR---###---\n15\n\n45", "TESTCASE_3": "3\n1 2 3 4\n3\n3 4 5 5\n3 4 5\n5 7 9 5\n4 6 7 8 9\n###---###SEPERATOR---###---\n3\n\n45\n\n150", "TESTCASE_4": "1\n7 7 5 9\n2 4 6 7 8 9 4\n###---###SEPERATOR---###---\n310", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}