{"Q_ID": "1312310028", "S_NAME": "Data types and Operators", "Q_NAME": "Funny gnomes", "Q_DESC": "Kekocity's population consist of N gnomes numbered with unique ids from 1 to N. As they are very joyful gnomes, they usually send jokes to their friends right after they get any (even if they knew it before) via their social network named as Mybeard. Mybeard became popular in the city because of message auto-deletion. It takes exactly one minute to read and resend joke to mates.\n\nMayor of Kekocity, Mr. Shaikhinidin, is interested in understanding how the jokes are spread. He gives you database of Mybeard social network, and wants you to answer some queries on it.\n\nYou will be given a list of friends for every gnome and M queries of the following type: Who will receive a message with joke after exactly K minutes, if the creator of joke was gnome with id x?\n\nInput\n\nThe first line contains a single integer N denoting the number of gnomes.\n\nThe next N lines contain the the matrix g[N][N]. Each of the i-th line, will contain N space separated integers - j-th of those will denote g[i][j]. If gnome j is friend of gnome i, then g[i][j] is 1. Otherwise it will be zero. Plese note that the friendship relationship is not bidirectional, i.e. it might happen that g[i][j] may not be equal to g[j][i]. Also one can be friend of itself also, i.e. g[i][i] may be equal to 1.\n\nThe next line contains a single integer M denoting the number of queries. The next M lines contain two integers k and x described above.\n\nOutput\n\nFor each query, output two lines.\n\nIn the first line, output how many gnomes will know the joke after k minutes.\n\nIn the second line, print these ids (numbering) of these gnomes in increasing order. If no one will know the joke after K minutes, then print -1 in this line.\n\nConstraints\n\n1  N  500\n1  M  500\n0  k  109\n1  x  N\n0  g[i][j]  1\nSubtasks\n\nSubtask #1 : (10 points)\n1  N  50\n1  M  50\n0  k  50\n\nSubtask #2 : (15 points)\nOriginal constraints\nEvery gnome has exactly one friend (for every i there is exactly one j such that g[i][j] = 1. Note that j can be equal to i)\n\nSubtask #3 : (30 points)\n1  N  75\n1  M  75\n0  k  109\n\nSubtask #4 : (45 points)\nOriginal constraints\n", "TESTCASE_1": "5\n0 1 0 0 0\n0 0 1 1 0\n1 0 0 0 0\n0 0 0 1 0\n0 0 0 0 0\n4\n3 1\n10000 1\n0 5\n1 5\n###---###SEPERATOR---###---\n2\n1 4\n2\n2 4\n1\n5\n0\n-1", "TESTCASE_2": "5\n0 1 0 0 0\n0 1 1 1 0\n1 0 0 0 1\n1 1 0 1 0\n1 0 0 0 0\n4\n3 1\n85590 1\n0 5\n1 5\n###---###SEPERATOR---###---\n5\n1 2 3 4 5 \n5\n1 2 3 4 5 \n1\n5 \n1\n1 \n", "TESTCASE_3": "5\n0 1 1 0 0\n0 0 0 0 0\n1 0 0 0 1\n1 1 0 1 0\n1 1 1 1 0\n4\n3 1\n500099 1\n0 5\n###---###SEPERATOR---###---\n4\n1 2 3 4 \n5\n1 2 3 4 5 \n1\n5 \n4\n1 2 3 4 \n", "TESTCASE_4": "5\n1 1 1 1 1\n0 0 0 0 0\n1 1 1 1 1\n0 0 0 0 0\n1 1 1 1 1\n4\n3 1\n12345 1\n0 5\n1 5\n###---###SEPERATOR---###---\n5\n1 2 3 4 5 \n5\n1 2 3 4 5 \n1\n5 \n5\n1 2 3 4 5 ", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}