{"Q_ID": "1312110067", "S_NAME": "Data types and Operators\t", "Q_NAME": "leap year or not", "Q_DESC": "A leap year (also known as an intercalary year or bissextile year) is a calendar year containing one additional day (or, in the case of lunisolar calendars, a month) added to keep the calendar year synchronized with the astronomical or seasonal year. Because seasons and astronomical events do not repeat in a whole number of days, calendars that have the same number of days in each year drift over time with respect to the event that the year is supposed to track. By inserting (also called intercalating) an additional day or month into the year, the drift can be corrected. A year that is not a leap year is called a common year.\n\nFor example, in the Gregorian calendar, each leap year has 366 days instead of the usual 365, by extending February to 29 days rather than the common 28. These extra days occur in years which are multiples of four (with the exception of years divisible by 100 but not by 400). Similarly, in the lunisolar Hebrew calendar, Adar Aleph, a 13th lunar month, is added seven times every 19 years to the twelve lunar months in its common years to keep its calendar year from drifting through the seasons. In the Baha'i Calendar, a leap day is added when needed to ensure that the following year begins on the vernal equinox.\n\nThe name leap year probably comes from the fact that while a fixed date in the Gregorian calendar normally advances one day of the week from one year to the next, the day of the week in the 12 months following the leap day (from March 1 through February 28 of the following year) will advance two days due to the extra day.\nThe length of a day is also occasionally changed by the insertion of leap seconds into Coordinated Universal Time (UTC), owing to the variability of Earth's rotational period. Unlike leap days, leap seconds are not introduced on a regular schedule, since the variability in the length of the day is not entirely predictable.\n\nWrite a Java program that takes a year from user and print whether that year is a leap year or not.", "TESTCASE_1": "2016\n###---###SEPERATOR---###---\n2016 is a leap year", "TESTCASE_2": "2015\n###---###SEPERATOR---###---\n2015 is not a leap year", "TESTCASE_3": "2012\n###---###SEPERATOR---###---\n2012 is a leap year", "TESTCASE_4": "2009\n###---###SEPERATOR---###---\n2009 is not a leap year", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}