{"Q_ID": "1312310012", "S_NAME": "Data types and Operators", "Q_NAME": "Newspaper Puzzle", "Q_DESC": "When things slow down in the kitchen, the Chef likes to do puzzles he finds in the newspaper until more orders arrive. Today, a new type of puzzle has been featured and the Chef needs help solving it.\n\nIn this puzzle, a series of groups of non-zero integers are given where each group has exactly three integers. Furthermore, for each positive integer k, the number of groups including k plus the number of groups including -k does not exceed 3. The goal is to assign, for each positive integer k, either the character 'T' or 'F' so that every group of three integers has\n\nat least one negative integer k such that |k| is assigned 'F', or\nat least one positive integer k such that k is assigned 'T'\nFinally, you are guaranteed that the absolute values the three integers in any particular group are all distinct. Now, newspaper puzzles are only fun if they are solvable so you are guaranteed that there is a solution. Your task is to find such an assignment of 'T' or 'F' values to the positive integers meeting the above requirements.\n\nInput\n\nThe first line consists of a single integer denoting the number of test cases (at most 30). The first line for each test case consists of two integers C and V. Following this are C lines, one per group of integers in the puzzle. Each such line consisting of 3 non-zero integers between -V and V. Furthermore, the absolute values of these three integers are distinct.\n\nFinally, the input is such that for every integer k, the total number of groups containing either k or -k is at most 3.\n\nBounds: 1  C  1000 and 3  V  3000.\n\nOutput\n\nThe output for each test case is a single line consisting of V characters 'T' or 'F'. These characters should appear consecutively with no spaces between. The i'th such character is what positive integer i is assigned. This should be done so that each group of three integers has the property described above.\n\nIf an integer k between 1 and V does not have either k or -k appearing in a group of three integers then you should still assign it a character 'T' or 'F'. Finally, if there are multiple solutions then any will do.\n\nExample", "TESTCASE_1": "2\n3 3\n1 2 3\n1 -2 -3\n-1 2 -3\n2 7\n5 -2 1\n3 -1 2\n\n###---###SEPERATOR---###---\nTFF\nTFTFFTF", "TESTCASE_2": "2\n3 7\n1 2 3\n-1 2 -3\n-1 1 -1\n2 7\n7 0 -1\n3 -1 2\n###---###SEPERATOR---###---\nFTTFFFF\nFFTFFFT\n", "TESTCASE_3": "2\n3 7\n1 1 3\n-1 2 -3\n1 1 -1\n2 7\n4 1 -1\n4 -1 2\n###---###SEPERATOR---###---\nFTTFFFF\nFFFTFFF\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}