{"Q_ID": "1312310025", "S_NAME": "Data types and Operators", "Q_NAME": "Deleting numbers", "Q_DESC": "Sereja has an array of n integers a[1], a[2], ..., a[n]. In one move Sereja can do the following operation\n\nAssume integers v and t, Where 1v,tn, such that, all the elements of the array a[v], a[v + t], a[v + t * 2], ... a[v + t*k] Where k  0 are equal.\n\nTo delete all elements a[v], a[v + t], a[v + t * 2], ... a[v+t*k] from the array. The remaining elements are written in a without any gaps.\n\nNote that you can not decide the value of k. After you decide the integers v and t, k will be set to the largest value possible. That is, the largest k such that v + t * k  n. Your selection of v and t must satisfy the conditions described above for this value of k.\n\nSereja wants to delete the entire array. Help him delete all the elements of the array in the fewest number of moves. Since this is a Challenge Problem, your objective is to minimize the number of moves it takes to delete the entire array.\n\nInput\n\nThe first line contains an integer n, the size of the array. The second line contains integers a[1], a[2], ..., a[n], the integers written in the array.\n\nOutput\n\nFor each test case print in the first line number q, the number of moves you will take. In next q lines print pairs of the integers v[i], t[i] (1iq), the values for v and t that you assume during the move i. Be careful with the output sequence and output format. This problem uses a custom judge. Non adherence to the format may lead to verdicts like internal error, run time error and wrong answer.\n\nConstraints\n\n1  n  100000\n1  a[i]  100000", "TESTCASE_1": "4\n1 2 1 2\n###---###SEPERATOR---###---\n4\n4 4\n3 3\n2 2\n1 1", "TESTCASE_2": "4\n1 4 5 1\n###---###SEPERATOR---###---\n4\n4 1\n3 1\n2 1\n1 1", "TESTCASE_3": "4\n1 0 2 8 4\n###---###SEPERATOR---###---\n4\n4 1\n3 1\n2 1\n1 1", "TESTCASE_4": "4\n0 1 1 0 0\n###---###SEPERATOR---###---\n4\n4 1\n3 1\n2 1\n1 1", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}