{"Q_ID": "1312310002", "S_NAME": "Data types and Operators", "Q_NAME": "Chef and Graph Queries", "Q_DESC": "Chef has a undirected graph G. This graph consists of N vertices and M edges. Each vertex of the graph has an unique index from 1 to N, also each edge of the graph has an unique index from 1 to M.\n\nAlso Chef has Q pairs of integers: Li, Ri (1  Li  Ri  M). For each pair Li, Ri, Chef wants to know: how many connected components will contain graph G if Chef erase all the edges from the graph, except the edges with indies X, where Li  X  Ri. Please, help Chef with these queries.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\nThe first line of each test case contains three integers N, M, Q. Each of the next M lines contains a pair of integers Vi, Ui - the current edge of graph G. Each of the next Q lines contains a pair of integers Li, Ri - the current query.\n\nOutput\n\nFor each query of each test case print the required number of connected components.\n\nConstraints\n\n1  T  1000.\n1  N, M, Q  200000.\n1  Ui, Vi  N.\n1  Li  Ri  M.\nSum of all values of N for test cases is not greater than 200000. Sum of all values of M for test cases is not greater than 200000. Sum of all values of Q for test cases is not greater than 200000.\nGraph G can contain self-loops and multiple edges.", "TESTCASE_1": "2\n3 5 4\n1 3\n1 2\n2 1\n3 2\n2 2\n2 3\n1 5\n5 5\n1 2\n1 1 1\n1 1\n1 1\n###---###SEPERATOR---###---\n2\n1\n3\n1\n1", "TESTCASE_2": "1\n4 4 2\n1 3\n2 3\n1 4\n3 4\n2 3\n4 4\n###---###SEPERATOR---###---\n2\n\n3\n", "TESTCASE_3": "3\n3 2 3\n1 3\n3 2\n1 1\n1 2\n1 2\n4 3 4\n2 3\n1 3\n1 4\n1 3\n2 3\n2 3\n1 1\n5 4 3\n1 4\n4 5\n3 3\n2 3\n1 3\n2 4\n1 2\n\n\n###---###SEPERATOR---###---\n2\n\n1\n\n1\n\n1\n\n2\n\n2\n\n3\n\n3\n\n3\n\n3", "TESTCASE_4": "2\n3 2 3\n1 2\n2 2\n1 2\n1 1\n2 2\n2 3 4\n1 2\n2 1\n1 1\n1 3\n2 3\n1 3\n2 2\n###---###SEPERATOR---###---\n2\n\n2\n\n3\n\n1\n\n1\n\n1\n\n1", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}