{"Q_ID": "1312310006", "S_NAME": "Data types and Operators", "Q_NAME": "Travelling Chef Problem", "Q_DESC": "When Chef is travelling - that's the problem. No one knows when he will change his velocity. But mathematicians are certain that Chef's velocity depends on the current time, and can be described as a cubic polynomial. A cubic polynomial can be defined as:\n\nv(t) = At3 + Bt2 + Ct + D, where A, B, C, D are rational numbers (A is non zero), and t is the current time.\n\nAs for us, all we know is: Chef's velocity at 4 time instances. And we are interested in finding the total distance covered by Chef at time T. We can assume that Chef has started his travel at zero time moment.\n\nInput\n\nThe first line contains an integer N denoting the number of test cases. The first line of each testcase contains an integer T, the time up to which we want to know the distance covered by Chef from time 0. Then 4 lines follow, each containing two integers: ct and cv. Here ct is the time instant and cv is the velocity at time ct.\n\nPlease note, that we pick ct in such a way that cv comes out to be integer. In general the velocity of Chef is real number.\n\nOutput\n\nFor each test case output a single line containing a real number  the distance covered by the Chef in time interval 0 to T. Your answer will be considered as correct if it has relative error less than 10-10.\n\nConstraints\n\n1  N  1000\n1  T  3600\n1  ct  3600\n-1000000  cv  1000000\nFor each testcase values of ct are distinct.", "TESTCASE_1": "2\n5\n2 11\n3 31\n4 69\n5 131\n8\n12 -480\n13 -693\n14 -960\n15 -1287\n###---###SEPERATOR---###---\n173.750000\n80.000000", "TESTCASE_2": "2\n4\n1 10\n2 30\n3 60\n4 130\n6\n2 20\n3 48\n5 63\n6  1\n###---###SEPERATOR---###---\n164.448546017871\n\n238.500000000000", "TESTCASE_3": "3\n7\n2 10\n3 10\n4 10\n6 10\n4\n1 20\n2 30\n3 40\n4 30\n6\n2 20\n3 40\n4 50\n6 100\n\n###---###SEPERATOR---###---\n70.000000000000\n\n120.000000000000\n\n288.101426756400", "TESTCASE_4": "1\n10\n2 10\n6 100\n7 20\n10 10\n###---###SEPERATOR---###---\n1341.70449978193", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}