{"Q_ID": "1312310026", "S_NAME": "Data types and Operators", "Q_NAME": "Edit Distance on Grid", "Q_DESC": "Recently, Chef is learning how to compute the edit distance between two strings.\nToday, Chef wants to generalize the concept of edit distance to 2D-grid(s).\n\nGiven a 2D-grid with N rows and M columns,\neach cell of the grid is either white or black.\nThere are three operations to change the grid:\n\n1) Swap two cells share a common edge, which takes 1 second, or \n\n2) Change one white cell to black, which takes C2 seconds. \n\n3) Change one black cell to white, which takes C3 seconds. \n\nThe parameters C2 and C3 are known, but may be different in different cases.\n\nNow, Chef wants to know the minimal edit distance from the given grid to any connected grid.\nSo, your job is to change the given grid by the three operations above, and make the grid connected as soon as possible.\n\nOne grid is connected if it contains no black cells or all black cells are connected.\nTwo cells A and B are directly connected if their cells share a common edge.\nTwo cells A and B are connected indirectly if there exists another cell C such that A and C are connected (indirectly or directly)\nand B and C are connected (indirectly or directly).\n\nFor scoring propose, your submission will get Wrong Answer if the number of operations for any test case exceeds 1000000. The task does not require minimality, but less time will score more points.\n\nInput\n\nThe first line of the input file contains an integer T, the number of test cases. The description of T test cases follows.\n\nThe first line of each test case contains four integers N, M, C2 and C3\ndenoting the size of the grid and time for Operation 2) and 3).\nThe next N lines describe the board, each line contains an M characters string.\n\nIn the grid, rows are numbered from 1 to N, and columns are numbered from 1 to M.\nThe j-th character of the i-th line can be either 'B' or 'W', representing the color of the cell in the i-th row and j column is black or white.\n\nOutput\n\nFor each test case, output the integer C on the first line, denoting the number of operations.\nThen output C lines for C operations. \n\nFor operation 1), please output '1' followed by the positions of the two cells\nrow1, column1, row2 and column2.\nThe two cells must be in the board and share one edge.\n\nFor operation 2), please output '2' followed by two integers indicates the position of the cell.\nThe cell must be in the board and white before the operation. \n\nFor operation 3), please output '3' followed by two integers indicates the position of the cell.\nThe cell must be in the board and black before the operation.\n\nConstraints\n\n1  T  5\n1  N, M  100\n5  C2  20\n20  C3  40", "TESTCASE_1": "3\n3 4 10 40\nBWWB\nWWWW\nBWWB\n3 4 10 40\nBWWB\nWWWW\nBWWB\n3 4 10 40\nBWWB\nWWWW\nBWWB\n###---###SEPERATOR---###---\n4\n2 2 1\n2 2 2\n2 2 3\n2 2 4\n4\n3 1 1\n3 1 4\n3 3 1\n3 3 4\n6\n1 1 1 1 2\n1 1 2 2 2\n1 2 2 3 2\n1 1 4 1 3\n1 1 3 2 3\n1 2 3 3 3", "TESTCASE_2": "3\n3 4 10 40\nWWWW\nWWBW\nBWWW\n3 4 10 40\nBWBB\nWWBW\nBBWB\n3 4 10 40\nBBWW\nBWBB\nBBBB\n###---###SEPERATOR---###---\n2\n3 2 3\n3 3 1\n7\n3 1 1\n3 1 3", "TESTCASE_3": "3\n3 4 10 40\nBWBW\nWWBB\nBWBB\n3 4 10 40\nBWBW\nBWBW\nWBWB\n3 4 10 40\nBBWW\nWWWW\nBBBB\n###---###SEPERATOR---###---\n7\n3 1 1\n3 1 3\n3 2 3\n3 2 4\n3 3 1", "TESTCASE_4": "3\n3 4 10 40\nBWBW\nWWBB\nBWBB\n3 4 20 30\nBWBW\nBWBW\nWBWB\n3 4 10 40\nBBWW\nWWWW\nBBBB\n###---###SEPERATOR---###---\n7\n3 1 1\n3 1 3\n3 2 3\n3 2 4\n3 3 1\n3 3 3\n3 3 4\n6\n3 1 1\n3 1 3\n3 2 1\n3 2 3\n3 3 2\n3 3 4\n6\n3 1 1\n3 1 2\n3 3 1\n3 3 2\n3 3 3\n3 3 4\n", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}