{"Q_ID": "1313310090", "S_NAME": "Control and Looping", "Q_NAME": "EBCDIC codes", "Q_DESC": "Extended Binary Coded Decimal Interchange Code (EBCDIC) is an 8-bit character encoding used mainly on IBM operating systems. EBCDIC was devised in 1963 and 1964 by IBM and was descended from the 6-bit code used with punched cards of the late 1950's and early 1960's.\n\n\nEBCDIC Hexadecimal values\n\na=81 b=82 c=83 d=84 e=85 f=86 g=87 h=88 i=89 j=91 k=92 l=93 m=94\nn=95 o=96 p=97 q=98 r=99 s=A2 t=A3 u=A4 v=A5 w=A6 x=A7 y=A8 z=A9\nA=C1 B=C2 C=C3 D=C4 E=C5 F=C6 G=C7 H=C8 I=C9 J=D1 K=D2 L=D3 M=D4\nN=D5 O=D6 P=D7 Q=D8 R=D9 S=E2 T=E3 U=E4 V=E5 W=E6 X=E7 Y=E8 Z=E9\n\nspace=40 period=4B comma=6B exclamation=5A\n\nA different character-encoding scheme was also first published in 1963, called the American Standard Code for Information Interchange (ASCII). ASCII is a 7-bit code that was adopted for a wide range of computer systems and became the most commonly used character encoding on the internet. It was surpassed in 2007 by UTF-8, which uses ASCII as a subset. Your laptop, desktop, tablet, and phone almost certainly use ASCII encoding.\n\nDUDE: I thought they were just letters and stuff.\nTECHIE: Dude, each letter is represented by a number. It's called a code.\nDUDE: (nodding slowly) oh.....\n\nBut sometimes old technology lingers and to this day there are systems that store and retrieve data using EBCDIC. Modern mainframes (such as IBM zSeries) include processor instructions, at the hardware level, to accelerate translation between character sets.\n\nWrite a program to convert text from EBCDIC to ASCII.\n\nThe first line of input will indicate the number of lines of EBCDIC. Each line begins with a decimal number of EBCDIC codes, followed by that number of EBCDIC codes.\n\n31\n2 C8 D7 40 C3 96 84 85 E6 81 99 A2 5A\n17 E5 85 95 89 6B 40 A5 89 84 89 6B 40 A5 89 83 89 4B\n21 E6 85 40 81 99 85 40 A3 88 85 40 83 88 81 94 97 89 96 95 A2 4B\n\n", "TESTCASE_1": "31\n2 C8 D7 40 C3 96 84 85 E6 81 99 A2 5A\n17 E5 85 95 89 6B 40 A5 89 84 89 6B 40 A5 89 83 89 4B\n21 E6 85 40 81 99 85 40 A3 88 85 40 83 88 81 94 97 89 96 95 A2 4B\n###---###SEPERATOR---###---\nHP CodeWars!\nVeni, vidi, vici.\nWe are the champions.", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}