{"Q_ID": "1313110019", "S_NAME": "Control and Looping", "Q_NAME": "Eratosthenes", "Q_DESC": "Eratosthenes (275-194 B.C., Greece) devised a sieve to discover prime numbers. A sieve is like a strainer that you use to drain spaghetti when it is done cooking. The water drains out, leaving your spaghetti behind. Eratosthenes's sieve drains out composite numbers and leaves prime numbers behind.\n\nTo use the sieve of Eratosthenes to find the prime numbers up to 100, make a chart of the first one hundred positive integers (1-100):\n\n             1   2   3   4   5   6   7   8   9  10\n            11  12  13  14  15  16  17  18  19  20\n            21  22  23  24  25  26  27  28  29  30\n            31  32  33  34  35  36  37  38  39  40\n            41  42  43  44  45  46  47  48  49  50\n            51  52  53  54  55  56  57  58  59  60\n            61  62  63  64  65  66  67  68  69  70\n            71  72  73  74  75  76  77  78  79  80\n            81  82  83  84  85  86  87  88  89  90\n            91  92  93  94  95  96  97  98  99 100\n\nCross out 1, because it is not prime.\n\nCircle 2, because it is the smallest positive even prime. Now cross out every multiple of 2; in other words, cross out every second number.\n\nCircle 3, the next prime. Then cross out all of the multiples of 3; in other words, every third number. Some, like 6, may have already been crossed out because they are multiples of 2.\n\nCircle the next open number, 5. Now cross out all of the multiples of 5, or every 5th number.\nContinue doing this until all the numbers through 100 have either been circled or crossed out. You have just circled all the prime numbers from 1 to 100!\n\nA prime number is a positive integer that has exactly two positive integer factors, 1 and itself. For example, if we list the factors of 28, we have 1, 2, 4, 7, 14, and 28. \n\nThat's six factors. If we list the factors of 29, we only have 1 and 29. That's two factors. So we say that 29 is a prime number, but 28 isn't.\n\nAnother way of saying this is that a prime number is a positive integer that is not the product of two smaller positive integers.\n\nNote that the definition of a prime number doesn't allow 1 to be a prime number: 1 only has one factor, namely 1.\n\n Prime numbers have exactly two factors, not \"at most two\" or anything like that. When a number has more than two factors it is called a composite number.\n\n", "TESTCASE_1": "99\n###---###SEPERATOR---###---\nNO", "TESTCASE_2": "17\n###---###SEPERATOR---###---\nYES", "TESTCASE_3": "5\n###---###SEPERATOR---###---\nYES", "TESTCASE_4": "2512\n###---###SEPERATOR---###---\nNO", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}