{"Q_ID": "1314110084", "S_NAME": "Arrays", "Q_NAME": "Rupsa and the Game", "Q_DESC": "Princess Rupsa saw one of her friends playing a special game. The game goes as follows:\n\nN+1 numbers occur sequentially (one at a time) from A0 to AN.\nYou must write the numbers on a sheet of paper, such that A0 is written first. The other numbers are written according to an inductive rule  after Ai-1 numbers have been written in a row, then Ai can be written at either end of the row. That is, you first write A0, and then A1 can be written on its left or right to make A0A1 or A1A0, and so on.\nAi must be written before writing Aj, for every i < j.\n\nFor a move in which you write a number Ai (i>0), your points increase by the product of Ai and its neighbour. (Note that for any move it will have only one neighbour as you write the number at an end).\n\nTotal score of a game is the score you attain after placing all the N + 1 numbers.\n\nPrincess Rupsa wants to find out the sum of scores obtained by all possible different gameplays. Two gameplays are different, if after writing down all N + 1 numbers, when we read from left to right, there exists some position i, at which the gameplays have aj and ak written at the ith position such that j  k. But since she has recently found her true love, a frog Prince, and is in a hurry to meet him, you must help her solve the problem as fast as possible. Since the answer can be very large, print the answer modulo 109 + 7.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases.\nThe first line of each test case contains a single integer N.\nThe second line contains N + 1 space-separated integers denoting A0 to AN.\nOutput\n\nFor each test case, output a single line containing an integer denoting the answer.\nConstraints\n\n1<=T <=10\n1 <=N <=105\n1<= Ai <=109\n\nThere are 2 possible gameplays. A0A1 which gives score of 2 and A1A0 which also gives score of 2. So the answer is 2 + 2 = 4", "TESTCASE_1": "2\n1\n1 2\n2\n1 2 1\n###---###SEPERATOR---###---\n4\n14", "TESTCASE_2": "2\n1\n4 7\n2\n17 20 21\n###---###SEPERATOR---###---\n56\n2914", "TESTCASE_3": "1\n1\n41 21\n###---###SEPERATOR---###---\n1722", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}