{"Q_ID": "1315110032", "S_NAME": "Classes and Objects", "Q_NAME": "Welcome Message", "Q_DESC": "In order to welcome the users who visit the site, you have decided to display a personalized welcome message on the Home page after each user logs in. Create a class named Welcome with 3 private member variables  name of type String, gender of type String and relation of type String. Include the appropriate getter and setter methods. Include a method named displayMessage that accepts no arguments and its return type is void. In this method display the message [if the relation is self and gender is female] Welcome Ms.! All the best to get a suitable groom for you \n\n[if the relation is self and gender is male] Welcome Mr.! All the best to get a suitable bride for you \n\n[if the relation is parent and gender is male] Welcome Mr.! All the best to get a suitable life partner for your son or daughter [if the relation is parent and gender is female] Welcome Ms.! All the best to get a suitable life partner for your son or daughter In the main method, create an instance of the Welcome class and invoke the corresponding methods.\n\n\nMandatory:\n\n1. Create a new class Welcome and the object name for the class should be obj\n\n2. Create two methods as follows:\n\na. Method name = welcomeMessage()\nb. Type = void\nc. Access Specifier = public\nd. Argument Type = no arguments\n\n3. Access the methods welcomeMessage() using the object name obj from the main method\n\n4. The input details are promoted in welcomeMessage() and the appropriate welcome message needs to be printed.", "TESTCASE_1": "Nikitha\nFemale\nSelf\n###---###SEPERATOR---###---\nWelcome Ms.Nikitha! All the best to get a suitable groom for you", "TESTCASE_2": "Raj\nMale\nParent\n###---###SEPERATOR---###---\nWelcome Mr.Raj! All the best to get a suitable life partner for your son or daughter", "TESTCASE_3": "Janani\nFemale\nSelf\n###---###SEPERATOR---###---\nWelcome Ms.Janani! All the best to get a suitable groom for you", "TESTCASE_4": "Harish\nMale\nParent\n###---###SEPERATOR---###---\nWelcome Mr.Harish! All the best to get a suitable life partner for your son or daughter", "TESTCASE_5": "obj.welcomeMessage();\n###---###SEPERATOR---###---\npublic void welcomeMessage()"}