{"Q_ID": "1315210018", "S_NAME": "Classes and Objects", "Q_NAME": "Misha and Gym", "Q_DESC": "When Misha hits his favorite gym, he comes across an interesting problem with the barbell. In the gym, someone always leaves the weight plates in the strangest places you can imagine and sometime it's difficult to equip the barbell the way you want. Let's imagine that you have N weight plates placed in any order (remember that any gym has no more than K different types of weight plates and all weights are square-free). As a preliminary step towards solving this problem, Misha wants to simulate a simple gym, and for this purpose you have to deal with some queries:\n\n[1 I X] Set the weight of the ith weight plate to value X.\n[2 L R] Reverse the sequence of weight plates in the interval from L to R, where 1  L  R  N.\n[3 L R W] Check the interval from L to R to find out if you can make the weight W using only weight plates on this interval. (Note: this type of query will appear no more than P times)\nPlease help Misha in solving this problem.\n\nInput\n\nFirst line of input contains the number of weight plates N, and number of queries Q. Next line contains N integers w1, w2, ..., wN, where wi is the weight of the ith weight plate. Next Q lines contain some queries described above.\n\nOutput\n\nFor all queries of the third type: print Yes if your check returns a positive outcome, and No otherwise.\n\nConstraints\n\n1  N, W, Q  105\nK  10\nP  1000\nAll numbers in the input are positive integers and  105.\nAll the weights are square-free.\nSubtasks\n\nSubtask 1: 1  N  103, 1  W  103, Q = 1 - 10 pts.\nSubtask 2: 1  N  103, 1  W  103, 1  Q  103, P  100 - 15 pts\nSubtask 3: 1  N  104, 1  W  104, 1  Q  104, P  300 - 25 pts.\nSubtask 4: 1  N  105, 1  W  105, 1  Q  105, K  2 - 20 pts.\nSubtask 5: Original constraints - 30 pts.", "TESTCASE_1": "5 10\n1 2 3 5 6\n3 2 3 3\n3 2 3 4\n3 2 3 5\n2 2 5\n3 2 4 8\n1 2 1\n3 2 4 8\n2 1 4 \n3 2 4 3 \n3 1 5 7 \n###---###SEPERATOR---###---\nYes\nNo\nYes\nYes\nYes\nNo\nYes", "TESTCASE_2": "3 4\n2013 2015 2017\n3 1 3 4030\n1 1 111\n3 1 3 4030\n3 1 2 111\n###---###SEPERATOR---###---\nYes\nNo\nYes", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}