{"Q_ID": "1315210007", "S_NAME": "Classes and Objects", "Q_NAME": "Laddu", "Q_DESC": "You might have heard about our new goodie distribution program aka the Laddu Accrual System. This problem is designed to give you a glimpse of its rules. You can read the page once before attempting the problem if you wish, nonetheless we will be providing all the information needed here itself.\n\nLaddu Accrual System is our new goodie distribution program. In this program, we will be distributing Laddus in place of goodies for your winnings and various other activities (described below), that you perform on our system. Once you collect enough number of Laddus, you can then redeem them to get yourself anything from a wide range of CodeChef goodies.\n\nLet us know about various activities and amount of laddus you get corresponding to them.\n\nContest Win (CodeChefs Long, Cook-Off, LTIME, or any contest hosted with us) : 300 + Bonus (Bonus = 20 - contest rank). Note that if your rank is  20, then you won't get any bonus.\nTop Contributor on Discuss : 300\nBug Finder : 50 - 1000 (depending on the bug severity). It may also fetch you a CodeChef internship!\nContest Hosting : 50\nYou can do a checkout for redeeming laddus once a month. The minimum laddus redeemable at Check Out are 200 for Indians and 400 for the rest of the world.\n\nYou are given history of various activities of a user. The user has not redeemed any of the its laddus accrued.. Now the user just wants to redeem as less amount of laddus he/she can, so that the laddus can last for as long as possible. Find out for how many maximum number of months he can redeem the laddus.\n\nInput\n\nThe first line of input contains a single integer T denoting number of test cases\nFor each test case:\nFirst line contains an integer followed by a string denoting activities, origin respectively, where activities denotes number of activities of the user, origin denotes whether the user is Indian or the rest of the world. origin can be INDIAN or NON_INDIAN.\nFor each of the next activities lines, each line contains an activity. \nAn activity can be of four types as defined above.\nContest Win : Input will be of form of CONTEST_WON rank, where rank denotes the rank of the user.\nTop Contributor : Input will be of form of TOP_CONTRIBUTOR.\nBug Finder : Input will be of form of BUG_FOUND severity, where severity denotes the severity of the bug.\nContest Hosting : Input will be of form of CONTEST_HOSTED.\nOutput\n\nFor each test case, find out the maximum number of months for which the user can redeem the laddus accrued.\nConstraints\n\n1  T, activities  100\n1  rank  5000\n50  severity  1000\nSubtasks\n\nThere is only a single subtask with 100 points.", "TESTCASE_1": "2\n4 INDIAN\nCONTEST_WON 1\nTOP_CONTRIBUTOR\nBUG_FOUND 100\nCONTEST_HOSTED\n4 NON_INDIAN\nCONTEST_WON 1\nTOP_CONTRIBUTOR\nBUG_FOUND 100\nCONTEST_HOSTED\n###---###SEPERATOR---###---\n3\n1", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}