{"Q_ID": "1316110004", "S_NAME": "Methods", "Q_NAME": "Chef and Keyboard", "Q_DESC": "Chef is a well known programmer. He owns a brand new Android phone of screen size of dimension n  m (n denotes the height of the phone and m denotes the width). Chef wants to design a program for painting the screen. He figured out c colors, which he will use to paint the screen. He wants to paint some rectangular section of pixels of the screen each with different color. Also Chef would like to use all of his c colors in painting.\n\nCan you help Chef in finding number of different dimensions of rectangular section he can paint? In other words, find number of pairs x, y such that Chef can paint a rectangular section of dimension x  y (x denotes height, y denotes width) on the screen. Please note that Chef uses a fix orientation of his phone and is not allowed to rotate it, i.e. height always stays n and width always stays m and not the other way around.\n\nInput\nFirst line of the input contains an integer T denoting the number of test cases. T test cases follow.\nOnly line of each test case contains three space separated integers n, m, c.\n\nOutput\nFor each test case, output a single line containing the answer for the test case.\n\nMandatory:\n\n1. Create a class and a method named \"public void keyboard\" with takes no arguments and the method type is void\n\nMethodname = keyboard\nArgument = None\nAccess Specifier = public\nReturn Type = void\n\n2. Access the method \"public void keyboard()\" from the main method and the instance name for access the  keyboard method is \"objname\"\n\nobjname.keyboard()", "TESTCASE_1": "1\n4 6 12\n###---###SEPERATOR---###---\n3", "TESTCASE_2": "2\n3 3 10\n4 2 3\n###---###SEPERATOR---###---\n0\n1", "TESTCASE_3": "5\n4 2 3\n3 3 10\n4 2 3\n4 6 12\n4 6 12\n###---###SEPERATOR---###---\n1\n0\n1\n3\n3", "TESTCASE_4": "10\n4 2 3\n3 3 10\n4 2 3\n4 6 12\n4 6 12\n4 2 3\n3 3 10\n4 2 3\n4 6 12\n4 6 12\n###---###SEPERATOR---###---\n1\n0\n1\n3\n3\n1\n0\n1\n3\n3", "TESTCASE_5": "public void keyboard()\n###---###SEPERATOR---###---\nobjname.keyboard()"}