{"Q_ID": "1317110019", "S_NAME": "Strings", "Q_NAME": "Uncle Johny", "Q_DESC": "Vlad enjoys listening to music. He lives in Sam's Town. A few days ago he had a birthday, so his parents gave him a gift: MP3-player! Vlad was the happiest man in the world! Now he can listen his favorite songs whenever he wants!\n\nVlad built up his own playlist. The playlist consists of N songs, each has a unique positive integer length. Vlad likes all the songs from his playlist, but there is a song, which he likes more than the others. It's named \"Uncle Johny\".\n\nAfter creation of the playlist, Vlad decided to sort the songs in increasing order of their lengths. For example, if the lengths of the songs in playlist was {1, 3, 5, 2, 4} after sorting it becomes {1, 2, 3, 4, 5}. Before the sorting, \"Uncle Johny\" was on K-th position (1-indexing is assumed for the playlist) in the playlist.\n\nVlad needs your help! He gives you all the information of his playlist. Your task is to find the position of \"Uncle Johny\" in the sorted playlist.\n\nInput Format:\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each test case contains one integer N denoting the number of songs in Vlad's playlist. The second line contains N space-separated integers A1, A2, ..., AN denoting the lenghts of Vlad's songs. The third line contains the only integer K - the position of \"Uncle Johny\" in the initial playlist. \n\nOutput:\nFor each test case, output a single line containing the position of \"Uncle Johny\" in the sorted playlist. \n\nConstraints\n1  T  1000\n\n1  K  N  100\n\n1  Ai  10 power 9", "TESTCASE_1": "3\n4\n1 3 4 2\n2\n5\n1 2 3 9 4\n5\n5\n3 5 8 1 2\n1\n###---###SEPERATOR---###---\n3\n4\n3", "TESTCASE_2": "4\n5\n1 4 3 2 5\n2\n4\n3 6 2 1\n4\n5\n4 6 2 7 1\n2\n6\n7 3 5 2 9 1\n3\n###---###SEPERATOR---###---\n4\n1\n4\n4", "TESTCASE_3": "3\n6\n1 5 4 2 8 7\n3\n5\n7 4 1 6 4\n4\n7\n5 2 4 8 1 3 2\n6\n###---###SEPERATOR---###---\n3\n4\n4", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}