{"Q_ID": "1317310010", "S_NAME": "Strings", "Q_NAME": "STRING REVERSING", "Q_DESC": "Reversing Words with options: Write a function (method) that takes as input a string (sentence) and generates a new string (modified sentence) by reversing the words in the original string, maintaining the words positions. \nIn addition, the function should be able to control the reversing of the case (uppercase or lowercase) based on a case_option parameter, as follows \n\nIf case_option = 0, Normal reversal of words\ni.e. If the original sentence is Wipro TechNologies BangaLore, \nthe new reversed sentence should be orpiW seigoloNhceT eroLagnaB\n\nIf case_option = 1, Reversal of words with retaining positions Case\ni.e. If the original sentence is Wipro TechNologies BangaLore, \nthe new reversed sentence should be Orpiw SeigOlonhcet ErolaGnab\nNote that positions 1, 7, 11, 20 and 25 in the original string are uppercase W, T and B.\nSimilarly positions 1, 7, 11, 20 and 25 in the new string are uppercase O, S, O, E and G.\n\nIf case_option = 2, Reversal of words including Case\ni.e. If the original sentence is Wipro Technologies Bangalore, \nthe new reversed sentence should be ORPIw SEIGOLONHCEt EROLAGNAb\nNote that W, T and B, that were uppercase in original string have become lowercase and all the lowercase letters have become uppercase.\n\nThe prototype of the function is:\npublic static voidreverseWords_andCase(String sentence, int case_option);\nThe reversed string is expected to be assigned to the member String output1.\n\nNOTE:\na) Only space character should be treated as the word separator. i.e. Hello World should be treated as two separate words Hello and World. However, Hello,World, Hello;World, Hello-World or Hello/World should be considered as a single word.\nb) Non-alphabetic characters in the string will not be subjected to case-changes. For example, if case_option=1, and the original sentence is Wipro TechNologies, Bangalore, the new reversed sentence should be Orpiw ,seiGolonhceT Erolagnab. Note that comma has been treated as part of the word Technologies, and because comma had to take the position of uppercase T it remained as a comma and uppercase T took the position of comma. However the words Wipro and Bangalore have changed to Orpiw and Erolagnab.\n\nc) Some more examples \nInput string = I Am alWays 24#7 Busy. \nWith case-option = 0, reversed string will be I mA syaWla 7#42 .ysuB\nWith case-option = 1, reversed string will be I Ma syAwla 7#42 .ysuB\nWith case-option = 2, reversed string will be i Ma SYAwLA 7#42 .YSUb\n\nd) Please ensure that no extra (additional) space characters are embedded within the resultant reversed string.\n", "TESTCASE_1": "Wipro Technologies Bangalore\n###---###SEPERATOR---###---\norpiW seigolonhceT erolagnaB", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}