{"Q_ID": "1317310001", "S_NAME": "Strings", "Q_NAME": "STRING ENCODING", "Q_DESC": "Encoding Three Strings:  Anand was assigned the task of coming up with an encoding mechanism for any given three strings. He has come up with the below plan.\nStep One: Given any three strings, break each string into 3 parts each.\nFor Example  If the three strings are as below \nInput1=John\nInput2=Johny\nInput3=Janardhan\nJohn should be split into J, oh,n as the FRONT,MIDDLE and END parts respectively.\nJohny should be split into Jo, h,ny as the FRONT,MIDDLE and END parts respectively.\nJanardhan should be split into Jan, ard,han as the FRONT, MIDDLE and END parts respectively.\ni.e. if the no. of characters in the string are in multiples of 3, then each split-part will contain equal no. of characters, as seen in the example of Janardhan\nIf the no. of characters in the string are NOT in multiples of 3, and if there is one character more than multiple of 3, then the middle part will get the extra character, as seen in the example of John\nIf the no. of characters in the string are NOT in multiples of 3, and if there are two characters more than multiple of 3, then the FRONT and END parts will get one extra character each, as seen in the example of Johny\nSTEP TWO: Concatenate (join) the FORNT, MIDDLE and END parts of the strings as per the below specified concatenation-rule to form three Output Strings.\nOutput1= FRONT part of input1+MIDDLE part of Input2+END part of Input3\nOutput2= MIDDLE part of input1+END part of Input2+FRONT part of Input3\nOutput3= END part of input1+FRONT part of Input2+MIDDLE part of Input3\nFor example, for the above specified example strings,\nOutput1= J+h+han=Jhhan\nOutput2=oh+ny+Jan=ohnyJan\nOutput3=n+Jo+ard=nJoard\nSTEP THREE: Process the resulting output strings based on the output-processing rule.\nAfter the above, we will now have three output strings. Further processing is required only for the third output string as per below rule-\nToggle the case of each character in the string, i.e in the third output string, all lower-case characters should be made upper-case and vice versa.\nFor example, for the above example strings, Output3 is nJoard, so after applying the toggle rule Output3 should become NjOARD.\nFINAL RESULT  The three output strings after applying the above three steps is the final result. i.e. for the above example,\nOutput1=Jhhan\nOutput2=ohnyJan\nOutput3=NjOARD\nAnand approaches you to help him write a program that would do the above mentioned processing on any given three strings and generate the resulting three output strings.\nEXAMPLE 1:\nInput1=John\nInput2=Johny\nInput3=Janardhan\nOutput1=Jhhan\nOutput2=ohnyJan\nOutput3=NjOARD\n", "TESTCASE_1": "Raagam\nTalam\nPallavi\n###---###SEPERATOR---###---\nagTaavi\namlPal\nrAAML\n", "TESTCASE_2": "indiawingol\nvandhemadhara\nponaru\n###---###SEPERATOR---###---\nindihemadru\nawiharapo\nngolvandna", "TESTCASE_3": "ram\nraj\njoy\n###---###SEPERATOR---###---\nray\najj\nmro", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}