{"Q_ID": "1317310006", "S_NAME": "Strings", "Q_NAME": "USER ID GENERATION", "Q_DESC": "osephs team has been assigned the task of creating user-ids for all participants of an online gaming completion. Joseph has designed a process for generating the user-id using the participants First_Name, Last_Name, PIN code and a number N. The process defined by Joseph is as below-\nStep 1: Compare the lengths of First_Name and Last_Name of the participant. The one that is shorter will be called Smaller Nameand the one that is longer will be called the Longer Name. If both First_Name and Last_Name are of equal length, then the name that appears ealier in alphabetical order will be called Smaller Name and the name that appears laterr in alphabetical order will be called the Longer Name. \nStep 2: The user id should be generated as below- \nFirst Letter of the smaller name + Entire word of the longername+Digit at position N in the PIN when traversing the PIN from right to left.\nStep 3 :Toggle the alphabets of the user id generated in step-2 i.e., upper-case alphabets should become lower-case and lower-case should become upper-case.\nLet us see a few examples.\nExample 1: If the participants details are as below \nFirst_Name = Rajiv\nLast_Name = Roy\nPIN  560037\nN=6\nStep 1: Length of Last_Name is less than the length of First_Name, so the smaller name is Royand the Longer name is Rajiv.\nStep 2: The user-id will be = First letter of the longer name + Entire word of the smaller name + Digit at position N in the PIN when traversing the PIN from right to left\n=First letter of R+Entire word of Rajiv+6th digit of PIN from left+6th Digit of PIN from right.\n=R+Rajiv+7+5\nTherefore user-id = RRajiv75.\nStep 3 : Toggle the alphabets in the user-id. So, user-id = rrAJIV75\n", "TESTCASE_1": "karan\nraju\n603203\n4\n###---###SEPERATOR---###---\nRKARAN23", "TESTCASE_2": "urjasvit\nsinha\n603203\n4\n###---###SEPERATOR---###---\nSURJASVIT23", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}