{"Q_ID": "1319110013", "S_NAME": "Exceptional Handling", "Q_NAME": "Triangle Validity - User Defined Exception", "Q_DESC": "Write a Java program to create a TestClass class with three sides. \n\nThis class should follow the rule that sum of any two sides is greater than the third side. To enforce this rule, the constructor in the Triangle class must throw an exception named IllegalTriangleException.\n\nThe class IllegalTriangleException must extend the base class Exception\n\nCreate a user-defined exception named IllegalTriangleException and display the error message of the exception whenever the rule is violated.\n\nInput to the program is the three sides of a triangle. If the three sides obey the rule of triangle sides, print Valid Sides.\n\nHelp:\n\n1. Create a class IllegalTriangleException  extends Exception\n\n2. Create a default Constructor under IllegalTriangleException   class as follows\n\na. Method Name = IllegalTriangleException\nb. Access Specifier = public\nc. Argument = No Argument\n\n3. In the main method get the input of Triangle Sides and call the  static method under main class (TestClass)  \n\nIf the rules gets violates \n\nRule: This class should follow the rule that sum of any two sides is greater than the third side. To enforce this rule, the constructor in the Triangle class must throw an exception named IllegalTriangleException.\n\nthrow new IllegalTriangleException() \n\n4. Use catch block with user defined exception as  llegalTriangleException  with exception instance as e\n\n5. Print the exception message e whenever the exception is thrown from methods\n", "TESTCASE_1": "4 5 3\n###---###SEPERATOR---###---\nValid Sides", "TESTCASE_2": "4 7 9\n###---###SEPERATOR---###---\nValid Sides", "TESTCASE_3": "14 2 1\n###---###SEPERATOR---###---\nIllegalTriangleException", "TESTCASE_4": "4 2 1\n###---###SEPERATOR---###---\nIllegalTriangleException", "TESTCASE_5": "throw new IllegalTriangleException()\n###---###SEPERATOR---###---\nclass IllegalTriangleException extends Exception"}