{"Q_ID": "1319310001", "S_NAME": "Exceptional Handling", "Q_NAME": "Icing Crowns", "Q_DESC": "The Chef has been asked to decorate a birthday cake for a little child. The parents of the child requested that he draw a crown out of icing on the cake. The Chef has already added some icing blossoms and now it is time to add the crown. If we imagine the blossoms as being points on the x-y plane, he draws this crown according to the following rules. For a point p, we will let x(p) and y(p) denote the x and y coordinates of p, respectively.\n\n1) The crown is a polygon defined by a sequence of an odd number of points (i.e. icing blossoms) p1, p2, ..., pk. The polygon has line segments from pi to pi+1 for each 1  i  k as well as a line segment from pk to p1. If we translate the points so that p1 is at the origin and then rotate the points about the origin so that pk lies on the positive x axis, then x(pi)  x(pi+1) for each 1  i  k and y(pi)  0 for each 1  i  k. Furthermore, for any index 1  i  k we have that y(pi)  y(pi-1) if i is even and y(pi)  y(pi-1) if i is odd. To paraphrase, after translating and rotating the points we have that the x coordinates of the points are strictly increasing, the y coordinates of all but the two endpoints are strictly positive, and the difference between y coordinates of successive points alternates between positive and negative.\n\n2) No blossoms may be contained strictly in the interior of the crown.\n\nYou can find some pictures of crowns following the sample data for this problem.\n\nSubject to these restrictions, the Chef wants to draw the crown with the largest possible area. Thankfully, his job is made slightly simpler since no three blossoms are collinear.", "TESTCASE_1": "4\n4\n0 0\n0 1\n1 0\n1 1\n6\n0 0\n10 0\n3 1\n8 6\n1 7\n4 7\n5\n-4 10\n-10 -1\n-2 3\n8 4\n0 5\n7\n2 -6\n6 3\n10 8\n-3 -9\n9 2\n0 0\n-9 -9\n###---###SEPERATOR---###---\n0.5\n36.5\n57.0\n66.5\n", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}