{"Q_ID": "1319310007", "S_NAME": "Exceptional Handling", "Q_NAME": "Rook placement", "Q_DESC": "Chef and Sous Chef are playing a game. There are N rooks right next to a chessboard. The chessboard has R rows and C columns. The rows are numbered from 1 to R from top to bottom. The columns are numbered from 1 to C from left to right.\n\nChef will place the N rooks within the R*C cells of the chessboard. He may keep multiple rooks on the same cell. You may assume that each cell is large enough to hold all of the N rooks. After placing the N rooks, some of the cells may remain empty.\n\nNote that not all possible placements of rooks within the R*C cells are valid. If there is a rook at cell (r, c) then there should be no rooks in the cells (u, v) where u < r AND v > c.\n\nFollowing the Chef's placement of the rooks, the Sous Chef will make an unlimited number of moves - including, of course, the possibility of no move at all. In each move he may move a rook to one cell up or one cell left of its position. He cannot move a rook out of the chessboard. At the end of all the moves (i.e. not necessarily at the end of each move, but at the end of all of them), Sous Chef must also ensure that the board is valid according to the condition given above.\n\nThe Sous Chef will win, if he can move the rooks into a valid arrangement where no pairs of rooks attack each other. In other words, into a valid arrangement where no pairs of rooks share the same row or the same column.\n\nChef, being Chef - having such wonderful cooks for his advantage - has asked you to count the number of valid ways he can place N rooks in a chessboard with R rows and C columns such that the Sous Chef cannot win. 2 initial arrangements are considered different if there is at least one cell that contains different number of rooks.", "TESTCASE_1": "4\n2 2 1\n2 2 2\n3 2 2\n3 3 2\n\n###---###SEPERATOR---###---\n0\n5\n8\n11", "TESTCASE_2": "8\n4 2 1\n5 2 2\n6 2 2\n3 3 2\n1 2 1\n1 2 2\n3 2 2\n2 3 2\n###---###SEPERATOR---###---\n0\n\n17\n\n23\n\n11\n\n0\n\n3\n\n8\n\n8", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}