{"Q_ID": "1320210027", "S_NAME": "Generics and Collections", "Q_NAME": "pair count", "Q_DESC": "In computer science, a set is an abstract data type that can store certain values, without any particular order, and no repeated values(Wikipedia).{1,2,3}  is an example of a set, {1,2,2}but  is not a set. Today you will learn how to use sets in java by solving this problem.\n\nYou are given  pairs of strings. Two pairs (a,b)  and (c,d) are identical if a=c  and b=d . That also implies (a,b) is not same as(b,a) . After taking each pair as input, you need to print number of unique pairs you currently have.\n\nComplete the code in the editor to solve this problem.\n\nInput Format\n\nIn the first line, there will be an integer T denoting number of pairs. Each of the next T lines will contain two strings seperated by a single space.\n\nConstraints:\n1<=T<=100000\nLength of each string is atmost 5 and will consist lower case letters only.\n\nOutput Format\n\nPrint  T lines. In the ith line, print number of unique pairs you have after taking  ith pair as input.\n\nSample Input\n\n5\njohn tom\njohn mary\njohn tom\nmary anna\nmary anna\n\nSample Output\n\n1\n2\n2\n3\n3\n\nExplanation\n\nAfter taking the first input, you have only one pair: (john,tom)\nAfter taking the second input, you have two pairs: (john, tom) and (john, mary)\nAfter taking the third input, you still have two unique pairs.\nAfter taking the fourth input, you have three unique pairs: (john,tom), (john, mary) and (mary, anna)\nAfter taking the fifth input, you still have three unique pairs.", "TESTCASE_1": "5\njohn tom\njohn mary\njohn tom\nmary anna\nmary anna\n###---###SEPERATOR---###---\n1\n2\n2\n3\n3", "TESTCASE_2": "4\nram krishna\nkrishna ram\nram krishna\npraveen kumar\n###---###SEPERATOR---###---\n1\n2\n2\n3", "TESTCASE_3": "4\nbala krishna\nprabas raju\nrana daggubati\nbala krishna\n###---###SEPERATOR---###---\n1\n2\n3\n3", "TESTCASE_4": "5\nsumit abinav\nabinav sumit\nhussai narasimha\nsurya teja\nhussai narasimha\n###---###SEPERATOR---###---\n1\n2\n3\n4\n4", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}