{"Q_ID": "1111210007", "S_NAME": "Input & Ouput", "Q_NAME": "Gaurik and his game", "Q_DESC": "At the end of a busy day, The Gaurik and his assistants play a game together. The game is not just for fun but also used to decide who will have to clean the kitchen. The Gaurik is a Game Master, so his concern is how to manage the game but not how to win the game like his assistants do.\nThe game requires players to find the only ball under one of the N cups after their positions are changed in a special way. At the beginning of the game, The Gaurik places N cups in a row and put a ball under the C-th cup from the left (the cups are numbered from 1 to N). All players can see the initial position of the ball. Then Gaurik performs Q flip operations. Each flip operation is defined by two integers L and R such that 1< L < R < N and consists in reversing the segment [L, R] of cups. Namely, Gaurik swaps L-th and R-th cups, (L+1)-th and (R?1)-th cups, and so on. After performing all the operations Gaurik asks his assistants to choose a cup that they think the ball is under it. Who can guess the position of the ball will win the game, and of course, the others will have to clean the kitchen.\nThe Gaurik does not want to check all the N cups at the end of the game. He notes down the value of C and the pairs (L, R) and asked you, the mastered programmer, to determine the cup that contains the ball.\nInput\nThe first line of the input contains a single integer T, denoting the number of test cases. The description of T test cases follows. The first line of each test case contains three space-separated integers N, C and Q, denoting the total number of cups, the initial position of the ball and the number of flip operations Gaurik will perform. Each of the following Q lines contains two space-separated integers L and R, denoting the ends of the segment of the current flip operation.\nOutput\n\nFor each test case output on a separate line the final position of the ball.\nConstraints\n\n    1 <=T <= 10\n    1 <= N <= 100000 (10^5) ", "TESTCASE_1": "1\n5 2 3\n1 4\n3 5\n1 5\n###---###SEPERATOR---###---\n1", "TESTCASE_2": "2\n10 4 3\n1 9\n3 4\n5 8\n5 2 2\n1 5\n1 4\n###---###SEPERATOR---###---\n7\n1", "TESTCASE_3": "2\n2 4 5\n2 4\n2 1\n1 5\n2 8\n2 8\n1 2 7\n1 9\n9 8\n3 9\n1 5\n2 6\n2 9\n2 8\n###---###SEPERATOR---###---\n4\n5", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}