{"Q_ID": "1111310012", "S_NAME": "Input & Ouput", "Q_NAME": "Vogon Zoo", "Q_DESC": "On the icy planet Zorg, the Vogons are putting together a zoo. One cage will house a collection of Kubudu dragons. Unlike the limited number of blood types found in other creatures, Kubudu dragons have a large variety of blood types. Each dragons blood type is ?xed when it is born and is given by a positive integer.\n\nThese blood types determine how the dragons interact with each other. Two dragons whose blood types are close to each other will quickly start ?ghting and eventually destroy each other. At any given time, there is a threshold K such that it is safe to put two Kubudu dragons in the same cage only if their blood types di?er by K or more.\n\nA batch of freshly hatched Kubudu dragons has arrived. Each dragon has had its blood tested and is tagged with its blood type. The Vogon zookeeper would like to determine the size of the largest collection of dragons from this batch that can safely be placed in a single cage. Given the dragons ?ghting tendencies, this means that for each pair of dragons in the cage, their blood types should di?er by at least K.\n\nFor instance, suppose that K is 3 and there are 12 Kubudu dragons whose blood types are 1, 5, 6, 1, 8, 3, 12, 2, 13, 7, 9 and 11. From this batch, the maximum number of dragons that can be placed safely in the same cage is 4?for example, the dragons with blood types: 6, 12, 2 and 9.\n\nYou will be given the blood types of N Kubudu dragons and the threshold K. Your task is to compute the size of the largest group of dragons from this collection that can safely be placed in the same cage.\n\nInput\n\nThe ?rst line of input has two space separated integers N and K, where N is the number of Kubudu dragons and K is the threshold below which they ?ght, as described above. The second line of input consists of N space separated integers, the blood types of the N dragons.\n\nOutput\n\nA single integer, the size of the largest collection of dragons that can be safely placed in the same cage.\n\nTest data\nIn all cases, 1<=N<=106. In 30% of the inputs, 1<=N<=5000. The blood types of the dragons lie in the range 1 to 107", "TESTCASE_1": "12 3 \n1 2 4 5 3 4 6 7 8 9 6 5\n###---###SEPERATOR---###---\n3", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "12 3 \n1 5 6 1 8 3 12 2 13 7 9 11\n###---###SEPERATOR---###---\n4", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}