{"Q_ID": "1111110042", "S_NAME": "Input & Ouput", "Q_NAME": "Exchange of gifts", "Q_DESC": "Emily is a very popular Maths Teacher in School. She retires from her service today. Her 7th class students like her very much and they wanted to give her a grand farewell at school. The school HeadMistress is a very strict person and she didn't give permission for them to conduct the farewell in the school premises. The students decided to conduct the farewell at Emily Mam's house itself.\n\n\nThey know the street in which Emily mam lives. The student leader asked Emily Mam to tell her house number. Emily Mam's last class was on Equation for a straight line. She said that a straight line can be represented by the equation y=mx+c and you know how to find the x-intercept and y-intercept of the line and my house number is the sum of the x-intercept and y-intercept of the line.\n\n\nThe students were puzzled. Can you help the students find the house number of Emily Mam?\n\n\nGiven the values of m and c of the line equation y=mx+c, write a C program to find the sum of x-intercept and y-intercept.\n\n\nInput Format:\n\nInput consists of 2 integers. The first integer corresponds to m and the second integer corresponds to c.\n\n\nOutput Format:\n\nRefer Sample Input and Output for exact formatting specifications.\n\n[Assume that the inputs are such that the intercept values are always integers]", "TESTCASE_1": "5 10\n###---###SEPERATOR---###---\nThe line equation is y=5x+10\nThe x intercept is -2\nThe y intercept is 10\nThe house number is 8\n\n", "TESTCASE_2": "2 5\n###---###SEPERATOR---###---\nThe line equation is y=2x+5\nThe x intercept is -2\nThe y intercept is 5\nThe house number is 3", "TESTCASE_3": "5 9 \n###---###SEPERATOR---###---\nThe line equation is y=5x+9\nThe x intercept is -1\nThe y intercept is 9\nThe house number is 8", "TESTCASE_4": "9 5\n###---###SEPERATOR---###---\nThe line equation is y=9x+5\nThe x intercept is 0\nThe y intercept is 5\nThe house number is 5", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}