{"Q_ID": "1111310021", "S_NAME": "Input & Ouput", "Q_NAME": "Sereja and Votes ", "Q_DESC": "Sereja conducted a voting about N of his opinions. Ai percent of people voted for opinion number i. This statistics is called valid if sum of all Ai is equal to 100.\n\nNow let us define rounding up of a statistics A.\n\nIf Ai is not an integer, it will be rounded up to next integer.\nOtherwise it will be left as it is.\ne.g. 4.1 became 5, 4.9 became 5 but 6 will still be 6.\nNow let us consider a statistics B of size N in which each of Bi is an integer. Now he wants to know whether there exists some valid statistic A of size N (may contain real numbers) such that after rounding it up, it becomes same as B?\n\nInput\n\nFirst line of input contain integer T - number of test cases.\nFor each test, case first line contains integer N - number of opinions.\nNext line contains N integers B1, B2, ..., BN as defined in the problem.\nOutput\n\nFor each test case, output YES or NO denoting the answer of the problem, i.e. if there exists some statistics A which could be rounded to make it B, print YES otherwise NO.\nConstraints\n\n1<=T<=50\n1 <= N <=10000\n0 <=Bi <=1000\nSub tasks\n\nSubtask #1: N ? 100 (50 points)\nSubtask #2: original (50 points)\nExample\n\nInput:\n3\n3\n30 30 30\n4\n25 25 25 25\n2\n50 51\nOutput:\nNO\nYES\nYES\nExplanation\n\nIn test case 1, There can not be any A which could be rounded up to get B. Hence answer is NO.\nIn test case 2, In this case A = {25, 25, 25, 25}. After rounding we get {25, 25, 25, 25} which is equal to B. Hence answer is YES.\nIn test case 3, A = {49.5, 50.5}. After rounding up we get {50, 51} which is equal to B. Hence answer is YES.", "TESTCASE_1": "3\n3\n30 30 30\n4\n25 25 25 25\n2\n50 51\n###---###SEPERATOR---###---\nNO\nYES\nYES", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "4\n3\n30 30 30\n4\n25 25 25 25\n2\n50 51\n3\n30 45 30\n###---###SEPERATOR---###---\nNO\nYES\nYES\nNO", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}