{"Q_ID": "1111210011", "S_NAME": "Input & Ouput", "Q_NAME": "Robert in Bus tempo", "Q_DESC": "One day Robert is waiting for his girlfriend on the bus station. The girlfriend said that she will be at time1. Robert went to the bus station at time2. When Robert has reached the bus station he realised that he forgot a gift for his better half in his home.\n\nRobert knows that someone can reach his home in distance minutes (his girlfriend also needs distance minutes to get Robert home after she arrived at the bus station). So, Robert came up with two plans for present the gift:\n\ni. The first one is to wait for his girlfriend at the bus station. And then go to the home together with her. When Robert and his girlfriend will reach the home he will present his gift.\n\nii. The second one is to call the girlfriend and ask her to go to his home when she will reach the bus station. And after calling he will go to the home, take the gift, and go towards the girlfriend. When they meet each other he will present his gift (they can meet at any position of the road or at the bus station). Its known that girlfriend and Robert uses the same road between bus station and Roberts home.\n\nPlease, help Robert to estimate the time in minutes for each of his plans.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows. \n\nEach test case contains of three lines. The first line contains time1, the second line contains time2, and the third line contains distance\n\nOutput\n\nFor each test case output a single line containing two real numbers - the time for the first plan and the time for the second one. Print real numbers with exactly one decimal digit after the dot.\n\nConstraints\n\n1 < T <10000;\n\n1 <= dist <= 180.\n\nTwo times are given in form HH:MM (usual time from 00:00 to 23:59), and these two times are from the same day. Its guaranteed that Robert will be at bus station strictly earlier that his girlfriend.", "TESTCASE_1": "3\n10:00\n09:00\n10\n10:00\n09:00\n30\n10:00\n09:00\n60\n###---###SEPERATOR---###---\n70.0 60.0\n90.0 60.0\n120.0 90.0", "TESTCASE_2": "2\n11:00\n10:00\n10\n12:00\n11:00\n20\n###---###SEPERATOR---###---\n70.0 60.0\n80.0 60.0", "TESTCASE_3": "5\n1:00\n3:00\n3\n01:00\n03:00\n5\n12:00\n5:00\n3\n11:00\n1:00\n3\n11:00\n12:00\n6\n###---###SEPERATOR---###---\n\n-117.0 -57.0\n-115.0 -55.0\n423.0 420.0\n603.0 600.0\n-54.0 -24.0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}