{"Q_ID": "1111310032", "S_NAME": "Input  Ouput", "Q_NAME": "Exam Copy", "Q_DESC": "N students were giving an examination. The students were sitting in a line from 1 to N in order. The ith student had knowledge ki in the subject on which the exam was being conducted. Every student is not confident about his own preparation, so each student wants to find some students (possibly zero), from whom they can copy the answers. Student i can copy from student j only if kj  ki.There are M teachers who are the exam checkers - jth checker will check the answer-sheets of some continuosly sitting students from the index Li to Ri inclusive. All the students got this information before hand, so they decided that they wont copy the solutions from a person whose answer-sheet is being checked by the same checker as that of himself. Also, each student can see only up to distance D, so a student at index i, can copy solutions of students in the range i - D to i + D, both inclusive. From all the candidate students from which a student can copy, the student will copy from the most knowledgeable students.\n\nFor each student, print the knowledge of the student(s) from whom he can copy, as well as the number of such students.\nIf a certain student can not copy, print -1.\n\nInput\n\nFirst line contains 2 space-separated positive integers - N and M - the total number of students and the number of exam checkers respectively.\n\nSecond line contains N space-separated integers, where the ith integer represents the knowledge of the ith student.\n\nM lines follow - each line contains 2 space-separated integers - Lj and Rj, representing the continuous range of indexes whose answer sheet will be checked by the jth checker.\n\nThe (M + 3)th line contains a single integer D - the distance upto which each student can see for copying answers.\n\n\n\nOutput\n\nPrint N lines, where ith line represents the answer for ith student.\n\nOn each line, print the knowledge of the student(s) from whom the ith student can copy as per the rule mentioned in the statement, and the number of such students, separated by a space.\n\nIf the student can not copy from any student, print -1 (without the quotes).\n\n\nConstraints\n\n1  N  10^5\n\n1  M  N \n\n1  ki  10^8\n\n1  Lj  Rj  N\n\n1  D  N\n\n\n\n\n\n\nSubtasks\n\nSubtask 1: 20 points\n\nN  100\n\n\n\nSubtask 2: 20 points\n\nN  1000 \n\n\n\nSubtask 3: 60 points\n\nNo additional constraint\n", "TESTCASE_1": "10 5\n1 2 1 2 1 2 2 1 2 3\n1 2\n3 4\n5 6\n7 8\n9 10\n2\n###---###SEPERATOR---###---\n-1\n-1\n2 1\n-1\n2 2\n-1\n-1\n3 1\n-1\n-1", "TESTCASE_2": "10 5\n1 3 1 2 1 2 2 1 2 3\n1 2\n3 4\n5 6\n7 8\n9 10\n2\n###---###SEPERATOR---###---\n-1\n-1\n3 1\n3 1\n2 2\n-1\n-1\n3 1\n-1\n-1", "TESTCASE_3": "10 5\n1 2 1 2 1 2 5 1 2 3\n1 2\n3 4\n5 6\n7 8\n9 10\n2\n###---###SEPERATOR---###---\n-1\n-1\n2 1\n-1\n5 1\n5 1\n-1\n3 1\n5 1\n-1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}