{"Q_ID": "1112210014", "S_NAME": "Data types", "Q_NAME": "Brother Party", "Q_DESC": "Its been one year since David met his brother. Last year, his younger brother came to visit him during this time of the year. This year, the David is planning to go visit his brother. David brother has planned to throw a Welcome Party for him. He wants to invite people from his neighbourhood (i.e. from the street where he lives). There are N houses on the street in a single line (not considering the brothers house). He wants the party to be fun and he will not like to invite people who might spoil the mood of the party. If people are invited from three conscutive houses on the street, they might create trouble. As they say, threes a crowd! He doesnt want to ruin the David Welcome Party and so he will not want to send invites to any three consecutive houses. He wants you to tell him how many ways are there for him to go wrong. Note that he can play safe by not inviting anyone to avoid a crowd.\n\nInput:\n\nFirst line of the input contains a single integer T, the number of test cases.\n\nEach test case contains a line containing a single integer N described above.\n\nOutput:\n\nFor each test case output a single integer denoting the number of ways the brother can go wrong with planning the party.\n\nThe answer can get quite large. So output the total number of ways modulo 10^9+7.\n\nConstraints:\n\n1=T=10000\n\n1=N=10^15\n\nExplanation:\n\nCase 1: The only way he can go wrong is by inviting all the houses.\nCase 2: First way of getting wrong is by inviting houses (1,2,3). Second way to get wrong is by inviting houses (2,3,4). Third way of going wrong is by inviting all 4 houses i.e. (1,2,3,4).", "TESTCASE_1": "2\n3\n4\n###---###SEPERATOR---###---\n1\n3", "TESTCASE_2": "2\n7\n8\n###---###SEPERATOR---###---\n47\n107", "TESTCASE_3": "10\n9999\n999999\n9999999\n99999999\n999999999\n9999999999\n99999999999\n999999999999\n9999999999999\n00000000000000\n###---###SEPERATOR---###---\n826674912\n870940995\n776978462\n857673588\n117764910\n856877667\n86571761\n437264093\n250865388\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}