{"Q_ID": "1112310031", "S_NAME": "Data types", "Q_NAME": "Who dares to be a millionaire?", "Q_DESC": "helen is going to participate in a new quiz show: \"Who dares to be a millionaire?\"\n\nAccording to the rules of the game, contestants must answer N questions. The quiz being famous for its difficulty, each question has 26 candidate answers, but only one of which is correct. Answers are denoted by capital Latin letters from A to Z. helen knows all the questions that can be asked, and for each of them she knows the answer candidate she will choose (some of them can be incorrect). For each question, well tell you helens answer to it.\nThe game goes on as follows. First, all the questions are shuffled randomly. Then, a contestant is asked these questions one-by-one in the new shuffled order. If the contestant answers any question incorrectly, the game is over. Total winnings of the contestant are calculated as follows. Let X denote the number of questions answered correctly by the contestant. Depending on this value, the winnings are determined: W0 dollars is the amount won for X = 0, W1 dollars is for X = 1, and so on till X = N. Note that the game was invented by a twisted mind, and so a case where Wi  Wi + 1 for some 0  i  N  1 is possible.\n\nhelen is interested in finding the maximum possible winnings that she can amass.\nInput\n\nThe first line of input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each test case contains a single integer N denoting the number of questions.\n\nNext line contains N capital Latin letters denoting the correct answers to these questions.\n\nNext line contains N capital Latin letters denoting answers given by Chef to these questions.\n\nNext line contains N + 1 space-separated integers W0, W1, ..., WN denoting the winnings for 0, 1, ..., N correct answers.\nOutput\n\nFor each test case, output a single line containing the value of maximum possible winnings that helen can get.\n                                 Constraints\n\n    1  T  500\n    1  N  1000\n    0  Wi  109", "TESTCASE_1": "1\n5\nABCDE\nEBCDA\n0 10 20 30 40 50\n###---###SEPERATOR---###---\n30", "TESTCASE_2": "3\n6\nCDESAB\nADECBS\n0 10 20 30 40 50 100\n3\nCDS\nCDA\n0 100 200 300\n4\nABDC\nABCD\n0 10 20 30 50\n###---###SEPERATOR---###---\n20\n200\n20", "TESTCASE_3": "3\n5\nABCDE\nEBCDA\n0 10 20 30 40 50\n4\nCHEF\nQUIZ\n4 3 2 1 0\n8\nABBABAAB\nABABABAB\n100 100 100 100 100 100 100 100 100\n###---###SEPERATOR---###---\n30\n4\n100", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}