{"Q_ID": "1112210005", "S_NAME": "Data types", "Q_NAME": "Robbery", "Q_DESC": "Two thieves (Ronald being one of them, the more talented one of course) have came across each other in the underground vault of the State Bank of Bhuru land. They are shocked! Indeed, neither expect to meet a colleague in such a place with the same intentions to carry away all the money collected during Bhuru fest 2015.\n\nThey have carefully counted a total of exactly 1 billion (109) dollars in the bank vault. Now they must decide how to divide the booty. But there is one problem: the thieves have only M minutes to leave the bank before the police arrives. Also, the more time they spend in the vault, the less amount could carry away from the bank. Formally speaking, they can get away with all of the billion dollars right now, but after t minutes they can carry away only 1 billion * pt dollars, where p is some non-negative constant less than or equal to unity, and at t = M, they get arrested and lose all the money.\n\nThey will not leave the vault until a decision on how to divide the money has been made.\n\n\nThe money division process proceeds in the following way: at the beginning of each minute starting from the 1st (that is, t = 0), one of them proposes his own way to divide the booty. If his colleague agrees, they leave the bank with pockets filled with the proposed amounts of dollars. If not, the other one proposes his way at the next minute etc. To escape arrest, they can only propose plans till the beginning of the Mth minute (i.e., till t = M-1).\n\nEach thief wants to maximize his earnings, but if there are two plans with the same amounts for him, he would choose the one which leads to a larger total amount of stolen dollars.\n\n\nRonald is about to start this procedure, and he is the first to propose a plan. You are wondering what will be the final division of money, if each thief chooses the optimal way for himself and money is considering real.\n\n\nInput\n\n\nThe first line of input contains an integer T denoting the number of test cases. The description of T test cases follows. The only line of input for each test case contains an integer M denoting the number of minutes until arrest and a double denoting the constant p.\n\n\nOutput\n\n\nFor each test case, output a single line containing two space-separated doubles denoting the amount of dollars each thief will get in the optimal division. First number: dollars amassed by Ronald, and second: by his colleague. The answer will be considered correct if its absolute error doesnt exceed 10-2.\n\n\nConstraints and subtasks\n\n\n1=T=105\n\n0=p=1\n\nSubtask 1 :\n\n1=M=3\n\n\nSubtask 2  :\n\n1=M=103\n\n\nSubtask 3  :\n\n1= M=109\n\nExplanation\n\n\nExample case 1. In the second case, if decision is not made at t = 0, total amount of money decreases to 5*108 at t = 1 which leads to a situation worse than the given solution.\n\n", "TESTCASE_1": "2\n1 0.5\n2 0.5\n###---###SEPERATOR---###---\n1000000000.000000 0.000000\n500000000.000000 500000000.000000", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "3\n1 0.5\n2 0.5\n3 0.5\n###---###SEPERATOR---###---\n1000000000.000000 0.000000\n500000000.000000 500000000.000000\n750000000.000000 250000000.000000", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}