{"Q_ID": "1112210015", "S_NAME": "Data types", "Q_NAME": "Cat Town restaurant", "Q_DESC": "In Cat town there are 2 big markets S and T. The distance between these markets is D. Robby would like to run 2 restaurants in Cat town, where the first restaurant will be supplied by the market S and the second one will be supplied by the market T. The markets run delivery service without charge within some distance,DS and DT respectively. Near these markets there are many rival restaurants. So Ciel decides to build one of her restaurants exactly at the distance DS from the market S, and build the other restaurant exactly at the distance DT from the market T.\n\nRobby would like to build her restaurants as close as possible to each other for convenient communication. Your task is to calculate the minimum distance that could be achieved between her restaurants.\n\nNote. Cat town can be considered as an infinite 2D Cartesian plane. The markets and Ciel s restaurants should be considered as points on a plane. The distance between the two points A and B, whose coordinates are (Ax, Ay) and (Bx, By) respectively, is defined by Dist(A, B) = ((Ax =Bx)2 + (Ay = By)2)1/2.\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows. The only line of each test case contains three space-separated integers DS, DT and D.\nOutput\n\nFor each test case, output a single line containing the minimum possible distance between Ciels restaurants that could be achieved. The output must have an absolute or relative error at most 0.000001 (10^6). Please, note that your output should not have more than 1000 digits after the decimal point, otherwise you may (or may not) get wrong answer or runtime error (SIGXFSZ).\n\nNote also that the answer could be 0, which means that two Ciels restaurants should be located at the same building.", "TESTCASE_1": "4\n15 15 50\n15 15 18\n43 88 200\n2013 2013 2013\n###---###SEPERATOR---###---\n20.000000\n0.0\n69.000000\n0.0", "TESTCASE_2": "3\n1 3 -1\n23 33 -2\n233 111 -3\n###---###SEPERATOR---###---\n3.000000\n12.000000\n125.000000", "TESTCASE_3": "10\n1 3 5\n12 38 30\n9999 999 999\n1000 1990 1991\n19 29 2\n3 9 1 \n1 3 9\n100 100 100\n100 1000 1000\n10 101 01\n###---###SEPERATOR---###---\n1.000000\n0.0\n8001.000000\n0.0\n8.000000\n5.000000\n5.000000\n0.0\n0.0\n90.000000", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}