{"Q_ID": "1113310041", "S_NAME": "Operators", "Q_NAME": "Binary Tournament", "Q_DESC": "Knights tournaments were quite popular in the Middle Ages. A lot of boys were dreaming of becoming a knight, while a lot of girls were dreaming of marrying a knight on a white horse.\n\nIn this problem we consider one of these tournaments.\n\nLets us call a tournament binary, if it runs according to the scheme described below:\n\n    Exactly N knights take part in the tournament, N=2K for some integer K  0.\n    Each knight has a unique skill called strength, described as an integer from the interval [1, N].\n    Initially, all the knights are standing in a line, waiting for a battle. Since all their strengths are unique, each initial configuration can be described as a permutation of numbers from 1 to N.\n    There are exactly K rounds in the tournament, 2K - i + 1 knights take part in the ith round. The Kth round is called the final.\n    The ith round runs in the following way: for each positive integer j  2K - i happens a battle between a knight on the 2jth position and a knight on the 2j+1th position. The strongest of two continues his tournament, taking the jth position on the next round, while the weakest of two is forced to leave.\n    The only knight, who has won K rounds, is the winner. The only knight, who has won K - 1 rounds, but lost the final, is the runner-up. \n\nAs you can see from the scheme, the winner is always the same, an initial configuration doesnt change anything. So, your task is to determine chances of each knight to appear in the final.\n\nFormally, for each knight you need to count the number of initial configurations, which will lead him to the final. Since the number can be extremly huge, you are asked to do all the calculations under modulo 109 + 9.\nInput\n\nThe first line contains the only integer K, denoting the number of rounds of the tournament.\n\n \nOutput\n\nOutput should consist of 2K lines. The ith line should contain the number of initial configurations, which lead the participant with strength equals to i to the final.\n\n \nConstraints\n\n1  K  20", "TESTCASE_1": "1\n###---###SEPERATOR---###---\n2\n2", "TESTCASE_2": "2\n###---###SEPERATOR---###---\n0\n8\n16\n24", "TESTCASE_3": "3\n###---###SEPERATOR---###---\n0\n0\n0\n1152\n4608\n11520\n23040\n40320", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}