{"Q_ID": "1113210003", "S_NAME": "Operators", "Q_NAME": "Raj and his number", "Q_DESC": "While studying representation of numbers in various bases, Raj discovered an interesting properties of some positive numbers, which Raj believed are somewhat easy to memorise. Raj called such positive numbers easy numbers.\n \nThese numbers had an interesting property: Let the base Raj is currently studying be b. Represent the number in base b (without leading zeros). For each prefix of length k (from 1 to number of digits in number in the base), the number formed by considering the digits of the prefix in base b is divisible by k.\n \nFor example, let base Raj is studying be 2.\n \n1 is an easy number as its prefix of length 1 (i.e. 1) is divisible by 1.\n2 is also an easy number, as its prefix of length 1 (i.e. 1) is divisible by 1 and the prefix of length 2 (i.e. 2, represented as 10 in base 2) is also divisible by 2.\n3 is not an easy number, as its prefix of length 2 (i.e. 3, represented as 11 in base 2) is not divisible by 2.\nNow Raj finds these numbers easy and thinks that following question related to easy numbers will be easy for you too. He asks you to find the number of easy numbers represented in base b and consisting of exactly d digits. As the answer could be quite large, output it modulo 109 + 7.\n \nInput\n \nFirst line of the input contains a single integer T denoting the number of test cases.\n \nFor each test case, there will be a single line containing two space separated integers b, d, denoting the base and number of digits respectively.\n \nOutput\n \nFor each test case, output a single integer denoting the number of easy numbers in base b consisting of d digits, modulo 10^9 + 7.\n \nConstraints\n \n1 = T = 100\n2 = b = 16\n1 = d= 10^9\n", "TESTCASE_1": "2\n2 2\n10 3\n###---###SEPERATOR---###---\n1\n150", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "5\n1 2\n1 2\n1 1\n11 11\n1 1\n###---###SEPERATOR---###---\n0\n0\n0\n6709\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}