{"Q_ID": "1113210214", "S_NAME": "Operators", "Q_NAME": "FRUITS COUNT", "Q_DESC": "Sam's house has an apple tree and an orange tree that yield an abundance of fruit. In the diagram below, the red region denotes his house, where s is the start point and t is the end point. The apple tree is to the left of his house, and the orange tree is to its right. You can assume the trees are located on a single point a, where the apple tree is at point and the orange tree is at point b.\nWhen a fruit falls from its tree, it lands d units of distance from its tree of origin along the x -axis. A negative value of d means the fruit fell d units to the tree's left, and a positive value of d means it falls d units to the tree's right. \nGiven the value of d for m apples and n oranges, can you determine how many apples and oranges will fall on Sam's house (i.e., in the inclusive range [s, t])? Print the number of apples that fall on Sam's house as your first line of output, and then print the number of oranges that fall on Sam's house as your second line of output.\nInput Format\nThe first line contains two space-separated integers denoting the respective values of s and t. \nThe second line contains two space-separated integers denoting the respective values of a and b. \nThe third line contains two space-separated integers denoting the respective values of m and n. \nThe fourth line contains m space-separated integers denoting the respective distances that each apple falls from point a. \nThe fifth line contains n space-separated integers denoting the respective distances that each orange falls from point b.\nConstraints\n 1  s,t,a,b,m,n  105 \n -105  d  105\n a  s  t  b\nOutput Format\nPrint two lines of output:\n1. On the first line, print the number of apples that fall on Sam's house.\n2. On the second line, print the number of oranges that fall on Sam's house.\n", "TESTCASE_1": "7 11\n5 15\n3 2\n-2 2 1\n5 -6\n###---###SEPERATOR---###---\n1\n1", "TESTCASE_2": "2 3\n1 5\n1 1\n-2\n-1\n###---###SEPERATOR---###---\n0\n0", "TESTCASE_3": "2 3\n1 5\n1 1\n2\n-2\n###---###SEPERATOR---###---\n1\n1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}