{"Q_ID": "1113310206", "S_NAME": "Operators", "Q_NAME": "Chef and Piano Scales", "Q_DESC": "Recently, Chef got obsessed with piano. He is a just a rookie in this stuff and can not move his fingers from one key to other fast enough. He discovered that the best way to train finger speed is to play scales.\n\nThere are different kinds of scales which are divided on the basis of their interval patterns. For instance, major scale is defined by pattern T-T-S-T-T-T-S, where T stands for a whole tone whereas S stands for a semitone. Two semitones make one tone. To understand how they are being played, please refer to the below image of pianos octave  two consecutive keys differ by one semitone.\n\nIf we start playing from first key (note C), then well play all white keys in a row (notes C-D-E-F-G-A-B-C  as you can see C and D differ for a tone as in pattern, and E and F differ for a semitone).\n\nThis pattern could be played some number of times (in cycle).Each time Chef takes some type of a scale and plays using some number of octaves. Sometimes Chef can make up some scales, so please dont blame him if you find some scale that does not exist in real world.\n\nFormally, you have a set of 12 keys (i.e. one octave) and you have N such sets in a row. So in total, you have 12*N keys. You also have a pattern that consists of letters 'T' and 'S', where 'T' means move forward for two keys (from key x to key x + 2, and 'S' means move forward for one key (from key x to key x + 1).\n\nNow, you can start playing from any of the 12*N keys. In one play, you can repeat the pattern as many times as you want, but you cannot go outside the keyboard.\n\nRepeating pattern means that if, for example, you have pattern STTST, you can play STTST as well as STTSTSTTST, as well as STTSTSTTSTSTTST, as well as any number of repeating. For this pattern, if you choose to repeat it once, if you start at some key x, you'll press keys: x (letter 'S')- x + 1 (letter 'T')- x + 3 (letter 'T')- x + 5 (letter 'S') - x + 6 (letter 'T')- x + 8. Also 1  x, x + 8  12*N so as to avoid going off the keyboard.\n\nYou are asked to calculate number of different plays that can be performed. Two plays differ if and only if they start at different keys or patterns are repeated different number of times. ", "TESTCASE_1": "2\nTSTS\n1\nTTSTTST\n1\n###---###SEPERATOR---###---\n6\n0", "TESTCASE_2": "2\nTTSS\n2\nTTTTS\n4\n###---###SEPERATOR---###---\n36\n105", "TESTCASE_3": "2 \nTTTT\n1\nTTSTTTS\n3\n###---###SEPERATOR---###---\n4\n36", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}