{"Q_ID": "1113210019", "S_NAME": "Operators", "Q_NAME": "Vote for the Noodle Soup", "Q_DESC": "Did you ever hear about crossing the bridge noodle?. Let me tell you that it is not some kind of bridge made of noodles. It is a dish, a kind of rice noodle soup. Mr.Ping makes the best noodle soup and his son Po is eagerly waiting for the user reviews in his fathers blog. Users can vote with a (+) or a (-) and accordingly +1 or -1 is added to the total score respectively. Note that if a user votes multiple times, only his/her latest vote is counted towards the total score.\n\nPo opens the blog to see initial score of 0. To see the updated score without refreshing the page, he has to keep voting himself. After each of Po clicks on (+) or (-), he can see the current total score, of course that considers Po vote too. He is wondering how many users other than him could have possibly voted. Given the sequence of clicks made by Po and the total score displayed just after each of his clicks, can you tell him the minimum number of users that could have possibly voted at least once, other than Po.\n\nInput\n\nThere are multiple test cases ( at most 21 ). Each case starts with an integer N ( 1= N=1000 ), the number of Pos clicks. Sequence of N clicks follows, one on each line of the form vote score (without quotes, separated by a space), where vote is either a P or a M, representing Plus(+) and Minus(-) respectively, the one clicked by Po and score is the score displayed after Po click ( -1,000,000,000 = score = 1,000,000,000 ). The last case has N = 0 and should not be processed. Each case is followed by an empty line.\n\nOutput\n\nFor each test case, output the minimum number of users that could have possibly voted at least once.\n\nExplanation:\n\nCase 1 :\nP 1 , Po voted (+) and score = 1 is possibly Pos vote itself.\nP 2 , Po again voted (+), but as only latest vote of a user is counted, Po contributed only +1 to the score, so possibly one more user voted with a (+). Remember that we have to find the number of users other than Po, so answer is 1\n\nCase 2 :\nP 2 , Po voted (+) and score = 2, possibly another user A also voted (+)\nM -2 , Po voted (-) and score = -2. Possibly the same user A also voted (-)\nSo there can possibly be just one other user A\n", "TESTCASE_1": "2\nP 1\nP 2\n2\nP 2\nM -2\n0\n###---###SEPERATOR---###---\n1\n1", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "2\nP 6\nP 7\n2\nP 5\nM -2\n###---###SEPERATOR---###---\n6\n5", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}