{"Q_ID": "1113210015", "S_NAME": "Operators", "Q_NAME": "Splitting Candies", "Q_DESC": "Cyael is a teacher at a very famous school in Byteland and she is known by her students for being very polite to them and also to encourage them to get good marks on their tests.\n\nThen, if they get good marks she will reward them with candies :) However, she knows they are all very good at Mathematics, so she decided to split the candies evenly to all the students she considers worth of receiving them, so they dont fight with each other.\n\nShe has a bag which initially contains N candies and she intends to split the candies evenly to K students. To do this she will proceed as follows: while she has more than K candies she will give exactly 1 candy to each student until she has less than K candies. On this situation, as she cant split candies equally among all students she will keep the remaining candies to herself.\n\nYour job is to tell how many candies will each student and the teacher\nreceive after the splitting is performed.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nEach test case will consist of 2 space separated integers, N and K denoting the number of candies and the number of students as described above.\n\nOutput\n\nFor each test case, output a single line containing two space separated integers, the first one being the number of candies each student will get, followed by the number of candies the teacher will get.\n\nConstraints\n\nT<=100 in each test file\n0 <= N,K <= 233 - 1     Explanation\n\nFor the first test case, all students can get an equal number of candies and teacher receives no candies at all\n\nFor the second test case, teacher can give 33 candies to each student and keep 1 candy to herself\n\nUpdate:\n\nThere may be multiple whitespaces before, after or between the numbers in input.", "TESTCASE_1": "2\n10 2\n100 3\n###---###SEPERATOR---###---\n5 0\n33 1", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "5\n100 100\n100 40\n60 40\n10 3\n500 650\n###---###SEPERATOR---###---\n1 0\n2 20\n1 20\n3 1\n0 500\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}