{"Q_ID": "1113110209", "S_NAME": "Operators", "Q_NAME": "Chef and A Large Permutation", "Q_DESC": "Tomorrow Peter has a Biology exam. He does not like this subject much, but d days ago he learnt that he would have to take this exam. Peter's strict parents made him prepare for the exam immediately, for this purpose he has to study not less than minTimei and not more than maxTimei hours per each i-th day. Moreover, they warned Peter that a day before the exam they would check how he has followed their instructions.\n\nSo, today is the day when Peter's parents ask him to show the timetable of his preparatory studies. But the boy has counted only the sum of hours sumTime spent him on preparation, and now he wants to know if he can show his parents a timetable shedule with d numbers, where each number shedulei stands for the time in hours spent by Peter each i-th day on biology studies, and satisfying the limitations imposed by his parents, and at the same time the sum total of all schedulei should equal to sumTime.\n\nInput\nThe first input line contains two integer numbers d,sumTime (1<=d<=30,0<=sumTime<=240)  the amount of days, during which Peter studied, and the total amount of hours, spent on preparation. Each of the following d lines contains two integer numbers minTime i,maxTime i (0<=minTime i<=maxTime i<=8), separated by a space  minimum and maximum amount of hours that Peter could spent in the i-th day.\n\nOutput\nIn the first line print YES, and in the second line print d numbers (separated by a space), each of the numbers  amount of hours, spent by Peter on preparation in the corresponding day, if he followed his parents' instructions; or print NO in the unique line. If there are many solutions, print any of them.", "TESTCASE_1": "1 48\n5 7\n###---###SEPERATOR---###---\nNO", "TESTCASE_2": "1 4\n2 4\n###---###SEPERATOR---###---\nYES\n4", "TESTCASE_3": "2 5\n4 6\n###---###SEPERATOR---###---\nNO", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}