{"Q_ID": "1113310203", "S_NAME": "Operators", "Q_NAME": "A STUDENT'S DREAM", "Q_DESC": "\"Statistics claims that students sleep no more than three hours a day. But even in the world of their dreams, while they are snoring peacefully, the sense of impending doom is still upon them.\nA poor student is dreaming that he is sitting the mathematical analysis exam. And he is examined by the most formidable professor of all times, a three times Soviet Union Hero, a Noble Prize laureate in student expulsion, venerable Petr Palych.\nThe poor student couldn't answer a single question. Thus, instead of a large spacious office he is going to apply for a job to thorium mines. But wait a minute! Petr Palych decided to give the student the last chance! Yes, that is possible only in dreams. \nSo the professor began: \"\"Once a Venusian girl and a Marsian boy met on the Earth and decided to take a walk holding hands. But the problem is the girl has al fingers on her left hand and ar fingers on the right one. The boy correspondingly has bl and br fingers. They can only feel comfortable when holding hands, when no pair of the girl's fingers will touch each other. That is, they are comfortable when between any two girl's fingers there is a boy's finger. And in addition, no three fingers of the boy should touch each other. Determine if they can hold hands so that the both were comfortable.\"\"\nThe boy any the girl don't care who goes to the left and who goes to the right. The difference is only that if the boy goes to the left of the girl, he will take her left hand with his right one, and if he goes to the right of the girl, then it is vice versa.\nInput\nThe first line contains two positive integers not exceeding 100. They are the number of fingers on the Venusian girl's left and right hand correspondingly. The second line contains two integers not exceeding 100. They are the number of fingers on the Marsian boy's left and right hands correspondingly.\nOutput\nPrint YES or NO, that is, the answer to Petr Palych's question.\nNote\nThe boy and the girl don't really care who goes to the left.\n\"", "TESTCASE_1": "1 1\n1 1\n\n###---###SEPERATOR---###---\nYES", "TESTCASE_2": "1 2\n11 6\n\n###---###SEPERATOR---###---\nNO", "TESTCASE_3": "4 5\n3 3\n\n###---###SEPERATOR---###---\nYES", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}