{"Q_ID": "1113310035", "S_NAME": "Operators", "Q_NAME": "Inversion", "Q_DESC": "Here are n+1 (0 < n <= 109, inde\"Monks best friend Micro, who happen to be an awesome programmer, got him an integer matrix M of size NN for his birthday. Monk is taking coding classes from Micro. They have just completed array inversions and Monk was successful in writing a program to count the number of inversions in an array. Now, Micro has asked Monk to find out the number of inversion in the matrix M. Number of inversions, in a matrix is defined as the number of unordered pairs of cells {(i,j),(p,q)} such that M[i][j]>M[p][q] & ip & jq\n\n.\nMonk is facing a little trouble with this task and since you did not got him any birthday gift, you need to help him with this task.\n\nInput:\nFirst line consists of a single integer T\ndenoting the number of test cases.\nFirst line of each test case consists of one integer denoting N. Following N lines consists of N space separated integers denoting the matrix M\n\n.\n\nOutput:\nPrint the answer to each test case in a new line.\n\nConstraints:\n1T100\n\n1N20\n1M[i][j]1000\"\nxed 0..n) houses lying on a straight street. One day, they are bombed by an enemy. CodeChef is designing defence systems to protect the street from bombing. Each defense system can protect all houses in some interval, and a house can be protected by more than one system. A defence system can be also moved at any time. By agents, CodeChef knows the bombing schedule of the enemy. Each time they bomb a house and CodeChef wants to know how many systems are protecting that house.\nInput\n\n    The first line contains two integers n, m (0 < m <= 250 000).\n    Each of the m following lines follows one of these:\n        P u v: CodeChef adds a defence system protecting all houses from the u-th house to the v-th house (0 <= u <= v <= n). All systems will be indexed by order of appearance in the input, starting from 1.\n        M i d: CodeChef moves the i-th system by d houses, d < 0 means moving nearer the 0-th house, and d > 0 means moving away (that is, if the i-th system covers houses u through v, it is moved to instead cover houses w=u+d through t=v+d). After being moved the system will protect from the w-th house to t-th house where 0 <= w <= t <= n.\n        B x: The enemy bombs the x-th house.\n\nOutput\n\nFor each time of bombing by the enemy (by the appearance in the input), output on a single line a number of systems protecting that house.\"\n", "TESTCASE_1": "2\n3\n1 2 3\n4 5 6\n7 8 9\n2\n4 3\n1 4\n###---###SEPERATOR---###---\n0\n2", "TESTCASE_2": "2\n3\n1 2 5\n11 5 6\n7 8 9\n2\n1 2\n3 4\n###---###SEPERATOR---###---\n5\n0", "TESTCASE_3": "1\n0 0\n0 0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}