{"Q_ID": "1113210203", "S_NAME": "Operators", "Q_NAME": "T-SHIRTS DISTRIBUTION", "Q_DESC": "The organizers of a programming contest have decided to present t-shirts to participants. There are six different t-shirts sizes in this problem: S, M, L, XL, XXL, XXXL (sizes are listed in increasing order). The t-shirts are already prepared. For each size from S to XXXL you are given the number of t-shirts of this size.\nDuring the registration, the organizers asked each of the n participants about the t-shirt size he wants. If a participant hesitated between two sizes, he could specify two neighboring sizes  this means that any of these two sizes suits him.\nWrite a program that will determine whether it is possible to present a t-shirt to each participant of the competition, or not. Of course, each participant should get a t-shirt of proper size: \n the size he wanted, if he specified one size; \n any of the two neibouring sizes, if he specified two sizes. \nIf it is possible, the program should find any valid distribution of the t-shirts.\nInput\nThe first line of the input contains six non-negative integers  the number of t-shirts of each size. The numbers are given for the sizes S, M, L, XL, XXL, XXXL, respectively. The total number of t-shirts doesn't exceed 100000.\nThe second line contains positive integer n (1n100000)  the number of participants.\nThe following n lines contain the sizes specified by the participants, one line per participant. The i-th line contains information provided by the i-th participant: single size or two sizes separated by comma (without any spaces). If there are two sizes, the sizes are written in increasing order. It is guaranteed that two sizes separated by comma are neighboring.\nOutput\nIf it is not possible to present a t-shirt to each participant, print NO (without quotes).\nOtherwise, print n+1 lines. In the first line print YES (without quotes). In the following n lines print the t-shirt sizes the orginizers should give to participants, one per line. The order of the participants should be the same as in the input.\nIf there are multiple solutions, print any of them.", "TESTCASE_1": "0 1 0 1 1 0\n3\nXL\nS,M\nXL,XXL\n\n###---###SEPERATOR---###---\nYES\nXL\nM\nXXL\n", "TESTCASE_2": "1 1 2 0 1 1\n5\nS\nM\nS,M\nXXL,XXXL\nXL,XXL\n\n###---###SEPERATOR---###---\nNO", "TESTCASE_3": "1 2 4 4 1 1\n10\nXL\nXL\nS,M\nL\nM,L\nL\nS,M\nM\nXL,XXL\nXL\n\n###---###SEPERATOR---###---\nYES\nXL\nXL\nM\nL\nL\nL\nS\nM\nXL\nXL\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}