{"Q_ID": "1114210210", "S_NAME": "Control and Looping", "Q_NAME": "Rectangles of Love", "Q_DESC": "Today is the planned day tor Thik and Ayvak's wedding. Kark is infatuated with Ayvak. He offers to play a game with Thik. Whosoever wins, will get to marry Ayvak. Ayvak, who values games of chance over all the other things in life, agrees to this. \nKark sets up an N by M grid (N rows, M columns), labelled from left to right and top to bottom consecutively with numbers from 1 to M*N, with 1 at the top left corner and M*N at the bottom right corner. For example, a labelled 3 by 6 grid looks as follows:\n \nKark has already painted K unit squares of the grid with a heart each. Next, Thik randomly picks a rectangle with sides on the grid lines, and having a positive area, with each valid rectangle having an equal probability of being chosen. Three distinct possibilities for Thik's rectangle in the 3 by 6 grid are shown below: \n \nThe nine different rectangles in a 2 by 2 grid are shown below: \n \nIf Thik's rectangle contains at least half of the hearts, Thik gets to marry Ayvak. Otherwise, Kark will marry Ayvak. Kark wants to know whether or not he has an advantage here, so he wants to know the expected value of the number of hearts a randomly chosen rectangle will cover. I'm sure that you have a good heart, so please, cover this job for him. \nInput\nThe first line of input contains one integer T, the number of test cases.\nFor each test case, the first line contains 3 space-separated integers N, M, K, as described in the problem statement. The next line contains K space-separated integers, each a single number from 1 to M*N, representing a square that is painted with a heart. It is guaranteed that all K integers are distinct.\nOutput\nOutput T lines, each containing a single real number, containing the expected number of hearts that a randomly chosen rectangle will contain. The answer will be considered correct if its relative or absolute error does not exceed 10-6. \n\n", "TESTCASE_1": "1\n2 2 2\n1 2\n\n###---###SEPERATOR---###---\n0.888889\n", "TESTCASE_2": "2\n3 3 3\n2 3\n\n###---###SEPERATOR---###---\n0.833333\n0.750000\n", "TESTCASE_3": "3\n5 5 5 \n2 3\n\n###---###SEPERATOR---###---\n0.977778\n1.000000\n1.000000\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}