{"Q_ID": "1114310212", "S_NAME": "Control and Looping", "Q_NAME": "Digits Cannot Separate", "Q_DESC": "Mr. Wilson was planning to record his new Progressive Rock music album called Digits. Cannot. Separate. Xenny and PowerShell, popular pseudo-number-theoreticists from the Land of Lazarus were called by him to devise a strategy to ensure the success of this new album. Xenny and Powershell took their Piano Lessons and arrived at the Studio in different Trains.\nMr. Wilson, creative as usual, had created one single, long music track S. The track consisted of N musical notes. The beauty of each musical note was represented by a decimal digit from 0 to 9.\nMr. Wilson told them that he wanted to create multiple musical tracks out of this long song. Since Xenny and Powershell were more into the number theory part of music, they didnt know much about their real workings. Mr. Wilson told them that a separator could be placed between 2 digits. After placing separators, the digits between 2 separators would be the constituents of this new track and the number formed by joining them together would represent the Quality Value of that track. He also wanted them to make sure that no number formed had greater than M digits.\nMr. Wilson had Y separators with him. He wanted Xenny and PowerShell to use at least X of those separators, otherwise he would have to ask them to Drive Home.\nXenny and PowerShell knew straight away that they had to put place separators in such a way that the Greatest Common Divisor (GCD) of all the Quality Values would eventually determine the success of this new album. Hence, they had to find a strategy to maximize the GCD.\nIf you find the maximum GCD of all Quality Values that can be obtained after placing the separators, Xenny and PowerShell shall present you with a Porcupine Tree.\n\n", "TESTCASE_1": "2\n3\n474\n2 1 1\n34\n6311861109697810998905373107116111\n10 4 25\n\n###---###SEPERATOR---###---\n2\n1\n", "TESTCASE_2": "2\n3\n2 5 5\n34\n5 1 8\n451258505373104521112\n10 4 25\n\n###---###SEPERATOR---###---\n0\n1\n", "TESTCASE_3": "2\n5\n2 5 5\n56\n5 1 8\n6311861109697810998905373107116111\n4 2 6\n23\n\n###---###SEPERATOR---###---\n0\n1\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}