{"Q_ID": "1114310009", "S_NAME": "Control and Looping", "Q_NAME": " Byteknights and Byteknaves", "Q_DESC": "A long school holiday has come, and you decided to visit the famous Byte Island. You know there are only two types of Bytelandians: Byteknights and Byteknaves. A Byteknight always tells the truth, whereas a Byteknave always lies.\nIt is known that there are N Bytelandians in the island, and now you meet all of them. You are curious about their types. Because you are a smart logician, you dont want to ask them questions that immediately reveal their types (thats too boring). Instead, to each Bytelandian you ask, How many Byteknights are there here?\nTo your surprise, they also dont answer your questions directly. Instead, the i-th Bytelandian answers of the form The number of Byteknights here is between ai and bi, inclusive. You record all answers in your pocket note\nNow that you have collected all information you need, determine the type of each Bytelandian.\nInput\nThe first line contains a single integer T, the number of test cases. T test cases follow. The first line of each test case contains a single integer N. N lines follow. The i-th line contains two integers ai and bi.\nOutput\nFor each test case, output two lines. In the first line, output a single integer indicating the number of different solutions, modulo 1000000007. In the next line, output the lexicographically smallest solution. A solution is a string consisting of N characters, where the i-th character of the string is 1 if the i-th Bytelandian is a Byteknight, or 0 in case of a Byteknave. It is guaranteed that there is at least one valid solution.", "TESTCASE_1": "3\n1\n0 1\n4\n1 4\n2 4\n3 4\n4 4\n3\n1 2\n0 0\n1 3\n###---###SEPERATOR---###---\n1\n1\n5\n0000\n1\n101", "TESTCASE_2": "2\n1\n0 1\n4\n1 4\n2 4\n3 4\n4 4\n\n###---###SEPERATOR---###---\n1\n1\n5\n0000", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}