{"Q_ID": "1114310021", "S_NAME": "Control and Looping", "Q_NAME": "TREE BALANCING", "Q_DESC": " You are given a rooted tree of N vertices, the root is at vertex 1. The i-th edge has two parameters associated with it, Ci denoting the cost of the edge and parameter Di.\n\nYou want to make cost of all the paths from the root to any leaf having equal costs. Cost of a path is sum of costs of all the edges on the path. For that, you can increase or decrease cost of any edge. The time taken in changing cost of i-th edge to X will be Di  |X - Ci|.\n\nFind the minimum time required to make cost of all the paths from the root to all leaves equal. Furthmore, you should also output the new edge costs. If there are more than one possible solutions, you can print any of them.\n\nNote that you can change costs of edges to negative, but all costs should be integers.\nInput\n\nFirst line of input contains an integer T denoting number of test cases. T test cases follow.\n\nFirst line of each test case contains an integer N denoting number of vertices in the tree.\n\nEach of the next N - 1 line contains four space separated integers ui, vi, Ci, Di denoting there is an edge between vertex ui and vi with parameters Ci and Di that are described in the statement.\nOutput\n\nFor each test case, output N lines.\n\nFirst line should contain an integer corresponding to minimum time required.\n\nIn next N - 1 lines, i-th line should contain the updated cost of i-th edge.\nConstraints\n\n    1 = T, N = 200000\n    Denote the sum of N in all T test-cases with S\n    S= 200000\n    1 =ui, vi =N\n    1 =Ci, Di = 106\n\nSubtasks\n\n    Subtask #1 (10 points) S = 200, all nodes except node 1 are direct children of node 1\n    Subtask #2 (20 points) S= 200\n    Subtask #3 (20 points) Di = 1 for all i\n    Subtask #4 (50 points) original constraints\n", "TESTCASE_1": "1\n5\n1 2 5 4\n1 3 15 15\n2 4 3 2\n2 5 5 1\n###---###SEPERATOR---###---\n74\n15\n15\n15\n15\n", "TESTCASE_2": "1\n4\n1 2 5 4\n1 3 15 15\n2 4 3 2\n2 5 5 1\n###---###SEPERATOR---###---\n64\n15\n15\n15", "TESTCASE_3": "1\n3\n1 2 5 4\n1 3 15 15\n2 4 3 2\n2 5 5 1\n###---###SEPERATOR---###---\n40\n15\n15\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}