{"Q_ID": "1114210211", "S_NAME": "Control and Looping", "Q_NAME": "Player", "Q_DESC": "Petr, Nikita G. and Nikita are the most influential music critics in Saint-Petersburg. They have recently downloaded their favorite band's new album and going to listen to it. Nikita claims that the songs of entire album should be listened strictly in the same order as they are given, because there is the secret message from the author in the songs' order. Petr, being chaotic, does not think so, hence he loves listening to songs in a random order. Petr is pretty good in convincing other people, so after a two-hours discussion Nikita accepted listening in random order(the discussion's duration was like three times longer thatn the album's one). In this context random order means following: There are N songs in the album. In the very beginning random song is chosen(here and further random song means that every song has equal probability to be chosen). After some song is over the next one is chosen randomly and independently of what have been played before. \n\nNikita G., being the only one who is not going to drop out from the university, wonders, what is the expected number of songs guys have to listen to until every song is played at least once. \n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows. \n\nThe first and only line of each test case contains a single integer N denoting the number of songs in the album. \n\nOutput\n\nFor each test case, output a single line containing the expected number of songs the guys will listen to. Your answer will be considered as correct if it has an absolute or relative error less than 101. More formally if the expected output is A and your output is B, your output will be considered as correct if and only if\n|A  B|  101 * max{|A|, |B|, 1}. \n\nConstraints\n\n1  T  100\n1  N  3000\n", "TESTCASE_1": "3\n1\n2\n3\n\n###---###SEPERATOR---###---\n1.000000\n3.000000\n5.500000\n", "TESTCASE_2": "3\n1\n5\n9\n###---###SEPERATOR---###---\n1.000000\n11.416667\n25.460714\n", "TESTCASE_3": "3\n2\n4\n10\n\n###---###SEPERATOR---###---\n3.000000\n8.333333\n29.289683\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}