{"Q_ID": "1115110242", "S_NAME": "Arrays", "Q_NAME": "Warehouse", "Q_DESC": "Olya works as a warehouse keeper for a T-Shirt factory. Now the factory is facing hard times, so currently they produce only the T-shirts of three kinds: red, green and blue T-Shirts. All the T-shirts are stored in the containers, each of the containers contain the T-Shirts of a single colour.\n\nNow there are N containers at the warehouse, lined up in a line. Let's enumerate the containers by the positive integers from 1 to N, starting from the leftmost and ending at the rightmost one. Their order is described with a string S. Each symbol of this string is either r, g or b and denotes the colour of the respective T-shirts, stored in the container.\n\nOlya likes orderliness. She is not satisfied with the fact that different kinds of containers are messed up. So she wants to rearrange the containers in such a way that the number of pairs of adjacent containers that contain the T-shirts of different colors is as minimal as possible.\n\nFor doing that, she has a special crane. The crane is capable of doing the following things:\n\nTake a container with the number X and put it in front of all the containers. This operation takes (X-1) seconds. Note that we are considering the 1-dimensional model of the warehouse, so in front of all the containers means to the left of all the containers. The warehouse is so large, so you shouldn't worry about its' size and this operation is always performable.\nTake a container with the number X and take some container to the left of it (say, the container number Y). Remove the container number X from its' position and insert it right after the container with the number Y. This operation will take X-Y-1 seconds.\nTake a container with the number X and take some container to the right of it (say, the container number Y). Remove the container number X from its' position and insert it right after the container with the number Y. This operation will take Y-X seconds.\nNote that after the operation, we will re-enumerate the containers from left to right by the positive integers from 1 to N.\n\nThough Olya is keen on orderliness, she doesn't way to stay at the warehouse for long on Sunday. So she asks you to help her and to calculate the minimal possible number of seconds that is necessary to rearrange the containers in the desired way.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first (and only) line of each test case contains a string S, consisting of N symbols denoting the color string corresponding to the containers.\n\nOutput\n\nFor each test case, output a single line containing the answer to the problem's question for the corresponding test case.\n\nConstraints\n\n1 = T = 10\nThe string S consists only of the lower-case Latin letters from the set {r, g, b}.\n(Subtask 1): 1  N = |S|  7 - 33 points.\n(Subtask 2): 1  N = |S|  1000 - 33 points.\n(Subtask 3): 1  N = |S|  105 - 34 points.", "TESTCASE_1": "4\nrgr\nrrr\nrgb\nRgbr\n###---###SEPERATOR---###---\n1\n0\n0\n0", "TESTCASE_2": "4\nrgr\nrrb\nrgr\nRrbr\n###---###SEPERATOR---###---\n1\n0\n1\n1", "TESTCASE_3": "4\nrgr\ngrb\nggr\nRrbr\n###---###SEPERATOR---###---\n1\n0\n0\n1", "TESTCASE_4": "\n###---###SEPERATOR---###---\n", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}