{"Q_ID": "1115110209", "S_NAME": "Arrays", "Q_NAME": "Colored Array", "Q_DESC": "\"Chef had a hard time arguing with his friend, and after getting a great old kick Chef saw a colored array with N cells, numbered from 1 to N. Explanation:\nFor this sample, we can repaint only once, since K = 1. We should repaint 4th cell with color 1. We will pay 1 for this, and receive: \n1 (1st cell - 1st color) + \n1 (2nd cell -1st color) + \n1 (3rd cell - 2nd color) + \n3 (4th cell - 1st color) = 6.\nHence we get 6  1 = 5 points in total, and it is the optimal answer.\n\nThe kick was so strong that Chef suddenly understood the rules of the game. \n Each cell is painted with a color. Here the colors are numbered from 1 to M.\n For any cell i, Chef can repaint it with any color q, and the cost of such operation is Ci,q points.\n However Chef can do at most K repaintings (0 repaintings is possible). \n After performing all repaintings, each cell will have some color. For each cell i, if cell i has color q then Chef will receive Bi,q points.\nNow Chef is wondering how many points can he receive in total when he repaints optimally.\nInput\nThe first line of the input contains an integer T, denoting the number of test cases. The description of T test cases follows.\nThe first line of each test case contains three space-separated integers N, M and K, denoting the number of cells and the number of colors, the maximal possible number of repaintings respectively. The next line contains N space-separated integers A1, A2, ..., AN, denoting the initial colors of the cells. Then N lines follow. The ith line of them contains M integers Bi1, Bi2, ..., BiM, where Bij denotes how many points Chef will receive if the cell i will be painted with j-th color after all operations. Then N lines follow. The ith line of them contains M integers Ci1, Ci2, ..., CiM, where Cij denotes how many points Chef will lose if he repaints the cell i with color j.\nNote: Be careful that the size of input files can be large. \nOutput\nFor each test case, output a single line containing the maximal possible points.\nConstraints\n 1 <= T<=  5\n 0 <= K <= 1000\n 1 <= N, M <= 1000\n 1<=  Ai<=  M\n 0 <Bi,j<  1000\n 0 < Ci,j < 1000\n If j = Ai, then Ci,j = 0\n\"", "TESTCASE_1": "1\n4 2 1\n1 1 2 2\n1 1\n1 1\n1 1\n3 1\n0 1\n0 1\n1 0\n1 0\n###---###SEPERATOR---###---\n5", "TESTCASE_2": "1\n3 1 0\n0 0 1 1\n1 1\n1 1\n1 1 \n3 1\n1 0\n1 0\n0 1\n0 1\n###---###SEPERATOR---###---\n1", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}