{"Q_ID": "1115210033", "S_NAME": "Arrays", "Q_NAME": "Not every love story has a happy ending!-CARAN011", "Q_DESC": "Little Jhool was certainly a con man, fooling people by telling them about their future, [The first problem!] but he loved his girl - truly! But, Big Jhool, his girlfriend, was shocked and had broken up with him after getting to know that Little Jhool was a con man. Now, our hero of this problem set, little Jhool is upset, and hes unable to get over her (Or, back with her, for that matter!) and hes sure that somewhere deep down she still loves him!\nAnd to verify her love for him, hes using the good, old, tested formula by the lovers of tearing off the petals of a flower one by one, and saying, She loves me!, She loves me not! Now, hes standing in the garden of your house, and plucking off the petals of as many flowers as he sees everyday. Obviously, hes so obsessed with his ex, that he wants to stop at She loves me! and not very surprisingly, start off with She loves me! as well!\nYoure his neighbor, and you cannot bear him cry when the answer comes out to be She loves me not!, so you decide to help him. Given n roses in his garden, you want to pick up a bouquet with maximum number of total petals (To keep him busy!) so that the result would be in little Jhools favor (She loves me!) and he wouldnt cry because of his lost love. A bouquet may even consist of a single flower, but you just have to make him not cry!\nFind the maximum number of rose petals possible in the bouquet of flowers.\nInput format:\nThe first line contains n, the number of roses in your garden. The second line will contain n different integers separated by space, which denote the number of petals on the i-th rose.\nOutput format:\nYou have to print the maximum number of petals in the bouquet of rose, which would result in She loves me!. If there is no such bouquet possible, sadly, print :( instead.\nConstraints:\nThere will be no more than 100 roses in a bouquet, and no less than 1. The number of petals in a bouquet will also be less than 100 and greater or equal to 1.", "TESTCASE_1": "1\n4\n###---###SEPERATOR---###---\n:(", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "3\n5 7 9\n###---###SEPERATOR---###---\n21", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}