{"Q_ID": "1115210002", "S_NAME": "Arrays", "Q_NAME": "RMS Lusitania", "Q_DESC": "\"RMS Lusitania\" was one of the world biggest ship of her time.On the outbreak of the First World War in 1914, she was commandeered by the Admiralty as an armed merchant cruiser. When Lusitania left New York for Liverpool on what would be her final voyage on 1 May 1915, submarine warfare was intensifying in the Atlantic. Germany had declared the seas around the United Kingdom to be a war-zone..On the afternoon of May 7, Lusitania was bombarded by a German U-Boat,few miles off the southern coast of Ireland and inside the declared ?zone of war?.Lusitania was officially carrying among her cargo rifle/machine-gun ammunition, shrapnel artillery shells without powder charges and artillery fuses.Captain \"Dow\" of Lusitania sensed the danger before and ordered his men to save the ammunition materials as much as they can.\n\nThey had few small boats and the overall load those small boats could carry was \"W\".Captain \"Dow\" knew the value of all the \"N\" ammunition items.So he told his men the weight \"Wi\" and value \"Vi\" of each ammunition item.As it is too difficult to save all the ammunition,Captain then asked his men to smarty choose ammunition items such that the total weight of the ammunition is less than or equal to maximum load those small ships can afford and the corresponding total value of ammunitions saved is maximum.\n\nINPUT:\n\nthe first line contain number of testcases \"T\".\"T\" testcases follows then.For each testcase,the first line contains the number of ammunition items \"N\",the second line contains the maximum load \"W\" those small ships can afford.The third line contains the individual weight of each ammunition item.Then the next line contains the value \"V\" of those \"N\" ammunition items.\n\nOUTPUT:\n\nfor each testcase output the maximum value of the ammunitions that can be saved.\n\nConstraint:\n\n1 <= T <= 100\n\n0 <= N <= 1000\n\n1 <= maximum load <= 1000\n\n1 <= weight of individual items <= 1000\n\n1 <= value of individual items <= 1000", "TESTCASE_1": "2\n3 \n3\n1 2 3     \n2 4 8\n4 \n8\n2 4 5 7\n4 9 7 5\n###---###SEPERATOR---###---\n8\n13", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "1\n0\n0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}