{"Q_ID": "1115310026", "S_NAME": "Arrays", "Q_NAME": "Average Step", "Q_DESC": "Consider the following weird way of finding the average of N numbers. Take any two of the numbers and replace them with their average; repeat this operation exactly N-1 times. The only remaining number is called the stepping average of the initial set. Note that a set may obviously have different stepping averages depending on our choice for every operation.\n\nYour task is, given N integers, find a way of performing the operations such that the resulting stepping average is as close to the given integer K as possible. Note that this is a challenge problem: you dont have to find the best possible solution, but the better is your solution the more points you get.\nInput\n\nThe first line of the input contains an integer T -- the number of test cases (no more than 10). Each test case consists of two lines -- the first of them contains two positive integers N and K (N  1000, K  109), the second contains N space-separated positive integers A1..AN (Ai  109).\nOutput\n\nThe output for each test case should contain exactly N-1 pairs of integers. i-th pair (1-based) x y means that numbers Ax and Ay are chosen at the corresponding operation, their average is written to AN+i, and Ax and Ay cant be used any more. See example explanation for more clarity.\nScoring\n\nYour score for each test case is just the absolute difference between K and your remaining number. Your final score is the average of all test case scores. Your goal is to minimize the final score.\n\nNote that in order for your submission not to be judged as Wrong Answer the following conditions should be satisfied:\n\n    your output should contain exactly N-1 pairs of positive integers separated by at least one space for each test case and nothing else;\n    your output should contain integers strictly less that N+i in the i-th pair (1-based) for each test case;\n    all integers in your output for each test case should be different.", "TESTCASE_1": "1\n5 5\n9 1 6 3 4\n###---###SEPERATOR---###---\n1 2\n4 5\n3 7\n6 8", "TESTCASE_2": "1\n5 3\n8 5 1 4 2\n###---###SEPERATOR---###---\n1 2\n6 3\n4 5\n7 8", "TESTCASE_3": "1\n3 3\n2 4 3\n###---###SEPERATOR---###---\n1 2\n3 4", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}