{"Q_ID": "1115110217", "S_NAME": "Arrays", "Q_NAME": "I am the Winner", "Q_DESC": "The winner of the card game popular in Berland \"Berlogging\" is determined according to the following rules. If at the end of the game there is only one player with the maximum number of points, he is the winner. The situation becomes more difficult if the number of such players is more than one. During each round a player gains or loses a particular number of points. In the course of the game the number of points is registered in the line \"name score\", where name is a player's name, and score is the number of points gained in this round, which is an integer number. If score is negative, this means that the player has lost in the round. So, if two or more players have the maximum number of points (say, it equals to m) at the end of the game, than wins the one of them who scored at least m points first. Initially each player has 0 points. It's guaranteed that at the end of the game at least one player has a positive number of points.\n\nInput\nThe first line contains an integer number n (1n1000), n is the number of rounds played. Then follow n lines, containing the information about the rounds in \"name score\" format in chronological order, where name is a string of lower-case Latin letters with the length from 1 to 32, and score is an integer number between -1000 and 1000, inclusive.\n\nOutput\nPrint the name of the winner.", "TESTCASE_1": "3\nmike 3\nandrew 5\nmike 2\n###---###SEPERATOR---###---\nandrew", "TESTCASE_2": "5\nkaxqybeultn -352\nmgochgrmeyieyskhuourfg -910\nkaxqybeultn 691\nmgochgrmeyieyskhuourfg -76\nkaxqybeultn -303\n###---###SEPERATOR---###---\nkaxqybeultn", "TESTCASE_3": "7\nksjuuerbnlklcfdjeyq 312\ndthjlkrvvbyahttifpdewvyslsh -983\nksjuuerbnlklcfdjeyq 268\ndthjlkrvvbyahttifpdewvyslsh 788\nksjuuerbnlklcfdjeyq -79\nksjuuerbnlklcfdjeyq -593\nksjuuerbnlklcfdjeyq 734\n###---###SEPERATOR---###---\nksjuuerbnlklcfdjeyq", "TESTCASE_4": "3\nandrew 3\nandrew 2\nmike 5\n###---###SEPERATOR---###---\nandrew", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}