{"Q_ID": "1115210020", "S_NAME": "Arrays", "Q_NAME": "Samu and Shooting Game-CARAN002", "Q_DESC": "Samu is playing a shooting game in play station. There are two apples to aim in this shooting game. Hitting first apple will provide her X points and hitting second apple will provide her Y points. And if she misses the apple she chose to hit, she wont get any point.\n\nNow she is having N coins and each shoot will cost her 1 coin and she needs to score at least W points to win the game.\n\nSamu dont like to loose at any cost. At each turn, she has two choices. The choices include:-\n\nHitting first apple with probability P1 percent. However, she might miss it with probability (1-P1)percentage.\nHitting second apple with probability P2 percent. However, she might miss it with probability (1-P2)percentage.\nShe would like to know what is the maximal expected probability(as a percentage b/w 0 and 100) of winning the shooting game.\n\nInput Format: \nFirst line contains the number of test cases T. \nEach test case consists of six space separated integers of the form X Y N W P1 P2 as described in the statement.\n\nOutput Format: \nFor each test case, print the result as described above in a separate line.\n\nNote:\nChoosing to hit any apple is entirely her choice. Both are independent events meaning P1 + P2 may/may not exceed 100.\nOutput must contain 6 digits after decimal.\n\nConstraints: \n1<=T<=10 \n1<=X,Y<=10 \n1<=N,W<=103 \n0<=P1,P2<=100\n\n", "TESTCASE_1": "1\n2 3 2 5 50 25\n###---###SEPERATOR---###---\n12.500000", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "10\n2 3 95 62 5 35\n2 3 485 205 28 18\n4 8 620 928 20 27\n1 4 314 641 91 46\n1 8 132 792 87 52\n7 5 59 191 1 52\n9 4 287 709 24 50\n1 7 120 368 71 28\n6 9 151 687 63 51\n4 9 93 196 38 42\n###---###SEPERATOR---###---\n99.773703\n99.977630\n99.999945\n3.910922\n0.000005\n2.025546\n10.275119\n0.011268\n55.853372\n99.993194", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}