{"Q_ID": "1115310007", "S_NAME": "Arrays", "Q_NAME": "Granama Recipes-CARE027", "Q_DESC": "Raj has learned a new technique for comparing two recipes. A recipe contains a list of ingredients in increasing order of the times they will be processed. An ingredient is represented by a letter a-z. The i-th letter in a recipe denotes the i-th ingredient. An ingredient can be used multiple times in a recipe.\n\n\n\nThe technique is as follows. Compare two recipes by comparing their respective lists. If the sets of ingredients used in both recipes are equal and each ingredient is used the same number of times in both of them (processing order does not matter), they are declared as granama recipes. (granama is the chef-ian word for similar.)\n\n\n\nraj took two recipes he invented yesterday. He wanted to compare them using the technique. Unfortunately, raj forgot to keep track of the number of times each ingredient has been used in a recipe. He only compared the ingredients but NOT their frequencies. More precisely, raj considers two recipes as granama if there are no ingredients which are used in one recipe and not used in the other recipe.\n\n\n\nYour task is to report whether raj has correctly classified the two recipes (as granama or not granama) although he forgot to keep track of the frequencies.\n\n\n\nInput\n\n\n\nThe first line of the input contains a single integer T denoting the number of test cases. The description for T test cases follows. Each test case consists of a single line containing two space-separated strings R and S denoting the two recipes.\n\n\n\nOutput\n\n\n\nFor each test case, output a single line containing YES (quotes for clarity) if raj correctly classified the two recipes as granama or not granama. Otherwise, output a single line containing NO (quotes for clarity) if raj declared two recipes as granama when they actually are not.\n\n\n\nConstraints\n\n\n\n1 = T = 100\n\n1 = |R|, |S| = 1000", "TESTCASE_1": "3\nalex axle\nparadise diapers\nalice bob\n###---###SEPERATOR---###---\nYES\nNO\nYES", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}