{"Q_ID": "1115210022", "S_NAME": "Arrays", "Q_NAME": "Supernatural Squad [2]-CARAN004", "Q_DESC": "Fatal Eagle has decided to do something to save his favorite city against the attack of Mr. XYZ, since no one else surprisingly seems bothered about it, and are just suffering through various attacks by various different creatures.\n\nSeeing Fatal Eagles passion, N members of the Bangalore City decided to come forward to try their best in saving their city. Now Fatal Eagle decided to strategize these N people into a formation of AT LEAST K people in a group. Otherwise, that group wont survive.\n\nLets demonstrate this by an example. Lets say that there were 10 people, and each group required at least 3 people in it for its survival. Then, the following 5 groups can be made:\n\n10 - Single group of 10 members.\n7, 3 - Two groups. One consists of 7 members, the other one of 3 members.\n6, 4 - Two groups. One consists of 6 members, the other one of 4 members.\n5, 5 - Two groups. One consists of 5 members, the other one of 5 members.\n4, 3, 3 - Three groups. One consists of 4 members, the other two of 3 members.\nGiven the value of N, and K - help Fatal Eagle in finding out the number of ways he can form these groups (anti-squads) to save his city.\n\nInput format:\nThe first line would contain, T - denoting the number of test cases, followed by two integers, N and K denoting the number of people whore willing to help and size of the smallest possible group which can be formed.\n\nOutput format:\nYouve to print the number of ways in which groups can be formed.\n\nConstraints:\n1 = T = 30\n1 = N, K = 200", "TESTCASE_1": "2\n10 3\n20 5\n###---###SEPERATOR---###---\n5\n13", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "10\n113 6\n93 2\n163 20\n163 8\n143 2\n121 3\n199 5\n156 16\n54 9\n133 1\n###---###SEPERATOR---###---\n624845\n9476370\n19809\n8844587\n1950689437\n40203969\n2767148467\n55926\n203\n7346629512", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}