{"Q_ID": "1115310031", "S_NAME": "Arrays", "Q_NAME": "Mat Ranka", "Q_DESC": "There is an ancient legend in China called Ranka\n\n(Content taken from wikipedia)\nWang Chih was a hardy young fellow who used to venture deep into the mountains to find suitable wood for his axe.\nOne day he went farther than usual and became lost. He wandered about for a while and eventually came upon two strange old men\nwho were playing Go, their board resting on a rock between them. Wang Chih was fascinated. He put down his axe and began to watch.\nOne of the players gave him something like a date to chew on, so that he felt neither hunger nor thirst. As he continued to watch he\nfell into a trance for what seemed like an hour or two. When he awoke, however, the two old men were no longer there.\nHe found that his axe handle had rotted to dust and he had grown a long beard. When he returned to his native village he discovered\nthat his family had disappeared and that no one even remembered his name.\n\nSo how could that happen? Well, thats because the game Go can played very long.\n\nLets first define the game Go:\n\nIn this game, we focus on the game played on a 9x9 board. It is a game played by 2 players.\nA plays black stone while B plays white. They play alternatively. A goes first.\nIn each cell there can be 3 states: empty, having 1 black stone and having 1 white stone.\n\nIf we link the same color stones which are neighbourhood (|x1-x2| + |y1-y2| = 1), we can get some connected component.\nWe say a connected component is dead if no stone in it has an empty neighbourhood cell.\n\nIn each move, the player must put the stone on an empty cell or pass the turn. If this player put a stone, following situation will\nhappen.\n\nIf after this move there is at least one connected component of opponent dead, then stones from these dead components\nwill be removed. (In this case, after remove all dead components of your opponent, we can prove all your connected component are not dead.)\nOtherwise, if there are at least one connected component of yours dead, then this move is invalid.\n\nIn order to avoid infinite loops, there is a rule called No same state. The state of board can be expressed as a string with length 82:\nthe first character indicate who is the next player, then 9*9 character indicate the state of a certain cell. If after one move the game\ngoes into a state that previously occurred, then this move is invalid.\n\nYou are given an integer N. Please output a match that contains N valid moves for both player.\n\nYou can find details for the rules in the judge program\nhere.\nInput\n\nOnly line of input will contain an integer denoting N.\nOutput\n\nYou must output N lines.\nIf the player uses pass at that step, then output 0 0, otherwise output the coordinate x y where 1  x,y  9.\nConstraints and Subtasks\n\n    Subtask1 (20 points) : N = 5000\n    Subtask2 (80 points) : N = 10000", "TESTCASE_1": "12\n###---###SEPERATOR---###---\n1 1\n0 0\n1 2\n0 0\n1 3\n0 0\n1 4\n0 0\n1 5\n0 0\n1 6\n0 0", "TESTCASE_2": "2\n###---###SEPERATOR---###---\n1 1\n0 0", "TESTCASE_3": "4\n###---###SEPERATOR---###---\n1 1\n0 0\n1 2\n0 0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}