{"Q_ID": "1115210029", "S_NAME": "Arrays", "Q_NAME": "DISTINCT DIGITS II- CARA013", "Q_DESC": "Andi and Bob are the best friends of each other.They both are good programmers as well,They like to do programming together so that if one finds any difficulty other can help.But these days Andi is quite busy as his exams are on the way . So, Bob has to do programming alone.while practising on HackerEarth Bob encounters an interesting problem which he was unable to solve efficiently.So, he asked for Andis help.\nProblem as stated by Bob :\nGiven an array of N elements and Q queries need to be processed over this array.A query can be any of the following three types.\nType ADD: u v\nType MUL: u v\nType REP: u v\nType MAX: l r\nType MIN: l r\nExplanation:\nfor query Type ADD: replace the uth element of the array with (uth element+v)%MOD;\nfor query Type MUL: replace the uth element of the array with (uth element *v)%MOD;\nfor query Type REP: replace uth element of the array with v%MOD\nfor query Type MAX: count the number of numbers which have MAXIMUM distinct digits between l to r, both inclusive\nfor query Type MIN: count the number of numbers which have MINIMUM distinct digits between l to r, both inclusive\nAndi likes the problem very much and wants to solve it.But being super busy with exams, he has no time to help Bob. But he can?t let Bob feel helpless with any problem. So can you please help Bob and save their friendship?\nnote: Assume MOD=10^9+7.\nI check even my code is giving WA on sample test case so please do submit your code to check the result and please ensure output format should be same as mentioned in the problem statement . print a new line after each query of type MIN or MAX.\nINPUT:\nFirst line of the input contains a single integer N denoting the number of elements in the array.Next line of input contains N space seperated integers.Third line of input contains a single interger Q denoting the number of queries to be processed over the array.Next Q lines of input contain Q queries (one query per line).\nOUTPUT:\nfor each query of type MIN and MAX print two space seperated integers number of distinct digits and number of such numbers.\nCONSTRAINT:\n1<=Q,N<=10^5\n1<=A[i]<=10^9\n1<=v<=10^9\n1<=u,l,r<=N", "TESTCASE_1": "5\n1 2 3 4 5\n5\nMAX 1 5\nMIN 1 5\nMUL 3 4\nMAX 1 5\nMIN 1 5\n###---###SEPERATOR---###---\n1 5\n1 5\n2 1\n1 4", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "3 \n1 3 5\n2\nMAX 3 5\nMIN 1 5\n###---###SEPERATOR---###---\n1 1\n1 3", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}