{"Q_ID": "1115310032", "S_NAME": "Arrays", "Q_NAME": "Painting", "Q_DESC": "Chef recently took up painting. He likes painting pictures, but is always thinking of ways to make painting more efficient. Chef begins with a square canvas, initially painted completely white. He paints one rectangle at a time, where every edge must have integer length, and 2 edges of the rectangle must be parallel to the horizontal axis. When Chef paints a rectangle, he paints it in one of the following ways:\n\n    White - paint the entire rectangle white\n    Black - paint the entire rectangle black\n    Flip - All white paint inside the rectangle becomes black, and all black paint becomes white\n\nChef wants your help in order to paint as few rectangles as possible. You will be given the final picture that Chef intends to paint. You must come up with a plan to paint the picture. Chef knows this is a difficult problem, so he isnt requiring optimal solutions, but the fewer rectangles you use the more points you will score.\nInput\n\nInput will begin with an integer N, the size of the painting. N lines follow with N characters each, describing the picture chef wishes to paint. The top-left corner is (0, 0), the top-right corner is (0, N1), the bottom-left corner is (N1, 0), and the bottom-right corner is (N1, N-1). A W character indicates the corresponding cell of the painting is white, and a B character indicates the cell is black.\nOutput\n\nFirst output an integer L, the number of rectangles in your solution. This number must not exceed N2. Then output L lines. Each line should consist of 2 pairs of integers followed by a W, B, or F character. The first pair of integers is the (row, column) coordinates of the upper-left corner of the rectangle, and the second pair is the (row, column) coordinates of the bottom-right corner. The final character indicates the operation to perform on the rectangle, W for white, B for black, and F for flip.\nConstraints\n\n10  N  50 (excepting Sample Input)\nAll official inputs are generated by the method described in Test Generation.", "TESTCASE_1": "2\nBWBBB\nBBBWW\n###---###SEPERATOR---###---\n2\n0 0 1 0 B\n1 1 1 1 B", "TESTCASE_2": "1\nBBWWB\n###---###SEPERATOR---###---\n1\n0 0 0 0 B", "TESTCASE_3": "2\nBBWWB\nWBBBW\n###---###SEPERATOR---###---\n2\n0 0 0 1 B\n1 1 1 1 B", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}