{"Q_ID": "1115110235", "S_NAME": "Arrays", "Q_NAME": "Coin Flip", "Q_DESC": "Little Elephant was fond of inventing new games. After a lot of research, Little Elephant came to know that most of the animals in the forest were showing less interest to play the multi-player games.Little Elephant had started to invent single player games, and succeeded in inventing the new single player game named COIN FLIP.\n\nIn this game the player will use N coins numbered from 1 to N, and all the coins will be facing in Same direction (Either Head or Tail),which will be decided by the player before starting of the game.\n\nThe player needs to play N rounds.In the k-th round the player will flip the face of the all coins whose number is less than or equal to k. That is, the face of coin i will be reversed, from Head to Tail, or, from Tail to Head, for i  k.\n\nElephant needs to guess the total number of coins showing a particular face after playing N rounds. Elephant really becomes quite fond of this game COIN FLIP, so Elephant plays G times. Please help the Elephant to find out the answer.\nInput\n\nThe first line of input contains an integer T, denoting the number of test cases. Then T test cases follow.\n\nThe first line of each test contains an integer G, denoting the number of games played by Elephant. Each of the following G lines denotes a single game, and contains 3 space separeted integers I, N, Q, where I denotes the initial state of the coins, N denotes the number of coins and rounds, and Q, which is either 1, or 2 as explained below.\n\nHere I=1 means all coins are showing Head in the start of the game, and I=2 means all coins are showing Tail in the start of the game. Q=1 means Elephant needs to guess the total number of coins showing Head in the end of the game, and Q=2 means Elephant needs to guess the total number of coins showing Tail in the end of the game.\nOutput\n\nFor each game, output one integer denoting the total number of coins showing the particular face in the end of the game.\nConstraints\n\n1 = T = 10\n1 = G  =20000\n1 = N = 109\n1= I = 2\n1 = Q=  2", "TESTCASE_1": "1\n2\n1 5 1\n1 5 2\n###---###SEPERATOR---###---\n2\n3", "TESTCASE_2": "1\n3\n1 2 3\n8 2 1\n2 3 1\n###---###SEPERATOR---###---\n1\n1\n2", "TESTCASE_3": "1\n2\n2 3 1\n1 2 1\n###---###SEPERATOR---###---\n2\n1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}