{"Q_ID": "1116210075", "S_NAME": "String", "Q_NAME": "The making of a cake", "Q_DESC": "CodeChef has received an order from the President of Mithai country for his sons birthday cake. The president is a person of very high temper and CodeChef doesnt want to tick him him, so he had to prepare a cake exactly as described by the Presidents son. He asked for a cake with N layers and each layer has to be of a type specified by him. The type of layer is represented by a lowercase letter from the English alphabet.\n\nCodeChef asked his sous Chef, Jalebi Bai, to make this cake, who was very sleepy due to a very long and tiring journey to a planet far far away earlier.\nDue to tiredness, Jalebi Bai screwed up the the layers while baking the cake. Thankfully, it has the same number of layers as required, but any of the layers may or may not be the same as described in the order. CodeChef is really worried because of this, as making a new cake will cost him a huge amount of money.\n\nAt this point of time, Samosa Bhai comes to the rescue. He has a layer swapper (patent pending) which can swap the layers of a cake without ruining the cake. This swapper has a limitation that it can swap layers separated exactly by distance D only, meaning there should be exactly D-1 layers in between the two layers to be swapped.\n\nYou have to tell if the cake made by Jalebi Bai can be changed into the cake described by the Presidents son using Samosa Bhais swapper.\n\nInput\n\nThe first line contains T, the number of test cases.\n\nThe first line of each test case contains N and D.\n\nThe next line contains a lowercase string A representing the cake described by the Presidents son.\n\nThe next line contains a lowercase string B representing the cake made by Jalebi Bai.\n\nOutput\n\nFor each test case, output \"\"Yes\"\" [without quotes] if it is possible to transform the cake B into cake A using the layer swapper. Otherwise, output \"\"No\"\" [without quotes].\n\nConstraints\n\n1  T  20000\n1  N  105\n1  D  105\nSize of String A = Size of String B = N\n1  Sum of N  105\nAll characters are from a to z in string A and B.\n", "TESTCASE_1": "5\n4 2\nqnyu\nynqu\n4 1\nfbnc\nnbcf\n5 2\nabcde\nedacb\n5 2\nabcde\nedabc\n3 1\neff\nbae\n###---###SEPERATOR---###---\nYes\nYes\nNo\nYes\nNo", "TESTCASE_2": "4\n4 2\nqnyu\nynqu\n4 1\nfbnc\nnbcf\n5 2\nabcde\nedacb\n5 2\nabcde\nedabc\n###---###SEPERATOR---###---\nYes\nYes\nNo\nYes", "TESTCASE_3": "1\n4 2\nqnyu\nynqu\n###---###SEPERATOR---###---\nYes", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}