{"Q_ID": "1116210077", "S_NAME": "String", "Q_NAME": "chef gram", "Q_DESC": "Nobody outside the cooking community knows that Chef is a big fan of Chefgram  a social network where chefs and cooks upload their secret kitchen photos. Recently Chef clicked a beautiful photo, which is represented using 10 pixels in a single row. Respecting Chefgrams boolean roots, every pixel is either white or black.\n\nChefgram has N filters. Every filter is a string containing 10 symbols. Every symbol is either + or -.\n\n    A + at the ith position in a filter means that if Chef applies this filter to his photo, the ith pixel will be inverted: it becomes black if it was originally white, and vice versa.\n    A - at the ith position in a filter string means that if Chef applies this filter to his photo, the ith pixel will remain unchanged.\n\nChef can apply as many filters as he wants from a list. He can pick any subset of filters and consequently apply them to a photo.\n\nFor example:\n\n    Imagine that Chef has a photo \"\"bbwwbbwwbb\"\" (where b stands for black and w stands for white).\n    He applies filters \"\"++--++--++\"\", \"\"-+-+-+-+-+\"\".\n    Applying the first filter will transform his picture to \"\"wwwwwwwwww\"\".\n    Applying the second filter on the transformed picture will give Chef the picture \"\"wbwbwbwbwb\"\".\n\nEven if Chefgram has two or more identical filters, they are still considered different!\n\nChef is extremely interested in knowing how many different subsets of all the Chefgram filters can he apply to transform his photo into 10 black pixels? Constraints\n\n    1  T  5\n    |S| = 10\n    1  N  10^5\n    |Fi| = 10\n", "TESTCASE_1": "2\n4 4 1 1\n0 1 1 0\n0 1 1 0\n0 1 1 0\n0 0 0 0\n4 4 1 1\n0 1 1 0\n0 1 1 0\n0 1 1 0\n1 0 0 1\n###---###SEPERATOR---###---\n5\n-1", "TESTCASE_2": "2\n1 5 2 2\n0 1 1 0\n0 1 1 0\n0 1 1 0\n0 0 0 0\n5 5 2 3\n0 1 1 0\n0 1 1 0\n0 1 1 0\n1 0 0 1\n###---###SEPERATOR---###---\n-1\n0", "TESTCASE_3": "2\n1 5 2 2\n0 1 1 0\n1 5 2 2\n0 1 1 0\n0 0 0 0\n5 5 2 3\n0 1 1 0\n0 1 1 0\n0 1 1 0\n1 0 0 1\n###---###SEPERATOR---###---\n-1\n-1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}