{"Q_ID": "1116310037", "S_NAME": "String", "Q_NAME": "Tourists in Mancunia", "Q_DESC": "\"The grand kingdom of Mancunia is famous for its tourist attractions and visitors flock to it throughout the year. King Mancunian is the benevolent ruler of the prosperous country whose main source of revenue is, of course, tourism.\n\nThe country can be represented by a network of unidirectional roads between the cities. But Mancunian, our benign monarch, has a headache. The road network of the country is not tourist-friendly and this is affecting revenue. To increase the GDP of the nation, he wants to redirect some of the roads to make the road network tourist-friendly and hence, ensure happiness and prosperity for his loyal subjects.\n\nNow is the time for some formal definitions. :(\n\nA road network is said to be tourist-friendly if for every city in the country, if a tourist starts his journey there, there is a path she can take to visit each and every city of the nation and traverse each road exactly once before ending up at the city where she started.\n\nGiven a description of the road network of Mancunia, can you come up with a scheme to redirect some (possibly none) of the roads to make it tourist-friendly?\n\nInput\n\nThe first line contains two integers N and E denoting the number of cities and roads in the beautiful country of Mancunia respectively.\n\nEach of the next E lines contains two integers a and b implying that there is a unidirectional road from city a to city b.\n\nIt is guaranteed that there arent multiple roads in the exact same direction and that there is no road from a city to itself.\n\nOutput\n\nIf there is no solution, print \"\"NO\"\" (without quotes). Else, print \"\"YES\"\" (without quotes), followed by exactly E lines.\n\nThe ith line of output should represent the ith road in the input. It should have two integers a and b denoting that the final orientation of that road is from a to b.\n\nConstraints\n\n1  N  100000\n1  E  200000\n1  a, b  N\nSubtask 1: (20 points)\n\n1  N  20\n1  E  21\nSubtask 2: (80 points)\n\nSame as original constraints\nExample 1\n\nInput:\n3 3\n1 2\n2 3\n3 1\n\nOutput:\nYES\n1 2\n2 3\n3 1\nExample 2\n\nInput:\n3 2\n1 2\n2 3\n\nOutput:\nNO\nExample 3\n\nInput:\n5 6\n1 2\n2 3\n3 4\n2 4\n2 5\n1 5\n\nOutput:\nYES\n1 2\n2 3\n3 4\n4 2\n2 5\n5 1\"\n", "TESTCASE_1": "3 3\n1 2\n2 3\n3 1\n###---###SEPERATOR---###---\nYES\n1 2\n2 3\n3 1", "TESTCASE_2": "3 2\n1 2\n2 3\n\n###---###SEPERATOR---###---\nNO", "TESTCASE_3": "5 6\n1 2\n2 3\n3 4\n2 4\n2 5\n1 5\n###---###SEPERATOR---###---\nYES\n1 2\n2 3\n3 4\n4 2\n2 5\n5 1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}