{"Q_ID": "1116210071", "S_NAME": "String", "Q_NAME": "Codechef Password Recovery", "Q_DESC": "Chef recently decided a very curious encryption algorithm for CodeChef passwords. He took an N-letter password and found all the possible\n2-letter substrings, considering the characters of a password was written in a circle. Thus, for AbcD, he would deduce the following\nsubstrings: Ab, bc, cD, DA.\n\nThen, some of the substrings were reversed. For example, the set of substrings above could be converted to Ab, cb, Dc, DA. All\nthe substrings were then stored in a database. Whenever the need be, the substrings were recovered, and a password was generated. Of course\nsometimes, more than one such password could be generated, but Chef thinks this is perfectly fine!\n\nUnfortunately, a programming error by the new CodeChef minion, led to corruption of this database and mixed all the strings together.\nChef now wants to retrieve the passwords, a few at a time. He gives you a set of substrings A from some of the passwords - these you\nshould always consider, and another set of substrings B from which you can use some. Can you tell him if it is possible to select all the substrings\nfrom A and some (0 or more) substrings from B and construct 1 or more passwords? Each selected string can be used only once, for at max 1\npassword. See explanation of Sample Input for clarification.\n\nInput\n\nThe first Line contains a single number T, the number of test cases.\n\nEach test case contains 2 lines.\nThe first line of the test case contains the number N (= |A|), followed by the N substrings Chef gives in A. The next line contains\nM (= |B|), followed by M substrings. Two substrings are input with a single space character between them.\n\nOutput\n\nPrint T lines, one for each test case. Output either YES if it is possible to select all strings from A and some strings from B\nsuch that the overall set of strings represent the substrings for 1 or more passwords. Output NO otherwise.\n\nConstraints\n\n1  T  100\n1  N  1000\n1  M  1000\nAll characters would be upper case or lower case English letters. Passwords are case sensitive.\nSample Input\n\n2\n4 aB aB Ca Bc\n6 aB Ca ca ab ba bc\n4 aB aB Ca Bc\n3 Ba aC bc\nSample Output\n\nYES\nNO\nExplanation\n\nIn the first Sample Input, you can construct aBaC from (aB aB Ca Ca) and\naBc from (Bc aB ca). Strings selected from A are shown in bold. Remember that substrings can be reversed. Note\nthat although there are repeated strings, each string is used in at most one of the passwords.\n", "TESTCASE_1": "2\n4 aB aB Ca Bc\n6 aB Ca ca ab ba bc\n4 aB aB Ca Bc\n3 Ba aC bc\n###---###SEPERATOR---###---\nYES\nNO\n", "TESTCASE_2": "1\n4 aB aB Ca Bc\n6 aB Ca ca ab ba bc\n###---###SEPERATOR---###---\nYES", "TESTCASE_3": "1\n4 aB aB Ca Bc\n3 Ba aC bc\n###---###SEPERATOR---###---\nNO", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}