{"Q_ID": "1116310038", "S_NAME": "String", "Q_NAME": "Oracle Devu and Longest Common Subsequence", "Q_DESC": "Devu is a disastrous oracle: his predictions about various events of your life are horrifying. Instead of providing good luck, he blesses you with bad luck. The secret behind his wickedness is a hidden omen which is a string of length m. On your visit to him, you can ask a lot of questions about your future, each of which should be a string of length m. In total you asked him n such questions, denoted by strings s1, s2, ... , sn of length m each. Each of the question strings is composed of the characters a and b only.\n\nAmount of bad luck this visit will bring you is equal to the length of longest common subsequence (LCS) of all the question strings and the hidden omen string. Of course, as the omen string is hidden, you are wondering what could be the least value of bad luck you can get.\n\nCan you find out what could be the least bad luck you can get? Find it fast, before Devu tells you any bad omens.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nFirst line of each test case contains a single integer n denoting number of strings.\n\nFor each of next n lines, the ith line contains the string si.\n\nOutput\n\nFor each test case, output a single integer corresponding to the answer of the problem.\nConstraints\n\nAll the strings (including the hidden omen) contain the characters a and b only.\nSubtask #1: (40 points) \n1  T, n, m  14\nSubtask #2: (60 points) \n1  T, n, m  100\nExample\n\nInput:\n3\n2\nab\nba\n2\naa\nbb\n3\naabb\nabab\nbaab\n\nOutput:\n1\n0\n2\nExplanation\n\nIn the first example, the minimum value of LCS of all the strings is 1, the string by oracle can be one of these {aa, ab, ba, bb}.\n\nIn the second example, whatever string oracle has does not matter, LCS will always be zero.\n", "TESTCASE_1": "3\n2\nab\nba\n2\naa\nbb\n3\naabb\nabab\nbaab\n###---###SEPERATOR---###---\n1\n0\n2", "TESTCASE_2": "1\n3\naabb\nabab\nbaab\n###---###SEPERATOR---###---\n2", "TESTCASE_3": "2\n3\naabb\nabab\nbaab\n2\naabb\nabab\n###---###SEPERATOR---###---\n2\n2", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}