{"Q_ID": "1116310035", "S_NAME": "String", "Q_NAME": "Andrash and Stipendium", "Q_DESC": "Andrash study in Uzhland National University. Now is the time of exam results. Andrash similar to other students, hopes that this scores in the exam could fetch him a scholarship/stipendium for his studies.\n\nThere are following simple rules to receive stipendium:\n\nUniversity follows 5 point grading system. In an exam, a student can receive any score from 2 to 5. 2 is called an F grade, meaning that student has failed that exam.\nStudent should not have fail any of the exams.\nStudent must obtain a full score in some of his/her exams to show that he/she is excellent in some of the subjects.\nHe/She must have a grade point average not less than 4.0\nYou are given information regarding the exams and how Andrash performed in those. Can you help him figure out whether he will receive the stipendium or not!!\n\nInput\n\nThe first line of input contains a single integer T denoting the number of test cases. This will be followed by T test cases.\n\nThe first line of each test case contains an integer N denoting the number of examinations.\n\nThe next line of each test case contains N space separated integers denoting Andrashs score for each exam.\n\nOutput\n\nFor each of the T test cases, output a single line - Yes (without quotes) if Andrash will receive stipendium, or No (without quotes) - otherwise.\n\nConstraints and Subtasks\n\n1  T  40\nLet A[i] denote Andrashs score for i-th exam\nSubtask #1: 20 points\n\n1  N  100\n2  A[i]  5\nSubtask #2: 20 points\n\n1  N  105\n3  A[i]  5\nSubtask #3: 60 points\n\n1  N  105\n2  A[i]  5\nExample\n\nInput:\n2\n5\n3 5 4 4 3\n5\n3 4 4 4 5\n\nOutput:\nNo\nYes\nExplanation\n\nExample case 1. Students average grade point score is 3.8 which makes him/her unqualified for obtaining the stipend.\n\nExample case 2. Student satisfies all the criteria for getting stipend.\n", "TESTCASE_1": "2\n5\n3 5 4 4 3\n5\n3 4 4 4 5\n###---###SEPERATOR---###---\nNo\nYes", "TESTCASE_2": "1\n5\n3 5 4 4 3\n\n###---###SEPERATOR---###---\nNo", "TESTCASE_3": "2\n5\n3 5 4 4 3\n5\n4 3 4 2 2\n###---###SEPERATOR---###---\nNo\nNo", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}