{"Q_ID": "1116310030", "S_NAME": "String", "Q_NAME": "Devu and Perfume", "Q_DESC": "There is a haunted town called HauntedLand. The structure of HauntedLand can be thought of as a grid of size n * m. There is a house in each cell of the grid. Some people have fled from their houses because they were haunted. . represents a haunted house whereas * represents a house in which people are living.\n\nOne day, Devu, the famous perfumer came to town with a perfume whose smell can hypnotize people. Devu can put the perfume in at most one of the houses. This takes Devu one second. Then, the perfume spreads from one house (need not be inhabited by people) to all its adjacent houses in one second, and the cycle continues. Two houses are said to be a adjacent to each other, if they share a corner or an edge, i.e., each house (except those on the boundaries) will have 8 adjacent houses.\n\nYou want to save people from Devus dark perfumery by sending them a message to flee from the town. So, you need to estimate the minimum amount of time Devu needs to hypnotize all the people? Note that if there are no houses inhabited by people, Devu doesnt need to put perfume in any cell.\n\nInput\n\nThe first line of input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nFirst line of each test case contains two space separated integers n, m denoting the dimensions of the town.\n\nFor each of next n lines, each line has m characters (without any space) denoting a row of houses of the town.\n\nOutput\n\nFor each test case, output a single integer corresponding to the answer of the problem.\n\nConstraints\n\n1  T  20\nSubtask #1: (40 points)\n\n1  n, m  100\nSubtask #2: (60 points)\n\n1  n, m  1000\nExample\n\nInput:\n2\n2 2\n*.\n..\n3 4\n.*..\n***.\n.*..\n\nOutput:\n1\n2\nExplanation\n\nIn the first example, it will take Devu one second for putting the perfume at the only house. So, the answer is 1.\n\nIn the second example, He will first put the perfume at the * at cell (1, 1) (assuming 0-based indexing).\nNow, it will take Devu 1 secs to put perfume. In the next second, the perfume will spread to all of its adjacent cells, thus making each house haunted.\nSo, the answer is 2.\n", "TESTCASE_1": "2\n2 2\n*.\n..\n3 4\n.*..\n***.\n.*..\n###---###SEPERATOR---###---\n1\n2\n", "TESTCASE_2": "1\n2 2\n*.\n..\n2 3\n.*..\n***.\n.*..\n###---###SEPERATOR---###---\n1", "TESTCASE_3": "2\n2 2\n..\n2 3\n.*..\n***.\n.*..\n###---###SEPERATOR---###---\n0\n2\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}