{"Q_ID": "1116210074", "S_NAME": "String", "Q_NAME": "Granama Recipes ", "Q_DESC": "Chef has learned a new technique for comparing two recipes. A recipe contains a list of ingredients in increasing order of the times they will be processed. An ingredient is represented by a letter a-z. The i-th letter in a recipe denotes the i-th ingredient. An ingredient can be used multiple times in a recipe.\n\nThe technique is as follows. Compare two recipes by comparing their respective lists. If the sets of ingredients used in both recipes are equal and each ingredient is used the same number of times in both of them (processing order does not matter), they are declared as granama recipes. (\"\"granama\"\" is the Chef-ian word for \"\"similar\"\".)\n\nChef took two recipes he invented yesterday. He wanted to compare them using the technique. Unfortunately, Chef forgot to keep track of the number of times each ingredient has been used in a recipe. He only compared the ingredients but NOT their frequencies. More precisely, Chef considers two recipes as granama if there are no ingredients which are used in one recipe and not used in the other recipe.\n\nYour task is to report whether Chef has correctly classified the two recipes (as granama or not granama) although he forgot to keep track of the frequencies.\n\nInput\n\nThe first line of the input contains a single integer T denoting the number of test cases. The description for T test cases follows. Each test case consists of a single line containing two space-separated strings R and S denoting the two recipes.\n\nOutput\n\nFor each test case, output a single line containing \"\"YES\"\" (quotes for clarity) if Chef correctly classified the two recipes as granama or not granama. Otherwise, output a single line containing \"\"NO\"\" (quotes for clarity) if Chef declared two recipes as granama when they actually are not.\n\nConstraints\n\n1  T  100\n1  |R|, |S|  1000\n\nExplanation:\n\nExample case 1: Chef declared them as granama recipes. They are actually granama because the sets of ingredients and the number of times each ingredient has been used are equal. The Chef got it right!\n\nExample case 2: Chef declared them as granama recipes because both sets of ingredients are equal. But they are NOT granama since ingredient a has been used twice in the first recipe but only once in the second. The Chef was incorrect!\n\nExample case 3: Chef declare them as not granama. They are not granama as the sets of ingredients are different. Hence, the Chef was right!\n", "TESTCASE_1": "3\nalex axle\nparadise diapers\nalice bob\n###---###SEPERATOR---###---\nYES\nNO\nNO", "TESTCASE_2": "2\nalex axle\nparadise diapers\n###---###SEPERATOR---###---\nYES\nNO", "TESTCASE_3": "1\nparadise diapers\n###---###SEPERATOR---###---\nNO", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}