{"Q_ID": "1116310025", "S_NAME": "String", "Q_NAME": "Palindromeness", "Q_DESC": "\"Let us define the palindromeness of a string in the following way:\n\nIf the string is not a palindrome, its palindromeness is zero.\nThe palindromeness of an one-letter string is 1.\nThe palindromness of a string S of the length greater than one is 1 + \"\"palindromeness of the string that is formed by the first [|S|/2] symbols of S\"\".\nLet us consider some examples for better understanding:\n\nThe palindromeness of the string zxqfd is 0, since the string is not a palindrome.\nThe palindromeness of the string a is 1, by definition.\nThe palindromeness of the string aa is 2, beucase for \"\"aa\"\" we get 1 + palindromeness of \"\"a\"\", that is one, so we get 2.\nThe palindromeness of the string abacaba is 3.\nYou are given a string S. Find the sum of the palindromenesses of all the non empty substrings of S (i.e. S[i..j], where i <= j). In other words, you have to calculate the sum of palindromenesses of N * (N + 1) / 2 substrings of S, where N is the length of S.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first and only line of every test case contains a single string S for the corresponding test case.\n\nOutput\n\nFor each test case, output a single line containing an integer corresponding to the answer to the problem.\n\nConstraints\n\n1  T  3\nS consists only of lower-case Latin letters.\nSubtask 1 (15 points):\n\n1  |S|  100\nSubtask 2 (23 points):\n\n1  |S|  1000\nSubtask 3 (62 points):\n\n1  |S|  105\nExample\n\nInput:\n2\nzxqfd\naba\n\nOutput:\n5\n5\nExplanation\n\nExample case 1: There is no palindrome that occurs as the substring of zxqfd and has the length more than 1. The individual characters are palindromes of the palindromeness of 1.\n\nExample case 2: The palindromeness of aba is 2 and the sum of the palindromenesses of single characters is 3.\"\n", "TESTCASE_1": "2\nzxqfd\naba\n###---###SEPERATOR---###---\n5\n5", "TESTCASE_2": "1\nzxqfd\n###---###SEPERATOR---###---\n5", "TESTCASE_3": "2\nabc\nzxqfd\n###---###SEPERATOR---###---\n3\n5", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}