{"Q_ID": "1116110057", "S_NAME": "String", "Q_NAME": "Sereja and Two Strings 2 ", "Q_DESC": " Sereja has a string A consisting of n lower case English letters.\n\nSereja calls two strings X and Y each of length n similar if they can be made equal by applying the following operation at most once in each of them.\n\n    Chose any two position i, j in the string (i can be equal to j too). Swap the characters at position i with character at position j.\n\nFor example strings \"abcd\" and \"acbd\" are similar, strings \"ab\" and \"ab\" are similar, but strings \"abcde\" and \"bcdea\" are not similar. Note that strings \"abc\" and \"cab\" are also similar, as you can swap a and c in the first string to get \"cba\" and a and b in the second string to get \"cba\".\n\nNow Sereja is interested in finding number of ordered pairs of non similar strings X and Y such that they can be constructed from a given string A by permutation of its characters. As answer could be large, please output your answer modulo (109 + 7).\n\nNote\nA string s (of size n) is said to be constructed from string t (also of size n) by permutation of its characters if there exists a permutation P (of length n), such that s[i] = t[P[i]] for each i from 1 to n.\nInput\n\n    First line contain integer T - number of test cases.\n    For each of the next T lines:\n        Each line contains a string A as defined in the problem.\n\nOutput\n\nFor each test case, output answer modulo 1000000007 (109 + 7) in separate line.\nConstraints\n\n    1<=  T <= 10\n    1 <= n <= 10^5\n\nConstraints\n\n    Subtask #1: 1<=  n <= 10 (25 points)\n    Subtask #2: 1 <= n <= 100 (25 points)\n    Subtask #3: 1 <= n <= 1000 (25 points)\n    Subtask #4: original constraints (25 points)\n", "TESTCASE_1": "2\nz\nabcd\n###---###SEPERATOR---###---\n0\n144", "TESTCASE_2": "2\nw\nabcde\n###---###SEPERATOR---###---\n0\n8880", "TESTCASE_3": "1\nz\nabcd\n###---###SEPERATOR---###---\n0\n144", "TESTCASE_4": "2\nz\nabcdef\n###---###SEPERATOR---###---\n0\n445680", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}