{"Q_ID": "1116310007", "S_NAME": "String", "Q_NAME": "Head-chef Monica-CSTE003", "Q_DESC": "Monica is the Head-chef at Javus restaurant. Javu has N kitchen workers, numbered from 1 to N. Each kitchen worker has expertise in exactly one of the following fields:\n\n1. VEG - denoted as V\n\n2. NONVEG - denoted as N\n\n3. GRILL - denoted as G\n\n4. TOAST - denoted as T\n\n5. SANDWICH - denoted as S\n\n6. BURGER - denoted as B\n\n7. PIZZA - denoted as P\n\nYoull be given the string S1 of length N, where ith character defines the field of expertise of ith worker, 1 ? i ? N.\n\nNow, a customers order contains 3 fields:\n\n1st field 2nd field 3rd field\n\nVEG or NONVEG (V or N) GRILL or TOAST (G or T) SANDWICH or BURGER or PIZZA (S or B or P)\n\nYoull be given a string S2 of length 3, where jth character defines the jth field of the order, 1 ? j ? 3.\n\nThe first character will either be V or N. Second character will either be G or T. Third character will either be S orB or P.\n\nAccording to the customer order, Monica has to form a team of workers who can prepare the order. Javu has received M orders at the moment. You have to find in how many ways can Monica prepare a team of 3 workers for each of the orders.\n\nNote: One worker can only work in one team. See the sample test case for clarification.\n\nInput:\n\nFirst line of input contains N - number of workers.\n\nSecond line contains a CSTing S1 of length N, where ith character defines the field of expertise of ith worker, 1 ? i ? N.\n\nThird lines contains M - number of orders.\n\nEach of the next M lines contain an order query S2.\n\nOutput: \n\nFor each order query, print the number of ways Monica can form a team of 3 workers who can prepare the order. \n\nSince the answer can be very large, print it modulo 1000000007 ( 109 + 7 )\n\nConstraints:\n\n1 ? N ? 1000000 \n\nstring S1 will be of length N and will only contain upper case character [V, N, G, T, S, B, P] \n\n1 ? M ? 300000 \n\nstring S2 will be of length 3 and will only contain upper case character [V, N, G, T, S, B, P]", "TESTCASE_1": "11\nVBVNSSTSBGG\n5\nVGS\nNTS\nNGS\nVGS\nVGB\n###---###SEPERATOR---###---\n12\n2\n0\n1\n0", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}