{"Q_ID": "1116210078", "S_NAME": "String", "Q_NAME": "country char", "Q_DESC": "All submissions for this problem are available.\n\nIn the mysterious country of Byteland, everything is quite different from what youd normally expect. In most places, if you were approached by two mobsters in a dark alley, they would probably tell you to give them all the money that you have. If you refused, or didnt have any - they might even beat you up.\n\nIn Byteland the government decided that even the slightest chance of someone getting injured has to be ruled out. So, they introduced a strict policy. When a mobster approaches you in a dark alley, he asks you for a specific amount of money. You are obliged to show him all the money that you have, but you only need to pay up if he can find a subset of your banknotes whose total value matches his demand. Since banknotes in Byteland can have any positive integer value smaller than one thousand you are quite likely to get off without paying.\n\nBoth the citizens and the gangsters of Byteland have very positive feelings about the system. No one ever gets hurt, the gangsters dont lose their jobs, and there are quite a few rules that minimize that probability of getting mugged (the first one is: dont go into dark alleys - and this one is said to work in other places also).\nInput\n\nThe first line contains integer t, the number of test cases (about 100). Then t test cases follow. Each test case starts with n, the number of banknotes in your wallet, and m, the amount of money the muggers asked of you. Then n numbers follow, representing values of your banknotes. Your wallet does not hold more than 20 banknotes, and the value of a single banknote is never more than 1000.\nOutput\n\nFor each test case output a single line with the word Yes if there is a subset of your banknotes that sums to m, and No otherwise. \n", "TESTCASE_1": "5\n3 3\n1\n1\n1\n5 11\n1\n2\n4\n8\n16\n5 23\n1\n2\n4\n8\n16\n5 13\n1\n5\n5\n10\n10\n20 132\n17\n6\n4\n998\n254\n137\n259\n153\n154\n3\n28\n19\n123\n542\n857\n23\n687\n35\n99\n999\n###---###SEPERATOR---###---\nYes\nYes\nYes\nNo\nYes", "TESTCASE_2": "5\n3 3\n1\n1\n1\n5 11\n1\n2\n4\n8\n16\n5 23\n1\n2\n4\n8\n16\n5 13\n1\n5\n5\n10\n10\n20 132\n17\n6\n4\n998\n254\n137\n259\n153\n154\n3\n28\n19\n123\n542\n857\n23\n687\n35\n99\n999\n###---###SEPERATOR---###---\nYes\nYes\nYes\nNo\nYes", "TESTCASE_3": "5\n3 3\n1\n1\n1\n5 11\n1\n2\n4\n8\n16\n5 23\n1\n2\n4\n8\n16\n5 13\n1\n5\n5\n10\n10\n20 132\n17\n6\n4\n998\n254\n137\n259\n153\n154\n3\n28\n19\n123\n542\n857\n23\n687\n35\n99\n999\n###---###SEPERATOR---###---\nYes\nYes\nYes\nNo\nYes", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}