{"Q_ID": "1116310039", "S_NAME": "String", "Q_NAME": "Devu and decorating birthday cake", "Q_DESC": "\"Today is Devus birthday. He has obtained few colored balloons from his friends. You are given this information by a string s consisting of lower case English Latin letters. Each letter (from a to z) denotes a color. e.g. if s = \"\"aab\"\", then it means that he has received two balloons of color a whereas one balloon of color b.\n\nNow, Devu wants to decorate the cake by arranging all the balloons linearly from left to right on the cake such that no same colored balloons are nearby/ adjacent to each other.\n\nNow Devu wonders whether it is possible to do so or not? Please help him in this. If it is not possible to do so, print -1. Otherwise, print any one of arrangements of the balloons on the cake. If there are more than one possible ways of doing so, you can print any one of them.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\nFirst line of each test case will contain string s\nOutput\n\nPrint a single line corresponding to the answer of the problem.\n\nConstraints\n\n1  T  105\n1  size of string s  105\nSum of size of string s over all test cases will be less than or equal to  106\nExample\n\nInput:\n3\naab\nab\naa\nOutput:\naba\nab\n-1\nExplanation\n\nExample case 1. He can arrange the balloons in the order given by the following string \"\"aba\"\".\n\nExample case 2. He can arrange the balloons in the order given by the following string \"\"ab\"\"\n\nExample case 3. There is no valid way of decorating cakes with balloon in the desired way. So we print -1.\"\n", "TESTCASE_1": "3\naab\nab\naa\n\n###---###SEPERATOR---###---\naba\nab\n-1\n", "TESTCASE_2": "4\nabab\naaaaa\nababa\nbababa\n###---###SEPERATOR---###---\nabab\n-1\nababa\nbababa", "TESTCASE_3": "3\nabab\naaaaa\nababa\n\n###---###SEPERATOR---###---\nabab\n-1\nababa", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}