{"Q_ID": "1116210062", "S_NAME": "String", "Q_NAME": "Entangled Strings", "Q_DESC": "\" Chef is now off his restaurant hard-work, but that doesnt mean he is allowed to rest... After all, he will be hosting a dinner to his cousins who came visit him all the way from Gigaland (as we know, Chef lives in Byteland).\n\nOnce they arrived, Chef got a bit worried as he saw that they were bringing along their loud children with them... Besides all the noise, he would even have to cook extra food, so he decided to keep children busy and gave them two strings S1 and S2. He also has an integer L, which he gave to the children as well.\n\nFor a string S=c1 c2 ... cN, let S[a,b] denote ca ca+1 ... cb-1 cb, that is, the substring starting at ath character and ending at bth character. For each 1  i  L, chef wants the children to know how many tuples (a, b, c, d) exist for which S1[a, b] = S2[c, d] and length of S1[a,b] is i.\n\nHopefully Chef will be able to cook in peace now :)\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\nThe first line of each test case contains a the string S1. The second contains the string S2. The third line contains the integer L.\n\nOutput\n\nFor each test case, output a single line containing L space separated integers, where the ith integer is number of common substrings of length i.\n\nConstraints\n\n    1  T  15\n    All strings are composed of characters a-z.\n    length of any string  2*105\n    In any test file, the sum of lengths of all strings is at most 2*106\n\nSubtask 1(15 points)\n\nL = 1\n\nSubtask 2(20 points)\n\nL  10\n\nSubtask 3(15 points)\n\nlength of any string is at most 200\n\nSubtask 4(20 points)\n\nlength of any string is at most 5000\n\nSubtask 5 (30 points): \"\n", "TESTCASE_1": "3\nabab\nbabc\n4\nabcbca\nacccca\n###---###SEPERATOR---###---\n6 3 1 0 \n12 1 0 0 \n12 1 0 0 ", "TESTCASE_2": "3\nab\nba\n4\nabcb\naccc\n###---###SEPERATOR---###---\n2 0 0 0 \n4 0 0 0 \n4 0 0 0 ", "TESTCASE_3": "3\nabc\nbad\n2\nabcb\naccc\n###---###SEPERATOR---###---\n2 0 \n4 0 \n4 0 ", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}