{"Q_ID": "1116310203", "S_NAME": "String", "Q_NAME": "Chef and Two Strings", "Q_DESC": "Chef has found two very old sheets of paper, each of which originally contained a string of lowercase Latin letters. The strings on both the sheets have equal lengths. However, since the sheets are very old, some letters have become unreadable.\n\nChef would like to estimate the difference between these strings. Let's assume that the first string is named S1, and the second S2. The unreadable symbols are specified with the question mark symbol '?'. The difference between the strings equals to the number of positions i, such that S1i is not equal to S2i, where S1i and S2i denote the symbol at the i the position in S1 and S2, respectively.\n\nChef would like to know the minimal and the maximal difference between the two strings, if he changes all unreadable symbols to lowercase Latin letters. Now that you're fully aware of Chef's programming expertise, you might have guessed that he needs you help solving this problem as well. Go on, help him!\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of a test case contains a string S1.\n\nThe second line of a test case contains a string S2.\n\nBoth strings consist of lowercase Latin letters and question marks in places where the symbols are unreadable.\nOutput\n\nFor each test case, output the minimal and the maximal difference between two given strings separated with a single space.\nConstraints\n\n    1  T  100\n    1  |S1|, |S2|  100\n    Subtask 1 (25 points): |S1| = 1\n    Subtask 2 (10 points): neither S1 nor S2 contains unreadable symbols\n    Subtask 3 (65 points): 1  |S1|, |S2|  100\nExplanation\n\nExample case 1. You can change the question marks in the strings so that you obtain S1 = abc and S2 = abb. Then S1 and S2 will differ in one position. On the other hand, you can change the letters so that S1 = abc and S2 = bab. Then, the strings will differ in all three positions.\n\nExample case 2. Change the question marks this way: S1 = dcba, S2 = dcba, then the strings will differ in 0 positions. You can also change the question marks so that S1 = aaaa, S2 = dcba, then the strings will differ in 3 positions.\n\nExample case 3. Change the question marks this way: S1 = aabac, S2 = abaaw, then the strings will differ in 3 positions. Then, change the question marks this way: S1 = xabac, S2 = abayw, then they will differ in 5 positions.\n", "TESTCASE_1": "3\na?c\n??b\n???a\n???a\n?abac\naba?w\n###---###SEPERATOR---###---\n1 3\n0 3\n3 5", "TESTCASE_2": "1\n???a\n???a\n###---###SEPERATOR---###---\n0 3", "TESTCASE_3": "1\na?c\na?c\n###---###SEPERATOR---###---\n0 1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}