{"Q_ID": "1116310027", "S_NAME": "String", "Q_NAME": "Many bananas", "Q_DESC": "You are a tribal leader and live in jungle with your people. Life of the leader is not easy sometimes. One of your responsibilities is food distribution. Lets consider this process in details.\n\nThere are many families in your tribal. Thei-th family consists of Xipeople. In some moment you give each family Y bananas(Y is equal for all families independently of its size). All members of family receive equal number of bananas each and this number is maximal with condition that total number of bananas this family have received doesnt exceed Y. Of course some bananas of these initial Y are left. They are given back to the leader of the tribal(you). In other words each member of family receives floor Y / Xibananas and Y modulo Xi are given back to the leader.\n\n. You are interested in total number of bananas you will have after this distribution process.\n\nBut things are not so simple. There are many events in life of your tribal. You will have to process many queries of three types:\n\nNew family with Ximembers joined your tribal\nSome family with Ximembers left your tribal(its guaranteed that there was such a family before this query).\nYou give each family in your tribal Yj bananas. You want to know the total number of bananas you will have after distribution.\nInput\n\nThe first line of input file contains one integer N denoting number of different family sizes before queries. Each of next Nlines contains two space-separated integers Ai and Bi denoting size of the family and number of families with such size correspondingly. Its guaranteed that all the Ai are pairwise different.\nThe next line contains one integer M denoting the number of queries. Next M lines describe one query each and can be one of the three types:\n\n+ X - one family with X members joined your tribal\n- X - one family with X members left your tribal(its guaranteed that there was such a family before this query).\n? Y - You give each family in your tribal Y bananas. You want to know the total number of bananas you will have after distribution.\nOutput\n\nFor each third type query output one integer per line - answer for this query.\n\nConstraints\n\n0  N  105\n1  M  105\n1  Ai, Bi, Xi, Yi 105\nSubtasks\n\nSubtask #1[25 points]: M  1000\nSubtask #2[75 points]: no additional conditions\n\nExample\n\nInput:\n3\n1 4\n3 2\n2 2\n6\n? 10\n? 8\n+ 4\n? 9\n- 2\n? 8\nOutput:\n2\n4\n3\n4\n", "TESTCASE_1": "3\n1 4\n3 2\n2 2\n6\n? 10\n? 8\n+ 4\n? 9\n- 2\n? 8\n###---###SEPERATOR---###---\n2\n4\n3\n4", "TESTCASE_2": "2\n1 4\n3 2\n4\n? 10\n? 8\n+ 4\n? 9\n###---###SEPERATOR---###---\n2\n4\n1", "TESTCASE_3": "1\n1 4\n2\n? 10\n? 8\n###---###SEPERATOR---###---\n0\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}