{"Q_ID": "1116310028", "S_NAME": "String", "Q_NAME": "Polo the Penguin and the Lucky String", "Q_DESC": "Polo, the Penguin, likes lucky strings - the strings that consist only of lucky digits 4 and 7.\n\nHe has a lucky string S. Digits in this string are numbered from left to right starting with 1. He performs the following operations on the string while it is possible to do so:\n\nFind a set of all positions, P, such that for every position i in P, S[i] = 4 and S[i+1] = 7. (For example, if S = 744744747, then P = {3, 6, 8}.) Add all elements in P to the result. If there is no such position, then STOP.\nErase all digits in string S with positions i and i + 1 for all i in the set P. After erasing all such digits from S repeat Step 1. (For example, the new S = 744)\n \n\nFind the result that he will get at the end.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows. The first line of each test case contains a single integer N denoting the size of the string S. The second line contains the lucky string S.\n\nOutput\n\nFor each test case, output a single line containing the answer to the corresponding test case.\n\nConstraints\n\n1  T  100,000\n1  |S|  100,000\nThe total length of all strings will not exceed 100,000\nExample\n\nInput:\n  2\n  4\n  4747\n  10\n  4447477747\n  \nOutput:\n  4\n  20\n \n\nExplanation\n\nExample case 1. In this case, there is just a single iteration. Since P = {1, 3}, the answer is 1 + 3 = 4.\n\nExample case 2. In this case, there are three iterations. On the first iteration P = {3, 5, 9}. On the second iteration S = 4477, P = {2}. On the third iteration S = 47, P = {1}. So the answer is 3 + 5 + 9 + 2 + 1 = 20.\n", "TESTCASE_1": "2\n4\n4747\n10\n4447477747\n###---###SEPERATOR---###---\n4\n20", "TESTCASE_2": "1\n4\n4747\n###---###SEPERATOR---###---\n4", "TESTCASE_3": "2\n9\n474743445\n3\n324\n###---###SEPERATOR---###---\n4\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}