{"Q_ID": "1116210003", "S_NAME": "String", "Q_NAME": "Finding Dinosaur", "Q_DESC": "Ross and Rachel are on a date. Ross, being the super geek he is, takes Rachel to see dinosaur exhibits. \nEach dinosaur has a name and K attributes which are described by an ordered K-tuple ( A1, A2, A3,..., AK ). Each attribute Ai is an integer between 0 to L inclusive. Ross tells Rachel about N dinosaurs. For each dinosaur, he tells her its name and gives her the K-tuple describing its attributes.\nAfterwards, he wants to play a quiz with Rachel. He gives Rachel Q K-tuples and ask her which dinosaur they belongs to. As Rachel loves Ross and doesnt want him to think she wasnt paying attention, she wants to answer all questions correctly. Help her in this task.\n\nInput:\nThe first line contains N, K, L and Q, the number of dinosaurs, the size of the K-tuple, the maximum value of any attribute and the number of questions that Ross asks.\nN lines follow. The next ith line contains a CSTing which is the name of the ith dinosaur and K space separated integer which are the attributes for the ith dinosaur.\nQ lines follow. The next ith line contains K space separated integer denoting a K-tuple.\n\nOutput:\nFor each question, output the name of the dinosaur that the K-tuple belongs to.\nIt is also possible that Ross is asking a trick question and the tuple doesnt describe any dinosaur. In such a case, output \"You cant fool me :P\" (Quotes are for clarity)\n\nConstraints:\n1<=N<=100000\n1<=K<=5\n1<=L<=15\n1<=Q<=100000\n0<=Ai<=L\n1<=Length of Dinosaurs name<=10\nDinosaurs name will contain only lowercase alphabets [a-z].\n\nNote: \nNo two dinosaurs will have the same K-tuple or name.", "TESTCASE_1": "5 3 9 5\nbaryonyx 5 1 7\njobaria 1 2 3\noviraptor 9 7 1\ntroodon 6 9 5\nminmi 7 4 5\n9 7 1\n1 2 3\n5 8 8\n1 2 3\n7 4 5\n###---###SEPERATOR---###---\noviraptor\njobaria\nYou cant fool me:P\njobaria\nminmi", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "2 1 1 5\nabcdef 0\npqrstu 1\n9\n8\n0\n1\n7\n###---###SEPERATOR---###---\nYou cant fool me:P\nYou cant fool me:P\nabcdef\npqrstu\nYou cant fool me:P", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}