{"Q_ID": "1117310022", "S_NAME": "Functions", "Q_NAME": "MAGIC TRICK", "Q_DESC": " Vidhi went to a magic show last week where she was astounded by a magic trick performed by the great Mandwarf, the brown. His trick was as follows :\n\n    Ask a volunteer from the audience to write down a list L of N integers.\n    Ask another volunteer from the audience to provide three integers A, B, C\n    Ask another volunteer from the audience to provide N length string called S where each letter is either R, A or M\n    Close his eyes for a split second and give the output of The Ancient Algorithm on this input.\n\nWe all know that The Ancient Algorithm is as follows :\n\n\nfor i from 1 to N do \n\n    if ith letter of S is R\n        reverse L[i...N]\n    else if ith letter of S is A\n        add A to all numbers of L[i..N].\n    else if ith letter of S is M\n        multiply B to all numbers of L[i..N].\n\n    for all number in L[i..N], module them by C.\n\n    announce L[i] out loud\n\nend\n\nVidhis boyfriend got jealous when he saw her getting impressed by Mandwarf, the browns wisdom. He wants to learn the trick to gain her undivided admiration. How about you help him?\nConstraints:\n\n1  T  100\n1  N  1000\n0  L[i]  1018\n0  A,B  1018\n2  C  1018\nInput\n\nFirst line contains a single integer T, denoting the number of test cases. Then follow T test case scenarios. Each test case begins with an integer N, the size of the list L. Then in next line, youd find N space separated integers - the list L itself. In next line, thered be three space separated integers A, B, C followed by string S in the next line.\nOutput\n\nFor each test case youve to output N space separated integers - the numbers announced by Mandwarf, the brown. ", "TESTCASE_1": "2\n3\n1 1 1\n2 3 1000\nARM\n4\n1 2 3 4\n0 1 1000\nAMAM\n###---###SEPERATOR---###---\n3 3 9\n1 2 3 4", "TESTCASE_2": "1\n3\n6 3 9\n1 2  200\nARM\n###---###SEPERATOR---###---\n7 10 8", "TESTCASE_3": "1\n3\n6 3 9\n1 2  500\nARM\n###---###SEPERATOR---###---\n7 10 8", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}