{"Q_ID": "1117310016", "S_NAME": "Functions", "Q_NAME": "Jurassic Park", "Q_DESC": "A Jurassic Park consists of a dinosaur museum and a park for safari riding. There are many passengers andn single-passenger cars. Passengers wander around the museum for a while and then line up at the park gate to take a ride in a safari car. Note that each passenger is allowed for one ride only. When a car is available, it loads the one passenger it can hold and rides the park for a specific amount of time say p. If all the n cars are out riding passengers around, then a passenger who wants a ride waits; if a car is ready to load but there are no waiting passengers, then the car waits. After every r units of time one passenger from the museum gets ready to take the safari car ride. Assume that the Jurassic Park is open for k units of time. Write a program to find the status of the passengers and safari cars after k units of time.\nInput                                  \n\nThe input to this program is the total number of safari cars available in the park n (0 <= n <= 50). The number of passengers wandering in the museum m (0 <= m ? 5000) and the number of passengers q (0 <= q <= 100) in the park gate ready to take a ride in the park at time zero. The other inputs are the values of p (1 <= p <= 100), r(1 <= r <= 100) and k (r <= k <= 100000). Note that there can be no negative or fractional inputs.\nInput Format\n\nFirst line contains an integer N (1 <= N <= 100) indicating number of test cases. Each of the following N lines contains input data, separated by single space, for different test cases in the given order:\n\nNo. of Safari Cars, No. passengers in Museum at time zero, No. of passengers at park gate ready for ride at time zero, p\n", "TESTCASE_1": "3\n3 20 5 3 1 10\n2 30 3 3 4 14\n4 15 6 5 2 18\n###---###SEPERATOR---###---\n0 9 10 3\n1 5 27 0\n1 12 6 0", "TESTCASE_2": "5\n1 2 45 66 12 12\n2 3 44 22 33 10\n1 3 4 23 4 1 3\n0 12 3 1 13 12\n9 32 23 2 12 31\n###---###SEPERATOR---###---\n0 0 1 45\n0 0 3 42\n0 0 3 3\n3 12 0 0\n0 0 3 26", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}