{"Q_ID": "1117110053", "S_NAME": "Functions", "Q_NAME": "Friends And Foes", "Q_DESC": "Monk will be organising a party as he recently got a promotion. He wants to invite his childhood classmates. Monk had a total of N classmates and a lot of them were friends with each other. There used to be M1 friendship relations. However, time took its toll and some of them became enemies. A total of M2\n\nenemy relations are formed.\n\nTo avoid any nuisance in his party, Monk wants to invite only Special group of classmates in his party. Special group is the one where each person in the group is a friend of another and there should not be any two persons in that group who are enemies of each other. Now given the relationships among some of them, your task is to find the maximum number of classmates Monk can invite to his party.\n\nNote:\n\n1) Group of friends will be formed only by the given inputs. If given, A\nis a friend of B, B is a friend of C, then A,B,C\n\nforms a friendship group, and you cannot pick a subgroup from it.\n\n2) Two people are said to be friends of each other if their friend relation is given or they are connected through a chain of mutual friends. For example, if given A\nis a friend of B, and B is a friend of C then A and C\n\nare friends.\n\n3) Two people are said to be enemies of each other, only and only if their enemy relation is given. For example, if given A\nis a enemy of B, and B is a enemy of C, then A and C\n\nare not enemies of each other, unless it is given in the input.\n\n4) There wont be any case, where both friend and enemy relation is given for two people.\n\nInput:\nThe first line consists of integer N\n, denoting the number of Monks classmates.\nThe second line consists of integer M1 denoting the number of pair of friends.\nThe next M1 lines consists of two integers of the form A and B who are friends with each other.\nThe next line consists of integer M2 denoting the number of pair of enemies. The next M2 lines consists of two integers of the form A and B\n\nwho are enemies.\n\nOutput:\nPrint in a single line, the maximum number of friends Monk can invite to his party provided they should form a Special group.\n\nConstraints:\n1<=N<=105\n\n1<=M1+M2<=min(2105,N(N1)/2)\n1<=A,B<=N\n\n", "TESTCASE_1": "5\n3\n1 2\n1 3\n4 5\n2\n2 3\n2 4\n###---###SEPERATOR---###---\n2", "TESTCASE_2": "4\n2\n1 2\n2 3\n2\n2 3\n1 3\n###---###SEPERATOR---###---\n1", "TESTCASE_3": "6\n3\n1 2\n1 3\n4 5\n3\n2 3\n2 5\n2 4\n###---###SEPERATOR---###---\n2", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}