{"Q_ID": "1118310014", "S_NAME": "Structures and Unions", "Q_NAME": "Tywins Tactics", "Q_DESC": "Tywin Lannister is a tactical genius. At the heart of his tactical skills, is the way he has organized his armies, and the way he is able to estimate his soldiers skill-levels, thus helping him make crucial decisions as to whom to dispatch to which areas of the war.\n\nHis army is organized in the form of a hierarchy - indeed it is a tree, with him as the root. We say A has immediate superior B if A reports directly to B. We further say A has superior B if there is a chain of soldiers starting with A, ending with B, and where each soldier reports directly to the next soldier of the chain. Further, each soldier is assigned an initial skill-level based on prior experience and battle proficiency.\n\nIn order for Tywin to decide whom to send to which battle, he has the following scheme: He chooses a particular soldier S as the leader of his temporary regiment, and sends in to battle, S as well as all the soldiers that have S as one of their superiors. He estimates the skill level of the regiment as the total skill level of all the soldiers under S (denoted by query Q S).\n\nAfter a battle, he may want to update the skill levels of some soldiers. If he wants to update the skill level of soldier S to value x, it is denoted by the query U S x.\n\nYou are given the structure of the army, whose size is N, the initial skill levels of all the individual soldiers, as well the number of queries M. For each query of the type Q S report the sum of skill-levels of all the soldiers who have S as their superior.\n\nNote: The soldiers are numbered 1 to N, and Tywin is given the number 1.\n", "TESTCASE_1": "5 8\n7 2 0 5 8\n1 2\n2 3\n2 4\n1 5\nQ 1\nQ 2\nU 2 4\nQ 1\nQ 2\nU 5 3\nQ 1\nQ 2\n###---###SEPERATOR---###---\n22\n7\n24\n9\n19\n9", "TESTCASE_2": "10 5\n10 8 2 4 5 7 3 6 9 11\n1 2\n2 4\n5 7\n6 9\n9 11\n10 11\n8 10\n7 8\n3 7\nQ 1\nQ 2\nU 2 4\nU 5 10\n###---###SEPERATOR---###---\n22\n12", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}