{"Q_ID": "1118210007", "S_NAME": "Structures and Unions", "Q_NAME": "Remy paints the fence-CSUE001", "Q_DESC": "Our chef Remy ate all the delicious food he made. As a result, he has become really fat :). Chefs assistant Linguini has taken up the herculean task of bringing back chef Remy to shape. Linguini has built a fence which has N planks in a straight line. The planks are numbered 1 to N from left to right. In front of M of these N planks, he has put a bucket of paint. The paints may be of different colors. Each color is represented by any uppercase letter (A-Z). Chef Remy needs to paint the fence. He uses his painting brush to paint the fence.Chef Remy starts the task by choosing a plank which has a bucket of paint in front of it and dips his brush in the bucket. He starts walking randomly along the straight fence passing the planks. He never moves out of the fence. Note that walking randomly along a fence means that Remy keeps walking all the time along his current direction. He can change his direction any time he wishes. Moving along a straight fence has just two directions, forward and backward.\n\nLinguini has devised the following recipe for painting the fence.\n\nEach bucket has an infinite supply of paint.\n\nThe brush can carry paint of a single color at any time.\n\nWhen Remy passes a paint bucket, the brush acquires the color in the bucket first.\n\nEvery plank that Remy passes in his random walk must be colored with the color in the brush. A plank will be colored completely.\n\nA plank can be colored multiple times. A planks color is the latest color it is painted with.\n\nA fence coloring is complete when each plank is painted with some color. Linguini is watching Remy dance around with colors. He wonders how many different complete fence colorings will he be able to see. Two fence colorings are different if there is atleast one plank numbered x whose color differs in both the colorings. Find out the number of different complete fence colorings modulo 1000000009.\n\nInput\n\nFirst line contains T, the number of test cases. T test cases follow. The first line of each case contains N and M separated by a space. Next M lines follow each of the form x and y separated by a space. Here x is the color in the bucket which is placed at plank numbered y.\n\nConstraints\n\n1 <= T <= 10\n\n1 <= N <= 100000\n\n1 <= M <= N\n\nx will be an uppercase letter between A to Z\n\n1 <= y <= N\n\nOutput\n\nThe number of different complete fence colorings modulo 1000000009 for each case on a new line.", "TESTCASE_1": "3\n2 1\nR 1\n3 1\nA 2\n6 2\nA 2\nB 6\n###---###SEPERATOR---###---\n1\n1\n4", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}