{"Q_ID": "1118310003", "S_NAME": "Structures and Unions", "Q_NAME": "The Guessing Game", "Q_DESC": "Alice and Johnny are playing a simple guessing game. Johnny picks an arbitrary positive integer n (1=n=109) and gives Alice exactly k hints about the value of n. It is Alices task to guess n, based on the received hints.\nAlice often has a serious problem guessing the value of n, and shes beginning to suspect that Johnny occasionally cheats, that is, gives her incorrect hints. After the last game, they had the following little conversation:\n[Alice] Johnny, you keep cheating!\n[Johnny] Indeed? You cannot prove it.\n[Alice] Oh yes I can. In fact, I can tell you with the utmost certainty that in the last game you lied to me at least *** times.\nSo, how many times at least did Johnny lie to Alice? Try to determine this, knowing only the hints Johnny gave to Alice.\n \nInput\nThe first line of input contains t, the number of test cases (about 20). Exactly t test cases follow.\nEach test case starts with a line containing a single integer k, denoting the number of hints given by Johnny (1=k=100000). Each of the next k lines contains exactly one hint. The i-th hint is of the form:\noperator li logical_value\nwhere operator denotes one of the symbols  ,  , or =; li is an integer (1=li=109), while logical_value is one of the words: Yes or No. The hint is considered correct if logical_value is the correct reply to the question: Does the relation: n operator li hold?, and is considered to be false (a lie) otherwise.\n\nOutput\n\nFor each test case output a line containing a single integer, equal to the minimal possible number of Johnnys lies during the game.", "TESTCASE_1": "3\n2\n 100 No\n 100 No\n3\n 2 Yes\n 4 Yes\n= 3 No\n6\n 2 Yes\n 1 Yes\n= 1 Yes\n= 1 Yes\n 1 Yes\n= 1 Yes\n###---###SEPERATOR---###---\n0\n1\n2\n", "TESTCASE_2": "2\n2\n 100 No\n 100 No\n3\n 2 Yes\n 4 Yes\n= 3 No\n###---###SEPERATOR---###---\n0\n1", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}