{"Q_ID": "1119310015", "S_NAME": "Pointers", "Q_NAME": "Sereja and Sorting 2", "Q_DESC": "Sereja has an array A[1 .. N], which contains N integers. Now Sereja wants to sort it.\nThe only thing that Sereja can do, is to reverse all elements in some sub-array, which is a consecutive parts of A. In other words, in one operation, Sereja can choose two integers L and R (1 = L  R = N), and swap elements A[L] and A[R], A[L+1] and A[R-1], A[L+2] and A[R-2] and so on.\n\nIn such operation of L, R, the total energy that Sereja spends R - L + 1. Clearly, Sereja wants to minimize the spent energy. Also, Sereja would like to minimize the total number of all operations. Therefore, we give a mixed objective as shown in Scoring.\n\nInput\n\nFirst line contains an integer N. Next line contains a sequence of integers A[1], A[2], A[3], ..., A[N].\n\nOutput\n\nFirst line contains an integer Q - the total number of operations you need to sort the array. In each of next Q lines, there should be two integers L and R (1 = L  R = N) indicate the operation that Sereja should do.\n\nAlso you should remember, that Q shouldnt be greater than N.\n\nScoring\n\nSuppose S is the total spent energy of your output, i.e. the sum of R - L + 1 of all operations. Your score is S / N + Q. Lower scores will earn more points.\n\nWe have 40 official test files. You must correctly solve all test files to receive OK. During the contest, your overall score is the sum of the scores on the first 10 test files. After the contest, all solutions will be rescored by the sum of the scores on the rest 10 test files. Note, that public part of the tests may not contain some border cases.\n\nConstraints\n\n1 = N = 10000\n1 = A[i] = 5000", "TESTCASE_1": "6\n2 1 5 4 3 2\n###---###SEPERATOR---###---\n2\n3 6\n1 2", "TESTCASE_2": "5\n2 3 4 2 1\n###---###SEPERATOR---###---\n2\n1 5\n3 5", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}