{"Q_ID": "1119310038", "S_NAME": "Pointers", "Q_NAME": "Call Center Schedule", "Q_DESC": "Chef is working as a manager of a call center. He has a large number of empoyees in his team. Each of them spends their time participating in meetings, talking to clients over the phone, and a few other activities related to the job.\n\nEach person can spend an hour either in a meeting, talking to clients, or working on their project. Each hour must be dedicated to only one activity and in a single hour, a person cannot switch activities.\n\nThere are D business days in the week, numbered 1 to D. Person i can spend at most Li hours per week talking to clients. For each person, it is known which hours in their schedule are taken up by meetings.\n\nThe call center responds to client for H hours per day, which, for simplicity, are numbered 1 through H.\n\nFor each hour in the week, the number of clients connecting to the call center for that hour is known. So, Chef knows that he needs exactly Ri,j people talking with clients during the day i and hour j.\n\nFk, i, j is equal to 1 if person k is available to talk to clients during hour j of day i and 0 if they have a meeting during that time.\n\nPlease note that Chef lives in an alien world, which may not have 24 hours in a day or 7 days in a week.\n\nChef needs to create a schedule for each person. Remember that there is a lunch period every day, from LTbegin to LTend hours, both inclusive , so please make sure that each person will have at least one hour of free time during the designated lunch period.\n\nIf some person doesnt have a meeting during an hour and they dont talk to a client as well during that hour, they can work on a corporate project and this hour will count as a working hour. Alternatively, they may spend this time working on a personal project and it will not count as a working hour.\n\nPlease help Chef find out if it is possible to create a schedule such that following conditions hold.\n\n    Each person spends at most N hours per day being on meetings and speaking with clients.\n    Each person spends at most Li hours per week talking to clients.\n    Each person has at least one hour during the lunch time free of client calls as well as meetings.\n    For each hour j on the day i, there are exactly Ri,j people free to talk to clients.\n\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each test case input contains four space-separated integers  P, D, H and N  denoting the number of people in the team, number of working days in a week, number of hours the call center works in a day, and the number of working hours per day for people respectively.\n\nThe next line contains P space-separated integers, where the ith integer denotes Li.\n\nThe next line contains two space-separated integers LTbegin and LTend. The first integer denotes the first hour of the designate lunch period, and the second denotes its last hour.\n\nNext D lines contain H space-separated integers each. The jth integer of line i denotes Ri,j.\n\nNext P blocks of lines will contain D lines each, with a line containing H space-separated integers. The jth integer of line i of block k denotes Fk,i,j.\nOutput\n\nFor each test case in a single line output Yes (without quotes) if its possible to create a schedule and No (without quotes) otherwise.\nConstraints\n\n    1  T  5\n    1  N  H  MAX\n    1  D  MAX\n    1  P  MAX\n    1  Li  N*D\n    0  Ri,j  15\n    0  Fk,i,j  1\n    1  LTbegin, LTend  N\n\nSubtasks\n\n    Subtask #1 [15 points]: MAX = 3\n    Subtask #2 [25 points]: MAX = 10\n    Subtask #3 [60 points]: MAX = 70", "TESTCASE_1": "2\n2 2 3 2\n4 1\n2 3\n0 1 1\n0 1 0\n1 1 1\n1 1 1\n1 1 1\n1 0 1\n2 2 3 2\n4 1\n2 3\n0 1 2\n0 1 0\n1 1 1\n1 1 1\n1 1 1\n1 0 1\n###---###SEPERATOR---###---\nYes\nNo", "TESTCASE_2": "2\n2 2 3 2\n4 1\n2 3\n0 1 1\n0 1 0\n1 1 1\n1 1 1\n1 1 1\n1 0 1\n2 2 3 2\n4 1\n2 3\n0 1 2\n0 1 0\n1 1 1\n1 1 1\n1 1 1\n1 0 1\n###---###SEPERATOR---###---\nYes\nNo", "TESTCASE_3": "2\n2 2 3 2\n4 1\n2 3\n0 1 1\n0 1 0\n1 1 1\n1 1 1\n1 1 1\n1 0 1\n2 2 3 2\n4 1\n2 3\n0 1 2\n0 1 0\n1 1 1\n1 1 1\n1 1 1\n1 0 1\n###---###SEPERATOR---###---\nYes\nNo", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}