{"Q_ID": "1120310052", "S_NAME": "Practice Session", "Q_NAME": "GIFTS", "Q_DESC": "Tom s girlfriend, Chief, is displeased with him. This is not a good sign for their\nrelationship, and as always, he has turned to you for help. He looks forward to take his girlfriend to shopping;\noffering her to buy K gifts. The shop that he is taking her to has N unique items, that is,\nthere is single quantity of each item (its a very special shop, you see!).\n\nTom has with him, K discount coupons that he wishes to use. The shops policy\nonly allows Tom to use one discount coupon on any one purchased item. That is why Tom is letting Chief buy K\ngifts; he intends to use each coupon with him.\n\nTom of course cannot stop Chief from buying whatever she likes. Chief would select any K\ngifts, from among the N items that the shop has. She makes selection of any K out of N items, uniformly. Suppose,\nthere are 5 items and Tom lets Chief buy 3, then she selects any of the 3 out of 5 items with the probability 1/10.\n\nAfter Chief selects the items she wishes to buy, Tom will have to pay the bill. Smart as he\nis, he would apply the K discount coupons on the K items (one on each) such that the discount he receives is as large\nas possible.\n\nTom wants to prepare himself for this day. He knows beforehand the price of each item\nin the shop. Can you tell him what expected discount can he expect? You have to tell him the expected discount\nin the amount of money he can expect to save.\n\nInput format\n\nThe first line contains the number T, the number of test cases. In the following lines,\nT test cases follow (without any newlines between them.)\nEach case consists of only 3 lines.\nThe first line of each test case contains N and K, separated by a single space.\nThe second line contains N positive integers, the prices of the N items respectively, separated by a single space.\nThe third line contains K positive integers (between 1 and 100, inclusive) separated by a single space. They represent\nthe percentage of discount offered by the coupons, that Tom has, respectively.\n\nOutput format\n\nFor each test case, print the expected amount of money Tom should expect to save.\nOutput the result rounded to 3 digits after the decimal.\n\nConstraints\n\n1 = T = 50\n1 = N = 1000\n1 = K = N\n1 = prices = 10000\n", "TESTCASE_1": "2\n3 2\n100 200 300\n10 20\n4 3\n100 200 300 400\n10 20 30\n###---###SEPERATOR---###---\n66.667\n175.000", "TESTCASE_2": "2\n3 2\n400 500 600\n10 20\n4 3\n200 300 400 500\n10 20 30\n###---###SEPERATOR---###---\n156.667\n235.000", "TESTCASE_3": "2\n3 2\n300 500 700\n10 20\n4 3\n200 400 600 800\n10 20 30\n###---###SEPERATOR---###---\n163.333\n350.000", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}