{"Q_ID": "1120310042", "S_NAME": "Practice Session", "Q_NAME": "Kitchen rules", "Q_DESC": "There are N students living in the dormitory of Berland State University. Each of them sometimes wants to use the kitchen, so the head of the dormitory came up with a timetable for kitchens usage in order to avoid the conflicts:\n\n    The first student starts to use the kitchen at the time 0 and should finish the cooking not later than at the time A1.\n    The second student starts to use the kitchen at the time A1 and should finish the cooking not later than at the time A2.\n    And so on.\n    The N-th student starts to use the kitchen at the time AN-1 and should finish the cooking not later than at the time AN\n\nThe holidays in Berland are approaching, so today each of these N students wants to cook some pancakes. The i-th student needs Bi units of time to cook.\n\nThe students have understood that probably not all of them will be able to cook everything they want. How many students will be able to cook without violating the schedule?\nInput\n\nThe first line of the input contains an integer T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each test case contains a single integer N denoting the number of students.\n\nThe second line contains N space-separated integers A1, A2, ..., AN denoting the moments of time by when the corresponding student should finish cooking.\n\nThe third line contains N space-separated integers B1, B2, ..., BN denoting the time required for each of the students to cook.\nOutput\n\nFor each test case, output a single line containing the number of students that will be able to finish the cooking.\nConstraints\n\nShould contain all the constraints on the input data that you may have. Format it like:\n\n    1<=T<=10\n    1<=N<=104\n    0 < A1 < A2 < ... < AN < 109\n    1<=Bi<=109 ", "TESTCASE_1": "2\n3\n1 10 15\n1 10 3\n3\n10 20 30\n15 5 20\n###---###SEPERATOR---###---\n2\n1", "TESTCASE_2": "2\n2\n1 7 \n2 9\n3\n2 4 5\n###---###SEPERATOR---###---\n\n0\n2", "TESTCASE_3": "1\n4\n2 3 8 1\n2 1 3 4\n###---###SEPERATOR---###---\n3\n", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}