{"Q_ID": "1120210010", "S_NAME": "Practice Session", "Q_NAME": "Bread", "Q_DESC": "Some chefs go for a tour lasting N days. They take packages of bread for food. Each package has K pieces of breads. On the ith day, they eat Ai pieces of bread.\n\nUnfortunately, chefs are very lazy people, and they always forget to close the package of breads, so each day the last piece of bread becomes exposed to mold (a fungus), and is no longer suitable for eating. Such a bad piece is not eaten, and is instead thrown away.\n\nLet us take an example. If K = 4 and N = 3, then A = {3, 1, 2}. Chefs have packages of bread each having 4 pieces of bread, and their travel lasts 3 days. In the first day, they must eat 3 pieces of bread. So they open new package of bread and eat 3 pieces. They forget to close the package, so the 4th piece becomes bad. In the next day, they want to eat one piece of bread. And in the first package we dont have any good pieces of bread left, so they open a new package of bread and eat one piece from that. On the 3rd day, they want to eat 2 pieces of bread. In the second package, we have three pieces, and one of them is bad; so we have 2 good pieces. They eat 2 pieces from this package. So they must buy 2 packages of bread.\n\nPlease help chefs in finding out the minimum number of packages of breads they should take with them on the tour.\n\nInput\n\nThe first line of input contains a single integer T denoting the number of test cases.\nThe first line of each test contains two space separated integers N and K.\nThe next line of each test case contains N space separated integers denoting the number of pieces of bread the chefs want to eat each day.\nOutput\n\nFor each of the T test cases, output a single line - minimum number of packages of bread the chefs should take.      Explanation\n\nTest case 1 has already been explained in the statement.\n\nIn test case 2, we have one day tour and packages with one piece each. In the first day, we have to eat one piece of bread, so we open a package and eat one piece. Tour ended, and our answer is 1.\n\nIn test case 3, we have a two days tour, and packages with 4 pieces of bread each. In the first day, we have to eat 8 pieces. We need to open two packages and eat all the pieces. In the second day, we have to eat 8 pieces again. We open two packages and eat all pieces. Tour ended. Answer is 4.", "TESTCASE_1": "3\n3 4\n3 1 2\n1 1\n1\n2 4\n8 8\n###---###SEPERATOR---###---\n2\n1\n4", "TESTCASE_2": "1\n5 6\n3 2 3 5 1\n###---###SEPERATOR---###---\n3", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}