{"Q_ID": "1120310041", "S_NAME": "Practice Session", "Q_NAME": "MagicElephant", "Q_DESC": "The Little Elephant from the Zoo of Lviv believes in magic.\nHe has a magic board A that consists of N rows and M columns. Each cell of the board contains an integer from 0 to 9 inclusive. The cell at the intersection of the i-th row and the j-th column is denoted as (i; j), where 1<=i<=N and 1<=j<=M. The number in the cell (i; j) is denoted as A[i][j].\n\nThe Little Elephant owns the only magic operation which can be described as follows. He chooses some integer P and some row or column, after that for each cell in the chosen row or column he adds number P to the number in this cell and take the result modulo 10 in order to keep numbers in the range {0, 1, ..., 9}. Our Little Magician wants to perform series of such operations to achieve some board for which certain characteristic called level of the board is maximal possible.\n\nSo what is the level of the board? Bluntly speaking it is the length of the longest non-increasing subsequence of cells of the board. Formally, the level of the board is the maximal integer K such that there exists such sequence of different cells (i1; j1), (i2; j2), ..., (iK; jK) for which\n\n1<=i1<=...<=iK<=N,\n1<=j1<=...<=jK<=M,\n\nand\n\nA[i1][j1]  A[i2][j2]  ...  A[iK][jK].\n\nThough, the magic operation, the Little Elephant owns, is quite powerful, there are some restrictions dictated by the Association of Cursed Magicians (ACM):\n\n    The number P should be chosen in advance and should be the same for all operations.\n    For each row the magic operation can be applied at most once.\n    The same, of course, is true for columns.\n\nWithout these stupid restrictions of this stupid Association our hero could always achieve the maximal possible level M + N  1. But now he is confused and asks you for help. Find the maximal level of the board A after making arbitrary number of magic operations according to the restrictions of ACM.\nInput\n\nThe first line of the input contains a single integer T, the number of test cases. Then T test cases follow. The first line of each test case contains two space separated integers N and M, the sizes of the board. Each of the following N lines contains M one-digit numbers without spaces. The i-th line among them contains the numbers A[i][1], ..., A[i][M].\nOutput\n\nFor each test case output a single line containing a single integer, the maximal possible level of the board that Little Elephant can achieve under the restrictions of ACM.\nConstraints\n\n1<=T<=10\n1<=N<=100\n1<=M<=100\n0<=A[i][j]<=9 ", "TESTCASE_1": "2\n2 2\n11\n10\n3 4\n3478\n4268\n7173\n###---###SEPERATOR---###---\n3\n5", "TESTCASE_2": "1\n3 3\n123\n234\n456\n###---###SEPERATOR---###---\n4\n", "TESTCASE_3": "3\n2 3\n567\n123\n3 2\n12\n67\n97\n1 4\n2154\n###---###SEPERATOR---###---\n4\n4\n4\n ", "TESTCASE_4": "1\n4 4\n2345\n1987\n4356\n2897\n###---###SEPERATOR---###---\n7", "TESTCASE_5": "0 ###---###SEPERATOR---###--- 0"}