{"Q_ID": "1611110032", "S_NAME": "Searching Techniques", "Q_NAME": "Searching 3", "Q_DESC": "The grandest stage of all, Wrestlemania XXX recently happened. And with it, happened one of the biggest heartbreaks for the WWE fans around the world. The Undertaker's undefeated streak was finally over.\n\nNow as an Undertaker fan, you're disappointed, disheartened and shattered to pieces. And Little Jhool doesn't want to upset you in any way possible. (After all you are his only friend, true friend!) Little Jhool knows that you're still sensitive to the loss, so he decides to help you out.\n\nEvery time you come across a number, Little Jhool carefully manipulates it. He doesn't want you to face numbers which have \"21\" as a part of them. Or, in the worst case possible, are divisible by 21.\n\nIf you end up facing such a number you feel sad... and no one wants that - because you start chanting \"The streak is broken!\" , if the number doesn't make you feel sad, you say, \"The streak lives still in our heart!\"\n\nHelp Little Jhool so that he can help you!\n\nInput Format:\nThe first line contains a number, t, denoting the number of test cases.\nAfter that, for t lines there is one number in every line.\n\nOutput Format:\nPrint the required string, depending on how the number will make you feel.", "TESTCASE_1": "3\n120\n121\n231\n###---###SEPERATOR---###---\nThe streak lives still in our heart!\nThe streak is broken!\nThe streak is broken!", "TESTCASE_2": "4\n69521\n7484\n78175\n86424\n###---###SEPERATOR---###---\nThe streak is broken!\nThe streak lives still in our heart!\nThe streak lives still in our heart!\nThe streak lives still in our heart!", "TESTCASE_3": "3\n223\n654\n898\n###---###SEPERATOR---###---\nThe streak lives still in our heart!\nThe streak lives still in our heart!\nThe streak lives still in our heart!", "TESTCASE_4": "4\n334\n666\n121\n778\n###---###SEPERATOR---###---\nThe streak lives still in our heart!\nThe streak lives still in our heart!\nThe streak is broken!\nThe streak lives still in our heart!", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}