{"Q_ID": "1613210002", "S_NAME": "Divide and Conquer", "Q_NAME": "AltF4 and the beetles", "Q_DESC": "It is a nice winter Sunday morning and AltF4, our hero, decides to play a new video game. The game is called Appearism. There are a total of N beetles in the game that are initially peeping out of the grooves to look for a chance to tease you.Each one appears out of their groves at an absolute time Pi, tease AltF4 for a time duration and then go back to their groves and sleep forever at time Qi.\n\nAltF4 has just got one shot of the nuclear weapon that ha can use to destroy all the beetles. Being very clever, he has noted down the (Pi, Qi) for each of the beetles. He also observed that the beetles are hurt by a amount A when they are looking for a chance to tease you in the groove (i.e. when time is  Pi), by B when they are out of their grooves teasing you (between Pi, Qi) and by C when they are back into the grooves and sleeping forever (when time is  Qi). Obviously B is always greater than both A and C. AltF4 being poor in math and computing asks you for favor.\n\nInput  Output\n\nThe first line contains the number of times AltF4 plays the game T. Then the description of T games follow. In each game description, the first line contains four space separated integers N A B C. Then N lines follow with two space separated integers P Q, the recorded value of their hideouts. Each Q will always be  corresponding P\n\nNOTE : Large Input files. Use faster IO.\nFor each test game, you are to print one number in a line, the maximum destruction that AltF4 can achieve. Remember that he may use the nuclear gun only at one instant of time.\n\nConstraints\nT  50\n1  N  20000\n0  P, Q, A, B, C  10^9", "TESTCASE_1": "1\n1 5 4 2\n3 4\n5 5\n6 6\n###---###SEPERATOR---###---\n4", "TESTCASE_2": "2\n2 1 5 3\n3 4\n4 5\n3 1 5 3\n3 4\n5 5\n6 6\n###---###SEPERATOR---###---\n10\n11\n", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}