{"Q_ID": "1613110003", "S_NAME": "Divide and Conquer", "Q_NAME": "Monk's School.", "Q_DESC": "Today is the 25th anniversary of Berland International School in Berland. On this auspicious Occasion, our friend Monk has been given the responsibility of preparing the Inventory for his school.\nThere are exactly N teachers and M students in the school. Each of these teachers teaches arbitary number of students. However, each student is taught by exactly one teacher.\n\nMonk has been given the task of finding out for each teacher the Students he/she teaches. For each student Monk has been given the Student's Name and Age. However , Monk is too busy , So he has assigned this task to us.\n\nWe need to print the name of the Teacher and the Name and age of the students that he/she teaches.  However, there is a catch here. We need to print the list of students of each Teacher in Lexicographical order of their names . That is list of the teacher with lexicographically smaller name will appear before other teachers with lexicographically greater names.\n\nIn Addition , The students appearing in a particular teachers list should appear in Increasing order of their Age.\n\nInput Format :\n\nThe first line contains two integers N and M denoting the number of Teachers and number of Students respectively. Each of the next N lines contain a single string denoting a Teachers name.It is guaranteed that each teachers name shall be unique. \nThe next  M lines contain 2 Strings and an Integer, denoting the Teachers name, a Student's name being taught by that Teacher and that Student's Age. It is guaranteed that each Student's name shall be unique and shall appear only once in the Input.\n\nOutput Format:\n\nPrint N+M lines . Print the teachers name first and then the name and age of each student taught by this teacher. The list of each teacher should appear in order of their lexicographical rank in comparison to all other teachers. \n\nFor example the list of the teacher with lexicographically smallest name should appear first, then the list of the teacher with the 2nd smallest lexicographical name and so on. The students in a particular teachers list should appear in the output in Increasing order of their Age.\n\nConstraints:\n1<=N<=100\n1<=M<=10^5\n1<=Age of Each Student<=106\n1<=Length of each Student and Teachers  Name <=35\n\nThe Name of Each Teacher and Student will consist of Lowercase English Alphabets only.\n\nIt is guaranteed that no two students with the same age shall appear in the same Teacher's List.\n\nHint : You Need to Use Comparable Interface Here.", "TESTCASE_1": "3 4\nvasya\npetya\nkolya\nvasya errichto 21\nkolya petr 22\npetya egor 19\nvasya tourist 19\n###---###SEPERATOR---###---\nkolya\npetr 22\npetya\negor 19\nvasya\ntourist 19\nerrichto 21", "TESTCASE_2": "3 3\ncat\ngod\ndog\ncat e 2\ngod ee 5\ndog eee 9\n###---###SEPERATOR---###---\ncat\ne 2\ndog\neee 9\ngod\nee 5", "TESTCASE_3": "5 4\nraya\ndiva\nperu\ncate\nlillu\nperu errichto 21\ncate petr 22\ndiva egor 19\nlillu tourist 19\n###---###SEPERATOR---###---\ncate\npetr 22\ndiva\negor 19\nlillu\ntourist 19\nperu\nerrichto 21\nraya", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}