{"Q_ID": "1613110004", "S_NAME": "Divide and Conquer", "Q_NAME": "Match makers", "Q_DESC": "Little Mojo owns a match making company, which even to her surprise is an extreme hit. She says that her success rate cannot be matched (Yeah, wordplay!) in the entire match-making industry. She follows an extremely simple algorithm to determine if two people are matches for each other. Her algorithm is not at all complex, and makes no sense - not even to her. But she uses it anyway.\n\nLet's say say that on a given day she decides to select n people - that is, n boys and n girls. She gets the list of n boys and n girls in a random order initially. Then, she arranges the list of girls in ascending order on the basis of their height and boys in descending order of their heights. A girl Ai can be matched to a boy on the same index only, that is, Bi and no one else. Likewise, a girl standing on Ak can be only matched to a boy on the same index Bk and no one else.\n\nNow to determine if the pair would make an ideal pair, she checks if the modulo of their heights is 0, \n\ni.e., Ai % Bi == 0 or Bi % Ai == 0. Given the number of boys and girls, and their respective heights in non-sorted order, determine the number of ideal pairs Mojo can find.\n\nInput format:\nThe first line contains number of test cases. Then, the next line contains an integer, n, saying the number of boys and girls. The next line contains the height of girls, followed by the height of boys.\n\nOutput format:\nPrint the number of ideal pairs corresponding to every test case.\n\nConstraints:\n1 <= Test Cases <= 10^2\n1 <= N <= 10^4 \n1 <= A i , B i <= 10^5", "TESTCASE_1": "1\n3\n2 2 2\n2 2 2\n###---###SEPERATOR---###---\n3", "TESTCASE_2": "2\n4\n1 6 9 12\n4 12 3 9\n4\n2 2 2 2\n2 2 2 2\n###---###SEPERATOR---###---\n2\n4", "TESTCASE_3": "4\n3\n5 8 9\n3 6 1\n3\n7 9 12\n10 6 4\n2 3 1\n8 9 8\n3\n2 6 9\n3 8 12\n4 2 6\n3\n1 2 3\n5 6 7\n3 2 1\n\n###---###SEPERATOR---###---\n1\n1\n1\n5", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}