{"Q_ID": "1613210006", "S_NAME": "Divide and Conquer", "Q_NAME": "Fredo and Modified Notifications System", "Q_DESC": "Frustrated of getting notifications frequently on his mobile, Fredo decided to systemize it. He has N apps in his phone , each identified by its index (1indexN) and has some priority associated with it.The notification coming from an app has the same priority as the app.\nHe decides to read the notifications only when it is 1 o'clock , 2 o' clock and so on. That means, he would read the notifications maximum 24 times a day.\nBetween two consecutive hours (interval) , all the notifications that come from the apps are accumulated in a queue (an app can send multiple notifications). WIthin this time, he can also change the priority of few apps.\nFredo wants all notifications coming from an app to be merged into one notification , the position of this notification in the queue would be the position of the first notification coming from the app. All other notifications from that app are then removed from the queue.\nWhen it is time for him to read the notifications, he wants all the notifications to be displayed according to their priority. If two notifications from different apps have same priority, he wants the app whose notification comes first in the queue to be displayed first. \nHe knows you are good at doing this stuff. So, he asks you to do this task for him .\n\nInput:\nThe first line consists of an integer N, denoting the number of apps.\nNext line consists of an array of priorities of apps. Priority[i] is the priority of app with index i. \nNext line consists of an integer T, denoting the number of intervals for which the data is given.\nIn each interval,\nThe first line consists of two integers Q and U, denoting the number of notifications in the queue and number of priority updates respectively.\nThe next line consists of Q space separated integers denoting the queue for that interval.Let this queue be represented by array \nQueue. Queue[i] is the app index from which notification is coming.\nThe next U lines consists of two integers J and P each, the first representing the app index and the second representing the new priority for that app.\nNote : Any priority update in any interval will reflect in all the further intervals.\nOutput:\nYou have to print the order of display of the notifications after each interval in a new line. The display has to be done in non-increasing order of priority.\n\nConstraints:\n1N100\n1Priority[i]100; \n1iN\n1T24\n0Q500\n0U100\n1Queue[i]N; \n1iQ\n1JN\n1P100.", "TESTCASE_1": "10\n10 3 10 2 3 3 7 8 7 10\n1\n4 1\n2 9 3 4\n8 8\n###---###SEPERATOR---###---\n3 9 2 4 ", "TESTCASE_2": "10\n2 3 4 2 1 10 5 6 4 7\n2\n7 3\n1 4 3 1 7 2 4\n6 5\n3 2\n4 3\n5 0\n7 6 2 4 2\n###---###SEPERATOR---###---\n7 4 2 1 3 \n7 6 2 4 ", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}