{"Q_ID": "1613310004", "S_NAME": "Divide and Conquer", "Q_NAME": "Closest Pair ", "Q_DESC": "We are given an array of n points in the plane, and the problem is to find out the closest pair of points in the array. This problem arises in a number of applications. For example, in air-traffic control, you may want to monitor planes that come too close together, since this may indicate a possible collision.          Algorithm\nFollowing are the detailed steps of a O(n (Logn)^2) algortihm.\nInput: An array of n points P[]\nOutput: The smallest distance between two points in the given array.\n\nAs a pre-processing step, input array is sorted according to x coordinates.\n\n1) Find the middle point in the sorted array, we can take P[n/2] as middle point.\n\n2) Divide the given array in two halves. The first subarray contains points from P[0] to P[n/2]. The second subarray contains points from P[n/2+1] to P[n-1].\n\n3) Recursively find the smallest distances in both subarrays. Let the distances be dl and dr. Find the minimum of dl and dr. Let the minimum be d.                                 \n\n4) From above 3 steps, we have an upper bound d of minimum distance. Now we need to consider the pairs such that one point in pair is from left half and other is from right half. Consider the vertical line passing through passing through P[n/2] and find all points whose x coordinate is closer than d to the middle vertical line. Build an array strip[] of all such points.                        \n\n5) Sort the array strip[] according to y coordinates. This step is O(nLogn). It can be optimized to O(n) by recursively sorting and merging.\n\n6) Find the smallest distance in strip[]. This is tricky. From first look, it seems to be a O(n^2) step, but it is actually O(n). It can be proved geometrically that for every point in strip, we only need to check at most 7 points after it (note that strip is sorted according to Y coordinate). See this for more analysis.\n\n7) Finally return the minimum of d and distance calculated in above step (step 6)", "TESTCASE_1": "4\n10 20\n5 1 \n2 10\n3 4\n###---###SEPERATOR---###---\nThe smallest distance is 3.605551", "TESTCASE_2": "6\n2 3\n12 30\n40 50\n5 1 \n12 10\n3 4\n###---###SEPERATOR---###---\nThe smallest distance is 1.414214", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}