{"Q_ID": "1613210001", "S_NAME": "Divide and Conquer", "Q_NAME": "Write a checker !", "Q_DESC": "Given the database of ABC company, this database contains a table Users. This users table stores for each user 4 pieces of information i.e their Name, Age, Hometown and Address in this order. The size of this table is rather large, and you need to help in resolving some issues.\n\nABC company is suspicious that this Users table contains many redundant entries. An entry is considered to be redundant if for any 2 separate entries in the table entry i and j, such that i not equal to j, (Name i=Name j) or (Age i=Age j) or (Address i = Address j) or (Hometown i= Hometown j).\n\nNow, you need to help ABC company, and write for them a checker, that handles the following :\n\nIt should be able to detect all pairwise redundant entries.\n\nFor each pairwise redundant entries i and j, you need to print a new line to output with 2 space separated integers i and j. (The entries are indexed starting from one). 2 entries (i,j) and (x,y) are considered to be pairwise distinct, if i not equal x or i not equal y, or j not equal x or j not equal y.\n\nInput Format :\n\nThe first line contains a single integer N denoting the number of entries in the Users table. Each of the next N lines contains 4 space separated tokens mentioned above.\n\nOutput Format :\n\nOn the first line, print a single integer K, i.e the number of redundant entries present in the Users table. On each of the next K lines. print 2 space -separated integers i and j, denoting that entry i and j are pairwise redundant.\n\nConstraints :\n1<= N <= 2*10^3\n1<= |Name i|,|Hometown i|,|Address i|<=5\n1<=Age i<=100\n\nInput Strings shall consist only of lowercase English alphabets. You can print the entries in any order.", "TESTCASE_1": "3\np 12 c d\nq 13 d e\nr 12 f k\n###---###SEPERATOR---###---\n1\n1 3", "TESTCASE_2": "4\na 12 c d\nb 13 d e\nd 12 f k\nzz 13 m co\n###---###SEPERATOR---###---\n2\n1 3\n2 4", "TESTCASE_3": "7\ne 12 r t\nf 9 t y\nd 13 r b\na 10 d f\ne 5 c b\nh 8 d w\nz 33 d f\n###---###SEPERATOR---###---\n6\n1 3\n1 5\n3 5\n4 6\n4 7\n6 7", "TESTCASE_4": "4\nb 7 d s\nh 11 f d\nz 33 d f\ng 22 dd e\n\n###---###SEPERATOR---###---\n1\n1 3", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}