{"Q_ID": "1614310007", "S_NAME": "Greedy Algorithm", "Q_NAME": "Fighting Pits", "Q_DESC": "Meereen is famous for its fighting pits where fighters fight each other to the death.\n\nInitially, there are n fighters and each fighter has a strength value. The n fighters are divided into k teams, and each fighter belongs exactly one team. For each fight, the Great Masters of Meereen choose two teams, x and y, that must fight each other to the death. The teams attack each other in alternating turns, with team x always launching the first attack. The fight ends when all the fighters on one of the teams are dead.\n\nAssume each team always attacks optimally. Each attack is performed as follows:\n\n1.The attacking team chooses a fighter from their team with strength s.\n2.The chosen fighter chooses at most s fighters from other team and kills all of them.\nThe Great Masters don't want to see their favorite fighters fall in battle, so they want to build their teams carefully and know who will win different team matchups. They want you to perform two type of queries:\n\n1.1 p x Add a new fighter with strength p to team x. It is guaranteed that this new fighter's strength value will not be less than any current member of team x.\n2.2 x y Print the name of the team that would win a matchup between teams x and y in their current state (recall that team  always starts first). It is guaranteed that x!=y.\nGiven the initial configuration of the teams and q queries, perform each query so the Great Masters can plan the next fight.\n\nNote: You are determining the team that would be the winner if the two teams fought. No fighters are actually dying in these matchups so, once added to a team, a fighter is available for all future potential matchups.\n\nInput Format\n\nThe first line contains three space-separated integers describing the respective values of  n(the number of fighters),  k(the number of teams), and  q(the number of queries). \nEach line i of the n subsequent lines contains two space-separated integers describing the respective values of fighter i's strength, si, and team number, ti. \nEach of the  subsequent lines contains a space-separated query in one of the two formats defined in the Problem Statement above (i.e., 1 p x or 2 x y).\n\nConstraints\n1=n, q=2x10^5                    \n2=k=2x10^5                       \n1=x,y,ti=k                         \n1=si,p=2x10^5\n\nScoring \nThis challange has binary scoring. This means you will get a full score if your solution passes all test cases; otherwise, you will get 0 points.\n\nOutput Format\n\nAfter each type 2 query, print the name of the winning team on a new line. For example, if  x=1 and y=2 are matched up and x wins, you would print 1.", "TESTCASE_1": "7 2 6\n1 1\n2 1\n1 1\n1 2\n1 2\n1 2\n2 2\n2 1 2\n2 2 1\n1 2 1\n1 2 1\n2 1 2\n2 2 1\n###---###SEPERATOR---###---\n1\n2\n1\n1", "TESTCASE_2": "6 2 6\n2 2\n2 1\n1 1\n1 2\n1 2\n1 2\n2 1 2\n2 2 1\n2 1 2\n2 2 1\n1 2 1\n1 2 1\n\n###---###SEPERATOR---###---\n2\n2\n2\n2", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}