{"Q_ID": "1614110021", "S_NAME": "Greedy Algorithm", "Q_NAME": "EAT OR NOT", "Q_DESC": "Our friend Monk has decided to go on a diet in order to improve his Eating Habits. One of his friends told him that Monk should eat a fixed amount of Vitamins, Carbs, Fats and Proteins daily in order to loose weight. Monk wants to strictly follow this regime.\n\nThere are N fruits kept in Monk's Fridge. Each fruit contains a fixed amount of Vitamins, Carbs, Fats and Proteins. Now, Monk wants to know if upon selecting any subset of fruits from the fridge, the sum of their Vitamins, Carbs, Fats and Proteins is individually equal to their corresponding equivalent amount that Monk desires to eat. \n\nFor example, if Monk selects Fruits  i, j and k, then the sum of the vitamins of these 3 fruits should be equal to the amount of vitamins Monk wants to eat and so on for Carbs, Fats and Proteins as well.\n\nIf there exists such a subset to satisfy Monk's demands, print YES(without quotes), else print NO(without quotes).\n\nInput Format:\n\nThe First line contains \n\n4 space separated integers denoting the amount of Vitamins, Carbs, Fats and Proteins that Monk desires to eat. \n\nThe next line contains a single integer  N denoting the number of Fruits in Monk's Fridge. \n\nEach of the next N lines contains 4 space separated integers, where the ith line denotes the number of Vitamins, Carbs, Fats and Proteins in the ith fruit.\n\nOutput Format:\n\nPrint the required answer on a single line\n\nConstraints:\n\n10= Vdes, Cdes, Pdes,Fdes = 1000\n1= N= 20\n10 = V[i],C[i],F[i],P[i]=1000,\n\nwhere \nV[i],C[i],F[i],P[i] denote the number of Vitamins, Carbs, Fats and Proteins in the  ith fruit respectively .", "TESTCASE_1": "100 100 100 100\n4\n50 50 50 50\n50 50 50 50\n50 50 50 50\n50 50 50 50\n###---###SEPERATOR---###---\nYES", "TESTCASE_2": "968 560 456 101\n5\n100 345 9 19\n901 345 999 100\n661 330 216 50\n308 230 240 51\n578 991 900 170\n###---###SEPERATOR---###---\nNO", "TESTCASE_3": "934 564 899 100\n3\n100 359 300 10\n345 200 100 1\n17 546 24 58\n###---###SEPERATOR---###---\nNO", "TESTCASE_4": "100 100 100 100\n4\n10 10 10 10\n10 10 10 10\n10 10 10 10\n10 10 10 10\n###---###SEPERATOR---###---\nNO", "TESTCASE_5": "\n###---###SEPERATOR---###---\n"}