{"Q_ID": "1614110027", "S_NAME": "Greedy Algorithm", "Q_NAME": "LITTLE JHOOL  HIS PUNISHMENT", "Q_DESC": "Little Jhool was was the most intelligent kid of his school. But he did NOT like his class teacher, his school, and the way he was taught things in school. Well, he was a rebel, to say the least. Like most of us, he hated being punished by his teacher - specially, when the punishment was to sit beside someone of the opposite gender. (Oh, he was a kid, come on!)\n\nThere are n number of students in the class, b being the number of boys, and g being the number of girls. Little Jhool decided to challenge his class teacher when she started punishing the entire class using the aforesaid mentioned punishment - making them sit in a straight line outside the class, beside someone of the opposite gender.\n\nThe challenge is as follows: Little Jhool selects a student from the class and make him or her sit outside the class. Then, his teacher picks another student from the remaining students, and makes him or her sit next in the line. Little Jhool and teacher then take alternate turns, until all the students of the class are seated.\n\nIf the number of pairs of neighboring students of the same gender is GREATER than the number of pairs of neighboring students of the opposite gender, output Little Jhool wins! , otherwise, The teacher wins!\n\nInput format:\n\nThe first line contains, tc, the number of test cases. Following that, the next line contains n, the total number of students in the class. Then, in the next line, there are two integers, b and g representing the number of boys and girls in the class, respectively.\n\nOutput format:\n\nYou have to print Little Jhool wins! or The teacher wins! according to the condition.\n\nConstraints:\n1 = t = 50\n1 = n, b, g = 100\n\nPS: - n = b + g\n- There will always be at least one boy and one girl in the class.", "TESTCASE_1": "2\n4\n3 1\n3\n2 1\n###---###SEPERATOR---###---\nLittle Jhool wins!\nThe teacher wins!", "TESTCASE_2": "3\n38\n4 34\n90\n67 23\n54\n25 29\n###---###SEPERATOR---###---\nLittle Jhool wins!\nLittle Jhool wins!\nLittle Jhool wins!", "TESTCASE_3": "2 \n15\n9 6\n12\n8 4\n###---###SEPERATOR---###---\nLittle Jhool wins!\nLittle Jhool wins!", "TESTCASE_4": "2\n27\n13 14\n56\n23 23\n###---###SEPERATOR---###---\nThe teacher wins!\nThe teacher wins!", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}