{"Q_ID": "1614210002", "S_NAME": "Greedy Algorithm", "Q_NAME": "The legend of Tanmay", "Q_DESC": "Tanmay is a legendary spammer - everyone in the spamming world knows and admires his abilities to spam anyone, anytime, anywhere. He decided to guide one of his mentors, named Arjit, as part of the Apex body of spamming.\n\nTanmay has no doubts on his skills of teaching and making his mentor, Arjit, learn about the art of spamming. But, he surely has serious doubt on Arjit's skills of learning, implementing and executing whatever he has decided to teach him as part of the syllabus of spamming.\n\nTanmay has sent Arjit to test his skills, but he's getting extremely anxious about the performance of his mentee. So, to calm himself down he asks you to help him find out the maximum and the minimum productivity attained by Arjit in his travel.\n\nArjit has the option to visit N Facebook groups - where every Facebook group has some potential which can be negative, zero or positive. Now, he can decide to visit a group if he wants to or not. (Depending on the lessons taught to him by the great master!) The total productivity attained by Arjit is the product of all the groups he decides to visit.\n\nGiven the values of all the groups, find out the maximum and minimum spamming potential he can achieve and let Tanmay know about it, so that he calm himself down.\n\nInput format:\nThe first line contains an integer, T, denoting the number of test cases. Each line of the test case contains an integer, N, denoting the size of the array. The next line contains N integers, denoting the value of the numbers in the array.\n\nOutput format:\nPrint the maximum product you can obtain followed by the minimum product. A space separates both these outputs. Answer to each test case is on a new line.\n\nConstraints:\n1  T  500\n1  N  18\n-10  Ni  10", "TESTCASE_1": "2\n4\n1 0 2 10\n3\n0 0 0\n###---###SEPERATOR---###---\n20 0\n0 0", "TESTCASE_2": "5\n4\n0 0 -1 1\n2\n0 -1\n3\n1 1 -1\n3\n-1 -1 -1\n4\n1 1 -1 1\n###---###SEPERATOR---###---\n1 -1\n0 -1\n1 -1\n1 -1\n1 -1", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}