{"Q_ID": "1615110022", "S_NAME": "Dynamic Programming", "Q_NAME": "STUDIOUS LITTLE JHOOL", "Q_DESC": "Yes, you read it right - Little Jhool is back, but no, he's not over his break up, still. And he's sad, broken and depressed; thus, he decided to visit a psychologist. She tells him to think about his pleasant memories of childhood, and stay busy so as to not miss his ex-girlfriend.\n\nShe asks him about his favorite memories from childhood, and being the genius Mathematician Little Jhool is, he remembered that solving Mathematics problem given to him by his teacher was his favorite memory.\n\nHe had two types of notebooks, when he was a kid. 10 problems could be solved in one page, in the first notebook. 12 problems could be solved in one page, in the second notebook.\nLittle Jhool remembered how in order to maintain symmetry, if he was given with n problems in total to solve, he tore out pages from both notebooks, so no space was wasted. EVER!\n\nBut, now he's unable to solve his own problem because of his depression, and for the exercise of the week, he has to answer the queries asked by his psychologist.\n\nGiven n number of questions, print the minimum number of pages he needs to tear out from the combination of both the notebooks, so that no space is wasted.\n\nInput Format:\n\nThe first line will contain t - number of test cases.\nThe second will contain an integer n - number of questions.\n\nOutput Format:\n\nCorresponding to the input, print the minimum number of pages Little Jhool needs to tear out from the combination of both the notebooks. If it is NOT possible, print 1.\n\nConstraints:\n1=t=100 \n 1=n=113", "TESTCASE_1": "2\n23\n32\n###---###SEPERATOR---###---\n-1\n3", "TESTCASE_2": "20\n27\n69\n81\n41\n43\n22\n28\n60\n51\n13\n58\n64\n46\n30\n78\n45\n99\n71\n98\n83\n###---###SEPERATOR---###---\n-1\n-1\n-1\n-1\n-1\n2\n-1\n5\n-1\n-1\n5\n6\n4\n3\n7\n-1\n-1\n-1\n9\n-1", "TESTCASE_3": "3\n75\n74\n27\n###---###SEPERATOR---###---\n-1\n7\n-1", "TESTCASE_4": "5\n23\n45\n67\n34\n23\n###---###SEPERATOR---###---\n-1\n-1\n-1\n3\n-1", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}