{"Q_ID": "1615110013", "S_NAME": "Dynamic Programming", "Q_NAME": "LEAF & LIME LIGHT ATTACK", "Q_DESC": "Limelight is a technique that is used when all four users take place in the cardinal directions. They will then join their strength in the form of four connecting streams above the target area. It will then create a massive ball of lightning powerful enough to incinerate everything within the area of the four users.   \n\nThe Leaf village is build in the shape of Spiral of integers. Spiral of integers, of an integer  N, is an interesting NN spiral matrix which starts with 1 at the center. \n\nFor example, for N=4, the spiral of integers is   Kitane, Nauma, Tu and Seito are planning to destroy the whole Leaf village. The limelight spot will be the 4 corners of the village. \n\nStrength of the attack is equal to the sum of all the elements in the connecting streams as shown in the figure ( sum of diagonal elements of the spiral of integers of N ) .\n\nGiven the value of N, you need to compute the strength of the attack (mod 10^9+9).\n\nInput:\n\nFirst line contains an integer T, denoting the number of test cases.\nEach test case consists of a single integer N.\n\nOutput:\n\nFor each test case output a single integer denoting the strength of the attack (mod 10^9+9).\n\nConstraints:\n\n1<=T<=10^5\n1<=N<=10^7", "TESTCASE_1": "2\n4 10000000\n###---###SEPERATOR---###---\n56 679604006", "TESTCASE_2": "30\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30\n###---###SEPERATOR---###---\n1 10 25 56 101 170 261 384 537 730 961 1240 1565 1946 2381 2880 3441 4074 4777 5560 6421 7370 8405 9536 10761 12090 13521 15064 16717 18490", "TESTCASE_3": "10\n1 2 3 4 5 6 7 8 9 10\n###---###SEPERATOR---###---\n1 10 25 56 101 170 261 384 537 730", "TESTCASE_4": "15\n11 12 13 14 15 16 17 18 19 20 21 22 23 24 25\n###---###SEPERATOR---###---\n961 1240 1565 1946 2381 2880 3441 4074 4777 5560 6421 7370 8405 9536 10761", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}