{"Q_ID": "1615110026", "S_NAME": "Dynamic Programming", "Q_NAME": "GOLD MINES", "Q_DESC": "There is a rectangular grid of gold mine. The grid has R rows and C columns. So it has R*C cells in total. The rows are numbered from 1 to R and the columns are numbered from 1 to C. \n\nThe top most row has number 1, the row next to it has number 2 and so on. Similarly, the left most column has number 1, the column next to it has number 2 and so on. Each cell in the grid has a unique coordinate which is (x, y) where x is the row number and y is the column number of that particular cell.\n\nEach cell in the grid has certain amount of gold in it. Total gold in a sub rectangle of the grid is the sum of all units of gold contained in the cells that are inside the rectangle. Your task is to find the total gold in the given sub rectangle.\n\nA sub rectangle of the grid is defined by four integers x1, y1, x2 and y2. A cell (x, y) belongs to the sub rectangle if and only if x1 <= x <= x2 and y1 <= y <=y2\n\nInput\n\nFirst line of the input contains two space separated integers, R and C. It is followed by R lines, each line has C space separated integers. Each integer denotes the units of gold present in that particular cell. \nNext line has number Q, it is followed by Q queries each query in a single line. Each query is four space separated integers x1, y1, x2 and y2.\n\nOutput \nFor each query, you have to print a single number the total gold contained in that sub rectangle.\n\nConstraints\n1 <= R <= 1000\n1 <= C <= 1000 \n1 <= x1 <= x2 <= R \n1 <= y1 <= y2 <= C\nAmount of gold in each cell is an integer from 0 to 10^6", "TESTCASE_1": "4 4\n2 8 9 7\n5 8 1 7\n5 7 3 5\n4 8 7 4\n4\n1 2 4 2\n1 4 2 4\n1 1 4 2\n2 4 2 4\n###---###SEPERATOR---###---\n31\n14\n47\n7", "TESTCASE_2": "4 4\n2 4 9 7\n4 8 1 7\n5 7 3 4\n4 8 7 4\n4\n1 2 4 2\n1 4 2 4\n1 1 4 2\n2 4 2 4\n###---###SEPERATOR---###---\n27\n14\n42\n7", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}