{"Q_ID": "1615110028", "S_NAME": "Dynamic Programming", "Q_NAME": "Little Deepu and his Girlfriend", "Q_DESC": "Little Deepu recently got a new job, so to celebrate, he decided to take his girfriend, Kate, out on a fancy candle light dinner. \nTo make things perfect for Kate, Deepu planned the night to the last detail. The food, the music, the ambience, everything was perfect, but stupidly enough Deepu forgot to get her a present. \n\nAfter dinner, Kate asks our Deepu for her gift, when she finds out that he hasn't got her any she gets upset, to try smooth things with her, he proposes a game, this makes Kate so angry that she dumps him right there(bad move Deepu). Well its safe to say the rest of the evening was uneventful for Little Deepu but the game he proposed was pretty interesting.\n\nTo put the game a bit formally, we have two players Little Deepu and Kate and M items in the bag B, also we have a game set S with N elements, each element of game set is an integer. \n\nThe game is played as follows, each player takes turn to pick an element from the game set S and removes that number of items from the bag, the player that is unable to remove the items from the bag looses the game. Little Deepu start the game ,If both Little Deepu and Kate play the game optimally, your task is to determine who wins the game. \n\nInput:\nFirst line contains a integer T , number of test cases. Each test case contain two lines , first line contain two integer M and N and second line contain elements of S.\n\nOutput:\nFor each test case print name of the winner of the game .\n\nConstraints:\n1=T = 1000\n1 = M = 10000\n1 = N = 100\n1 = S[i] = M", "TESTCASE_1": "2\n3 2\n1 2\n5 3\n1 2 3\n###---###SEPERATOR---###---\nKate\nLittle Deepu", "TESTCASE_2": "3\n3 3\n2 1 4\n4 2\n1 2\n4 3\n2 6 1\n\n###---###SEPERATOR---###---\nKate\nLittle Deepu\nLittle Deepu", "TESTCASE_3": "1\n2 2\n1 2\n###---###SEPERATOR---###---\nLittle Deepu", "TESTCASE_4": "1\n3 3\n2 1 4\n###---###SEPERATOR---###---\nKate", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}