{"Q_ID": "1615110007", "S_NAME": "Dynamic Programming", "Q_NAME": "Puzzle ", "Q_DESC": "Red John has committed another murder. But this time, he doesn't leave a red smiley behind. What he leaves behind is a puzzle for Patrick Jane to solve. He also texts Teresa Lisbon that if Patrick is successful, he will turn himself in. The puzzle begins as follows.\n\nThere is a wall of size 4xN in the victim's house. The victim also has an infinite supply of bricks of size 4x1 and 1x4 in her house. There is a hidden safe which can only be opened by a particular configuration of bricks in the wall. In every configuration, the wall has to be completely covered using the bricks. \n\nThere is a phone number written on a note in the safe which is of utmost importance in the murder case. Gale Bertram wants to know the total number of ways in which the bricks can be arranged on the wall so that a new configuration arises every time. \n\nHe calls it M. Since Red John is back after a long time, he has also gained a masters degree in Mathematics from a reputed university. So, he wants Patrick to calculate the number of prime numbers (say P) up to M (i.e. <= M). If Patrick calculates P, Teresa should call Red John on the phone number from the safe and he will surrender if Patrick tells him the correct answer. Otherwise, Teresa will get another murder call after a week.\n\nYou are required to help Patrick correctly solve the puzzle.\n\nInput Format\n\nThe first line of input will contain an integer T followed by T lines each containing an integer N.\n\nOutput Format\n\nPrint exactly one line of output for each test case. The output should contain the number P.\n\nConstraints \n1<=T<=20 \n1<=N<=40", "TESTCASE_1": "2 \n1 \n7\n###---###SEPERATOR---###---\n0\n3", "TESTCASE_2": "2\n7\n3\n###---###SEPERATOR---###---\n3\n1", "TESTCASE_3": "3\n1\n4\n7\n###---###SEPERATOR---###---\n0\n2\n3", "TESTCASE_4": "4\n1\n6\n2\n3\n###---###SEPERATOR---###---\n0\n3\n0\n1", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}