{"Q_ID": "1615210011", "S_NAME": "Dynamic Programming", "Q_NAME": "Terminators", "Q_DESC": "War is raging between Humans and Cyberdyne Systems. Our intel has shown that Cyberdyne has prepared a large army of terminators to exterminate humans from the face of Earth. We need to prepare for battle!\n\nWe sent some spies to the Terminator camp to gather more information about their tactics. Our spies observed the following:\n\nThere are a total of \nn\nn terminators in the camp. They are numbered from \n1\n1 to \nn\nn. All terminators have a unique strength level.\n\nThey are divided into groups. Each group has a certain number of terminators in it. The size of each group may be different.\n\nEvery day the terminators stand in a queue for inspection. The spies observed that the terminators stood in such a way that a terminator never stands ahead of a stronger terminator of his group. A terminator may stand ahead of a stronger terminator of a different group.\n\nThe spies observed the camp for two days. They noted down the position of each terminator in the queue for each day. The supreme Commander of the Human Army has appointed you. Your job is to tell the maximum possible number of terminators in one group.\n\nConstraints:\n\n1\n\nt\n\n100\n1t100\n\n1\n\nn\n\n1000\n1n1000\nNo two terminators occupy the same position in the queue.\n\nInput:\n\nThe first line of the input contains the number of test cases, \nt\nt. The first line of each test case has the n, the number of terminators. \nN\nN lines follow. The \ni\nt\nh\nith line has two integers, \np\n1\np1 and \np\n2\np2. \nP\n1\nP1 is the position of the \ni\nt\nh\nith terminator in the inspection line as observed on the first day. \nP\n2\nP2 is the position of the \ni\nt\nh\nith terminator in the inspection line as observed on the second day.\n\nOutput:\n\nFor each test case, output a single line containing the maximum number of terminators that may belong to the same group.", "TESTCASE_1": "2\n3\n1 1\n2 2\n3 3\n4\n1 4\n2 2\n3 3\n4 1\n###---###SEPERATOR---###---\n3\n2\n", "TESTCASE_2": "1\n3\n20 02\n30 30\n40 40\n\n###---###SEPERATOR---###---\n3", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}