{"Q_ID": "1617110011", "S_NAME": "Graph Colouring", "Q_NAME": "Minimum Spanning Tree-Friendless Dr. Sheldon Cooper", "Q_DESC": "Leonard has decided to quit living with Dr. Sheldon Cooper and has started to live with Penny. Yes, you read it right. (And you read it here for the first time!) \n\nHe is fed up of Sheldon, after all. Since, Sheldon no more has Leonard to drive him all around the city for various things, he's feeling a lot uneasy so he decides to set up a network of drivers all around the city to drive him to various places.\n\nBut, not every driver wants to go every place in the city for various personal reasons, so Sheldon needs to trust many different cab drivers. (Which is a very serious issue for him, by the way!) \n\nThe problem occurs mainly when Sheldon needs to go to - for example, the Comic book store - and there's no cab driver who goes directly to that place. So, he has to take a cab till another place, and then take a cab from there - making him more scared!\n\nSheldon wants to limit his trust issues. Really. Once. And. For. All.\n\nLet's say that you're given the schedule of all the cabs from the major points where he travels to and from - can you help Sheldon figure out the least number of cab drivers he needs to trust, in order to go to all the places he wants to?\n\nInput Format:\nThe first line contains a number with the number of test cases. \nEvery test case has the following input:- Two integers a, b. \na - number of places he needs to go. \nb - number of cab drivers.\n\nOutput Format:\nPrint the minimum number of cab drivers he needs to have faith in to travel between places in the city.\n\nConstraints:\n1<=t<=100\n2<=a<=1000 | 1<=b<=1000\nm NOT equal to n | 1<=m | n<=b\nThe graph is connected.", "TESTCASE_1": "1\n3 3\n1 2\n2 3\n1 3\n###---###SEPERATOR---###---\n2", "TESTCASE_2": "1\n3 3\n2 2\n2 3\n1 3\n###---###SEPERATOR---###---\n2", "TESTCASE_3": "1\n4 4\n1 4\n2 3\n3 4\n1 4\n###---###SEPERATOR---###---\n3", "TESTCASE_4": "2\n5 5\n2 3\n3 4\n1 5\n4 5\n2 5\n2 2\n1 2\n2 2\n###---###SEPERATOR---###---\n4\n1", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}