{"Q_ID": "1617110015", "S_NAME": "Graph Colouring", "Q_NAME": "Minimum Spanning Tree-Quantitative coefficient", "Q_DESC": "It is very important to understand relationship between variables to draw the right conclusion from a statistical analysis. The relationship between variables determines how the right conclusions are reached. Without an understanding of this, you can fall into many pitfalls that accompany statistical analysis and infer wrong results from your data.\n\nLinear programming (LP; also called linear optimization) is a method to achieve the best outcome (such as maximum profit or lowest cost) in a mathematical model whose requirements are represented by linear relationships. More formally, linear programming is a technique for the optimization of a linear objective function, subject to linear equality and linear inequality constraints.\n\nWe are not going to present some LP theory, but let's have a look at combinatorial problem related to this theory. Suppose you have a set of N variables. There are M relationships of some pairs of these variables. More formally, you have M relationships of type ai, bi, ci which means that variables ai and bi are in a relationship with quantitative coefficient ci. Quantitative coefficient of a connected set S of variables is a product of all relationship quantitative coefficients in this set.\n\nSet S of variables is called connected if any two variables in this set are connected. Variables x and y are called connected if at least one of the following conditions is satisfied:\n\nx and y are put in relationship directly\nthere is such a variable z that x and z are connected and y and z are connected too.\nYou are given a connected set S of N variables and M relationships. Your task is to leave some of these relationships in such a way that S is still connected and its quantitative coefficient is minimal possible.\n\nInput\n\nThe first line contains one integer T denoting the number of test cases.\nEach test case starts with a line containing 2 space-separated integer: N and M. Each of the following M lines contain description of one relationship: three different space-separated integers: a, b and c. a and b are different and from 1 to N each and denote numbers of vertices that are connected by this edge. c denotes quantitative coefficient of this relationship. It's guaranteed that the given set is initially connected.\n\nOutput\n\nFor each test case output one integer - minimal possible quantitative coefficient. As the the answer can be very big output it modulo 10^9 + 7.\n\nConstraints\n\n1 = T = 20\n1 = N = 1500\n1 = M = 31313\n1 = ai, bi = N\n1 = ci = 10^9", "TESTCASE_1": "1\n3 3\n1 2 1234567\n2 3 2345678\n1 3 3456789\n###---###SEPERATOR---###---\n896631161", "TESTCASE_2": "1\n2 3\n1 2 1234\n2 3 2345\n###---###SEPERATOR---###---\n1234", "TESTCASE_3": "1\n3 3\n1 2 2345678\n2 3 3456789\n1 3 12345619\n###---###SEPERATOR---###---\n\n\n513851186", "TESTCASE_4": "1\n2 3\n1 2 1235\n2 3 2347\n###---###SEPERATOR---###---\n\n\n1235", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}