{"Q_ID": "1617110014", "S_NAME": "Graph Colouring", "Q_NAME": "Minimum Spanning Tree-Pilgrims and Portals", "Q_DESC": "Pritam is a priest in his village. He needs to pay his respects to k shrines which his all ancestors have visited and had asked their successors to pay the respect. But he hates walking so he wants to minimize the distance he has to travel to pay his respects. \n\nAs he is busy packing he asks you to help him. He has acquired a bunch of portal scrolls through which he can create portal networks. Portals can only be created at shrines , and after entering a portal a he can exit at any desired portal. \n\nYou have to give the minimum distance Pritam has to travel. There are number of cities which dont have shrines but that can be traveled through.\nYou will be given n the number of cities and out of which first k cities have shrines. \n\nThere is road connecting two cities which will be defined by three integers a, b and c where a and b are the cities and c is the distance between the cities. \n\nYou have to calculate the minimum distance that need to be walked for this pilgrimage given that there is no restriction on number of portals that can be created but need to be created at shrines. \nAfter you have told him the distance hell decide whether its worth undertaking or not. You can assume that he starts from 1st city.\n\n[Input]\nFirst line contains integer t denoting number of test cases.\nFirst line of every test case consists of 3 integers n, m and k denoting number of cities, number of roads and number of shrines respectively.\nNext m lines of test case consists of 3 space separated integers a, b and c, where a and b are cities and c is the distance between them.\n\n[Output]\nFor each test case print a single integer containing the minimum distance he need to walk for the pilgrimage.\n\n[Constraints]\n1=t=20\n1=n=100\nn-1=m=(n*(n-1))/2\n1=k=n\n1=a,b=n\n1=c=1000000", "TESTCASE_1": "1\n5 10 3\n1 2 10\n1 3 5\n1 4 10\n1 5 80\n2 3 9\n2 4 1\n2 5 20\n3 4 100\n3 5 2\n4 5 20\n###---###SEPERATOR---###---\n14", "TESTCASE_2": "1\n5 10 3\n1 2 10\n1 3 5\n###---###SEPERATOR---###---\n15", "TESTCASE_3": "1\n5 10 3\n1 2 12\n1 3 5\n1 4 10\n1 5 90\n2 3 9\n2 4 1\n2 5 20\n3 4 10\n3 5 2\n4 5 20\n###---###SEPERATOR---###---\n14", "TESTCASE_4": "1\n5 10 2\n1 2 10\n1 3 4\n###---###SEPERATOR---###---\n\n\n10", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}