{"Q_ID": "1617110025", "S_NAME": "Graph Colouring", "Q_NAME": "Snakes and Ladders: The Quickest Way Up", "Q_DESC": "Markov takes out his Snakes and Ladders game and stares at the board, and wonders: If he had absolute control on the die (singular), and could get it to generate any number (in the range 1-6) he desired, what would be the least number of rolls of the die in which he'd be able to reach the destination square (Square Number 100) after having started at the base square (Square Number 1)?\n\nRules\n\nMarkov has total control over the die and the face which shows up every time he tosses it. You need to help him figure out the minimum number of moves in which he can reach the target square (100) after starting at the base (Square 1).\n\nA die roll which would cause the player to land up at a square greater than 100, goes wasted, and the player remains at his original square. Such as a case when the player is at Square Number 99, rolls the die, and ends up with a 5.\n\nIf a person reaches a square which is the base of a ladder, (s)he has to climb up that ladder, and he cannot come down on it. If a person reaches a square which has the mouth of the snake, (s)he has to go down the snake and come out through the tail - there is no way to climb down a ladder or to go up through a snake.\n\nConstraints\n\nThe board is always of the size 10 x 10  and Squares are always numbered 1 to 100.\n1=T=10                              1=Number of Laddrers=15      1=Number of Snakes=15\n \n \n\nSquare number 1 and 100 will not be the starting point of a ladder or a snake. \nNo square will have more than one of the starting or ending point of a snake or ladder (e.g. snake 56 to 44 and ladder 44 to 97 is not possible because 44 has both ending of a snake and a starting of a ladder)\n\nInput Format\n\nThe first line contains the number of tests, T. T testcases follow.\n\nFor each testcase, the first line contain N(Number of ladders) and after that N line follow. Each of the N line contain 2 integer representing the starting point and the ending point of a ladder respectively.\n\nThe next line contain integer M(Number of snakes) and after that M line follow. Each of the M line contain 2 integer representing the starting point and the ending point of a snake respectively.\n\nOutput Format\n\nFor each of the T test cases, output one integer, each in a new line, which is the least number of moves (or rolls of the die) in which the player can reach the target square (Square Number 100) after starting at the base (Square Number 1). This corresponds to the ideal sequence of faces which show up when the die is rolled. \nIf there is no solution, print -1.", "TESTCASE_1": "2\n3\n32 62\n42 68\n12 98\n7\n95 13\n97 25\n93 37\n79 27\n75 19\n49 47\n67 17\n4\n8 52\n6 80\n26 42\n2 72\n9\n51 19\n39 11\n37 29\n81 3\n59 5\n79 23\n53 7\n43 33\n77 21 \n###---###SEPERATOR---###---\n3\n5", "TESTCASE_2": "1 1 7 98 1 99 1\n###---###SEPERATOR---###---\n2", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}