{"Q_ID": "1617110029", "S_NAME": "Graph Colouring", "Q_NAME": "BFS-Sonya and the graph with disappearing edges", "Q_DESC": "Pussycat Sonya is standing on the graph in the node with number 1 and she wants to reach the node number N. It's known that graph consists of N nodes and M undirected edges. Getting through the edge takes 1 unit of time. \n\nIt's also known that there are K moments of time in which some edges will disappear. Let's consider this process in more detail. Sonya stands in the node number 1 at the moment of time = 0. \n\nMoving to any of adjacent nodes through the edge increases time by 1 unit. And once she changed her location all edges that must disappear at that moment of time become unavailable.\n\nWhat is the minimal time Sonya needs to reach the node number N? If it's impossible print -1.\n\nInput:\n\nThe first line of input contains three integers N - the number of nodes, M - the number of edges and K - the number of moments of time in which some edges will disappear.\n\nEach of the next M lines contains a pair of integers Ui and Vi which means that edge number i connects node number Ui and node number Vi. You can assume that between any pair of nodes there's no more than one connecting edge and there's no edge connecting some node to itself.\n\nThen K lines follow. Each of these lines contains a pair of integers T and X which means that at moment of time T the edge number X will disappear. You can assume that all Xs will be unique.\n\nOutput:\nPrint the minimal time Sonya needs to reach the node number N, if it's impossible print -1.\n\nConstraints:\n1<=  N <= 10^5\n0 <= K <= M <= min((N * (N - 1)) / 2, 10^5)\n1<=  Ui, Vi <= N\n1 <= T <= 10^9\n1 <= X <= M", "TESTCASE_1": "5 5 1\n1 2\n1 3\n2 5\n3 4\n4 5\n1 3\n###---###SEPERATOR---###---\n3", "TESTCASE_2": "7 7 1\n1 2\n2 3\n1 4\n3 6\n5 4\n7 5\n6 7\n2 6\n###---###SEPERATOR---###---\n4", "TESTCASE_3": "6 6 1\n1 3\n2 4\n1 5\n2 6\n3 2\n4 1\n###---###SEPERATOR---###---\n3", "TESTCASE_4": "4 4 1\n1 3\n2 4\n2 5\n3 4\n1 2 \n###---###SEPERATOR---###---\n2", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}