{"Q_ID": "1619210012", "S_NAME": "Sum of Subsets", "Q_NAME": "Xsquare And Balanced Strings", "Q_DESC": "Xsquare got bored playing with the arrays all the time. Therefore he has decided to buy a string S consists of N lower case alphabets. Once he purchased the string, He starts formulating his own terminologies over his string S. Xsquare calls a string str A Balanced String if and only if the characters of the string str can be paritioned into two multisets M1 and M2 such that M1= M2 .\n\nFor eg:\n\nStrings like \"abccba\" , \"abaccb\" , \"aabbcc\" are all balanced strings as their characters can be partitioned in the two multisets M1 and M2 such that M1 = M2.\n\nM1 = {a,b,c}\n\nM2 = {c,b,a}\n\nwhereas strings like ababab , abcabb are not balanced at all.\n\nXsquare wants to break the string he has purchased into some number of substrings so that each substring is a balanced string . However he does not want break the string into too many substrings, otherwise the average size of his strings will become small. What is the minimum number of substrings in which the given string can be broken so that each substring is a balanced string.\n\nInput\n\nFirst line of input contains a single integer T denoting the number of test cases. First and the only line of each test case contains a string consists of lower case alphabets only denoting string S .\n\nOutput\n\nFor each test case, print the minimum number of substrings in which the given string can be broken so that each substring is a balanced string. If it is not possible the given string according to the requirement print -1 .\n\nConstraints\n\n1  T  10^5\n\n1  |S|  10^5\n\nS consists of lower case alphabets only.\n\nNOTE : sum of |S| over all the test case will not exceed 10^6.", "TESTCASE_1": "3\nelle\njason\nimmi\n###---###SEPERATOR---###---\n1\n-1\n1", "TESTCASE_2": "2\nsrm\nsrmUniv\n###---###SEPERATOR---###---\n-1\n-1", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}