{"Q_ID": "1414210015", "S_NAME": "Sorting Techniques", "Q_NAME": "Benny and Gifts ", "Q_DESC": "Little pig Benny has just taken a shower. Now she is going to buy some gifts for her relatives. But the problem is that Benny doesn't know how to reach to the gift shop. Her friend Mike has created a special set of instructions for her. A set of instructions is a string which consists of letters {'L', 'R', 'U', 'D'}.\n\nFor simplicity, let's assume that Benny is staying at point (0, 0) on the infinite plane. She consistently fulfills all the instructions written by Mike. Let's assume that now she is staying at point (X, Y). Then depending on what is the current instruction she moves in some direction:\n\n    'L' -- from (X, Y) moves to point (X, Y - 1)\n    'R' -- from (X, Y) moves to point (X, Y + 1)\n    'U' -- from (X, Y) moves to point (X - 1, Y)\n    'D' -- from (X, Y) moves to point (X + 1, Y)\n\nThe weather is cold because it's winter now. Initially, all points are snowy. But if Benny have already visited some point at any time this point becomes icy (because Benny has just taken a shower). Every time, when Benny makes a step into icy points she slips and falls down.\n\nYou are given a string S which denotes a set of instructions for Benny. Your task is to calculate how may times she will fall down.\n\nInput format\n\nSingle line contains string S.\n\nOutput format\n\nOutput how many times Benny will fall down.\n\n Explanation\n\nBenny's route consists of points\n\n0 0 (becomes icy) --> 0 1 (becomes icy) --> 0 2 (becomes icy) --> -1 2 (becomes icy) --> -1 1 (becomes icy) --> 0 1 (is icy) --> 0 0 (is icy)\n\nSo Benny made two steps into icy points.\n", "TESTCASE_1": "RRULDL\n###---###SEPERATOR---###---\n2", "TESTCASE_2": "RDUUDLRLDLDLDLRUUDLRLDDURUUUUUDUDUDDDDRLLLLLLRRRRLLL\n###---###SEPERATOR---###---\n33", "TESTCASE_3": "RRRRRRRRRRRRRRRRRRUUUUUUUUUUUUUUUUUUUUUDDDDDDDDDDDDDDDDLLLLLLLLLLLLRLRLRLRLRLDUDUDUDUDUDURURLDLDLRLDLRLDLRUDRLDRRRDURDLRD\n###---###SEPERATOR---###---\n55", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}