{"Q_ID": "1414310011", "S_NAME": "Sorting Techniques", "Q_NAME": "The rise of the weird... Things", "Q_DESC": "Bangalore City, where peace prevails most of the time. Not everyone is a huge fan of peace, though. Certainly not Mr. XYZ, whose identity is not known to us - yet. Mr. XYZ has somehow managed to bring vampires and zombies to Bangalore City to attack and destroy the city.\n\nFatal Eagle, an ordinary citizen of the city is extremely worried on seeing his city being attacked by these weird creatures. But, as of now, he has no power to stop these creatures from their silent attacks. He wants to analyze these creatures firstly. He figured out some things about these creatures, like:\n\nZombies have power in terms of an EVEN number.\nVampires have power in terms of an ODD number.\nIf he sees a zombie or a vampire, he marks them in his list with their power. After generating the entire list of power of these creatures, he decides to arrange this data in the following manner:\n\nAll the zombies arranged in sorted manner of their power, followed by the total power of zombies.\nAll the vampires arranged in sorted manner of their power, followed by the total power of vampires.\nYou've to help him produce the following list to help him save his city.\n\nInput constraints:\nThe first line of input will contain an integer  N, denoting the number of creatures. The next line will contain N integers denoting the elements of the list containing the power of zombies and vampires.\n\nOutput constraints:\nPrint the required list in a single line.", "TESTCASE_1": "6\n2 3 10 12 15 22\n###---###SEPERATOR---###---\n2 10 12 22 46 3 15 18", "TESTCASE_2": "10\n733 828 408 177 910 108 583 290 131 394\n###---###SEPERATOR---###---\n108 290 394 408 828 910 2938 131 177 583 733 1624", "TESTCASE_3": "10\n570 751 980 995 529 940 212 848 718 515\n###---###SEPERATOR---###---\n212 570 718 848 940 980 4268 515 529 751 995 2790", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}