{"Q_ID": "1414210018", "S_NAME": "Sorting Techniques", "Q_NAME": "The  Best player", "Q_DESC": "It's Lolympics 2016 right now, and we all know who's the best player there right now: Kalyani! Obviously, he has a huge female fan following and he has to make sure they are all happy and rooting for him to win the gold medals.\n\nBut with fan following comes arrogance and lack of time. Thus, he has sufficient time to interact with atmost T of his fans. Each fan is defined by two parameters : Name and Fan Quotient. The name defines the name of the fan, while the fan quotient is a measure of the fan's devotion towards Kalyani. Higher the fan quotient, greater is the devotion. Kalyani now wants to meet T of his fans. While selecting the fans he wants to meet, he wants to make sure that a fan with a higher fan quotient should be given a chance in favour of those with lesser fan quotient. In case of ties, he sorts their name lexicographically and chooses the lexicographically lesser named fan.\n\nGiven details of N fans, can you help out Kalyani by giving him a list of fans he would be interacting with?\n\nInput Format :\n\nThe first line contains N and T, the number of fans and the maximum number of fans Kalyani can meet. Each of the next N lines contains a string and an integer separated by a space. The string denotes the name of the fan while the integer depicts the fan quotient.\n\nOutput Format :\n\nOutput T lines, each containing the name of the fans selected. Fans with higher fan quotient should be outputted first and in case of a tie, the lexicographically minimum name should come first.", "TESTCASE_1": "3 2\nsurbhi 3\nsurpanakha 3\nshreya 5\n###---###SEPERATOR---###---\nshreya\nsurbhi", "TESTCASE_2": "22 16\nomndflgwb 355\nhh 10905\nsbsunm 16713\nrmrvnrmkf 14258\negpvzxpncfzkc 22214\ngdctxzbdnlaxfuwocbp 17271\nslft 25852\njctynaszdkxusr 27479\nvvlmzzyfbuwjzqil 18238\nhulwzhvgehvccramd 8091\nzpfhbppjlmxiq 20437\ntm 24761\nujjhe 28859\norwrbizaieefkfzcbj 11335\nzoasvhblhtk 3449\nabkk 28573\nmekljudykzqgvkykaxyn 6245\nrmbwzcady 458\neejnxdbeaym 25341\nlkutrhanz 6682\nrnfjnxkykxm 11654\nwombibwieouyfmhikpo 12192\n###---###SEPERATOR---###---\nujjhe\nabkk\njctynaszdkxusr\nslft\neejnxdbeaym\ntm\negpvzxpncfzkc\nzpfhbppjlmxiq\nvvlmzzyfbuwjzqil\ngdctxzbdnlaxfuwocbp\nsbsunm\nrmrvnrmkf\nwombibwieouyfmhikpo\nrnfjnxkykxm\norwrbizaieefkfzcbj\nhh", "TESTCASE_3": "12 3\nn 12305\ndtzrnofqqbohd 22885\nxogiddbizmlm 27722\ndwkelthmsh 20280\nlqik 2117\nopwayzrvhmnhcdxzkj 8770\novgzefx 16110\not 2240\nzrxshyjqh 20184\ni 23039\nbiauveegghh 12087\nqxi 31399\n###---###SEPERATOR---###---\nqxi\nxogiddbizmlm\ni", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}