{"Q_ID": "1416210021", "S_NAME": "Stack Implementation", "Q_NAME": "Monk and Order of Phoenix", "Q_DESC": "Voldemort has a big army, so he has maintained his people in N rows to fight Harry's army. Each row contains the heights of the fighters and is sorted in non-decreasing order from the start to end, except for the first row, which may contain the heights of the fighters in any arbitary order, as it contains all the legendry fighters.\nDuring the war, at any time, Voldemort can remove a fighter from any row, and can also add any new fighter to any row (maintaining the non-decreasing order of heights. except in the first row).\nNote:\n1. Voldemort will never remove any fighter from an empty row.\n2. Voldemort can only remove or add a fighter from/to the end of row.\nNow Harry has a special wand which can kill exactly N fighters in one go, but with following conditions:\n1. There should be exactly N fighters, and exactly one fighter (which can be anyone in the row) should be chosen from each row.\n2. The first fighter can only be chosen from the first row, the second one from second row, and so on. Basically the ith fighter should be chosen from ith the row, where i ranges from 1 to N.\n. 3. The order of the heights of the chosen fighters should be strictly increasing.\nNow Harry wants to know whether he can kill N fighters using special wand. As Harry is busy in fighting Voldemort, he gave this task to Monk. \nInput Format:\nThe First line consists of a single integer N denoting the number of stacks.\nIn each of the next N lines, first integer X denotes the size of the stack, followed by the X space separated integers denoting the heights of the fighters in the stack.\nThe next lines consists of single integer Q, denoting the number operations. \nEach of the next Q lines will contain a integer v, which will decide the type of operation.\n1. For v=1 , extra 2 integers k and h will be given , which shows that Voldemort will add one fighter of height h in kth stack, maintaining the order of the stack, if k is not equal to 1 .\n2. For v=0, 1 more integer k will be given, which shows that Voldemort will remove a fighter from kth stack.\n3. For v=2, Monk needs to know whether Harry can use his special wand or not.\nOutput Format: :\nFor each v=2, print YES (without quotes) if Harry can use his special wand or print NO (without quotes).\n", "TESTCASE_1": "2\n3 3 5 4\n3 1 1 2\n8\n0 1\n2\n1 1 1\n2\n0 1\n2\n1 2 4\n2\n###---###SEPERATOR---###---\nNO\nYES\nNO\nYES", "TESTCASE_2": "2\n3 9 5 7\n3 8 1 5\n8\n0 1\n2\n1 1 1\n2\n0 1\n2\n1 2 4\n2\n###---###SEPERATOR---###---\nNO\nYES\nNO\nNO", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}