{"Q_ID": "1416310005", "S_NAME": "Stack Implementation", "Q_NAME": "Stack 49", "Q_DESC": "Fatal Eagle is extremely impressed by his new acquaintance Arjit's strategies, but it has got him worried and skeptical about him. He is thinking that what if Arjit is working for Mr. XYZ and trying to kill him! Or, is his mind playing a game with him with all these conspiracy theories? If only he knew.\n\nLost in his thoughts, Fatal Eagle went to C8 to have a beer not realizing that drugs were already mixed in his drink by Mr. XYZ and his band of villains. Fatal Eagle ends up being so tipsy that he cannot even recognize that Arjit was the one who mixed drugs into his drink.\n\nNow Arjit, seeing all this scene in front of him is laughing at Fatal Eagle like crazy, revealing that he is Mr. XYZ, and was planning this all along. Fatal Eagle, meanwhile is seeing N same Arjits standing in front of him. He's having difficulty in recognizing the real one among the fake images. So, he mentally assigns every Arjit a drunk quotient - and in a simpler way, he follows this particular algorithm:\n\nHe sees a sequence of N Arjits standing in a line.\nHe assigns every Arjit a drunk quotient.\nHe selects an index i at his will.\nHe compares ith Arjit to i+1th Arjit.\nThen, he figures out that the Arjit whose value of drunk quotient is less - is NOT real.\nAfter which, he replaces the two Arjits, ith and i+1th, by a single Arjit, which would be the one with the greater value of the drunk quotient.\nFatal Eagle loses energy equal to the maximum of the two Arjits compared.\nAfter (n-1) such attempts by Fatal Eagle, there will be only one Arjit remaining. (Hopefully real!)\nNow, you have to help Fatal Eagle in finding out the optimal way out so that he can lower the number of Arjits to save his energy. In short, he needs to reach a point where he can see the real Arjit in front of him.\n\nInput format:\nThe first line would contain an integer, T - denoting the number of test cases, followed by a number N, denoting the number of Arjits seen by Fatal Eagle. After which N numbers follow, each denoting the value of the drunk quotient of every Arjit.\n\nOutput format:\nYou've to print the minimum cost of finding the one real Arjit.\n\nConstraints:\n1 = Test cases = 2\n1 = N = 105\n1 = Values of the drunk quotient = 109", "TESTCASE_1": "2\n3\n3 1 2\n4\n4 1 2 3\n###---###SEPERATOR---###---\n5\n9", "TESTCASE_2": "3\n4  1 9\n5 \n8 1  9 2 7\n4\n2 1 8 3\n###---###SEPERATOR---###---\n26\n0\n7", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}