{"Q_ID": "1416110029", "S_NAME": "Stack Implementation", "Q_NAME": "Stack 28", "Q_DESC": "Devu and Churu love to play games a lot. Today, they have an array A consisting of N positive integers. First they listed all N  (N+1) / 2 non-empty continuous subarrays of the array A on a piece of paper and then replaced all the subarrays on the paper with the maximum element present in the respective subarray.\n\nDevu and Churu decided to play a game with numbers on the paper. They both have decided to make moves turn by turn. In one turn, the player picks some number from the list and discards that number. The one who is not able to make a valid move will be the loser. To make the game more interesting, they decided to put some constraints on their moves.\n\nA constraint on a game can be any of following three types :\n\n K : They are allowed to choose numbers having values strictly greater than K only.\n K : They are allowed to choose numbers having values strictly less than K only.\n= K : They are allowed to choose numbers having values equal to K only.\nGiven M constraints and who goes first, you have to tell the outcome of each game. Print 'D' if Devu wins otherwise print 'C' without quotes.\n\nNote that M games are independent, that is, they'll rewrite numbers by using array A after each game. (This is the task for the loser of the previous game!)\n\nInput\nFirst line of input contains two space separated integers N and M denoting the size of array A and number of game played by them. Next line of input contains N space-separated integers denoting elements of array A. Each of the next M lines of input contains three space-separated parameters describing a game. First two parameter are a character C  {, , =} and an integer K denoting the constraint for that game. The last parameter is a character X  {D, C} denoting the player who will start the game.\n\nOutput\nOutput consists of a single line containing a string of length M made up from characters D and C only, where ith character in the string denotes the outcome of the ith game.\n\nConstraints:\n1 = N, M = 106\n1 = Ai, K = 109\nX belongs to {D, C}\nC belongs to {, , =}\nSubtasks:\nSubtask 1 : 1 =N, M =104 : ( 20 pts )\nSubtask 2 : 1 =N, M =105 : ( 30 pts )\nSubtask 3 : 1 =N, M =106 : ( 50 pts )", "TESTCASE_1": "4 5\n1 2 3 4\n 1 C\n 2 D\n 3 D\n= 4 C\n 5 D\n###---###SEPERATOR---###---\nDDCDC", "TESTCASE_2": "3 5\n1 2 3\n 1 D\n 2 C\n= 3 D\n 4 C\n 5 D\n###---###SEPERATOR---###---\nDCDDC", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}