{"Q_ID": "1417110031", "S_NAME": "Queue  Implementation", "Q_NAME": "Snake and Ladder using BFS queue", "Q_DESC": "Given a snake and ladder board, find the minimum number of dice throws required to reach the destination or last cell from source or 1st cell. Basically, the player has total control over outcome of dice throw and wants to find out minimum number of throws required to reach last cell.If the player reaches a cell which is base of a ladder, the player has to climb up that ladder and if reaches a cell is mouth of the snake, has to go down to the tail of snake without a dice throw.\n\nConsider the given snake and ladder board as a directed graph with number of vertices equal to the number of cells in the board. Source is cell 1 and destination is cell 30.\n\nWe construct a directed graph keeping in mind below conditions \n\n1. For any vertex in the graph v, we have an edge from v to v + 1, v + 2, v + 3, v + 4, v + 5, v + 6 as we can reach any of these nodes in one throw of dice from node v.\n\n2. If any of these neighbors of v has a ladder or snake which takes you to position x, then x becomes the neighbor instead of the base of the ladder or head of the snake.\n\nSolve the problem by finding the shortest path using Breadth First Search of the graph for a board consisting of N=30 boxes in 5*5 matrix to find the minimum number of dice throws required to reach cell 30 from cell 1.\n\nINPUT:\n\nThe first line of input consists of number of ladders in the 30 box board : L\nNext L lines, each have the vertices that are connected by ladder v1,v2(where ladder connects v1 to  v2) seperated by spaces.\nIt is followed by the number of snakes in the 30 box board : S\nNext S lines,each have the vertices that are connected by snake v3,v4(where the snake connects v3  to v4 ) seperated by spaces.\nNote: v1 is lesser than v2 and v3 is greater than v4\n\nOUTPUT:\nThe output should be the minimum number of dice throws required to reach cell 30 from cell 1.\n\nEXPLANATION:\nFor example consider the board,\n4\n3  22\n5   8\n11 26\n20  29\n4\n27 1\n21 9\n17 4\n19 7\nIt has 4 ladders and 4 snakes in the 30 box board.The minimum number of dice throws required to reach cell 30 from cell 1 is 3. Following are steps.\na) First throw two on dice to reach cell number 3 and then ladder to reach 22\nb) Then throw 6 to reach 28.\nc) Finally through 2 to reach 30.\nThere can be other solutions as well like (2, 2, 6), (2, 4, 4), (2, 3, 5).. etc.Hence,output is 3.", "TESTCASE_1": "4\n3  22\n5   8\n11 26\n20  29\n4\n27 1\n21 9\n17 4\n19 7\n###---###SEPERATOR---###---\n3", "TESTCASE_2": "3\n4 20\n25 28\n10 18\n4\n21 3\n26 2\n15 6\n17 5\n###---###SEPERATOR---###---\n3", "TESTCASE_3": "4\n4  29\n29 30\n10 18\n2 7\n4\n21 3\n26 2\n29 1\n15 6\n17 5\n###---###SEPERATOR---###---\n1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}