{"Q_ID": "1417310003", "S_NAME": "Queue Implementation", "Q_NAME": "Flood fill Algorithm using BFS", "Q_DESC": "Flood fill (also known as seed fill) is an algorithm that determines the area connected to a given node in a multi-dimensional array.It is used in the bucket fill tool of paint program to fill connected, similarly-colored areas with a different color, and in games such as Go and Minesweeper for determining which pieces are cleared. When applied on an image to fill a particular bounded area with color, it is also known as boundary fill.\n\nThe flood-fill algorithm takes three parameters: a start node, a target color, and a replacement color. Consider below matrix to the left  if start node = (3, 9), target color = BLACK and replacement color = GREY, the algorithm looks for all nodes in the matrix that are connected to the start node by a path of the target color and changes them to the replacement color.Using BFS queue-based implementation, solve the problem for a matrix 5x5.\n\nINPUT:\nThe first line of input consists of a pixel matrix 5x5  with colour numbers from 0-2 and next line consists of the value of (X ,Y) from where the flood fill starts replacing the colour at (X ,Y) and its surrounding colours by BFS with a new colour value NC which is the last line of input.\n\nOUTPUT:\nThe 5x5 pixel matrix with the colour replaced with NC at (X,Y) and surrounding values of it should be the output.", "TESTCASE_1": "1 1 1 1 1 \n1 2 1 0 0\n1 0 0 1 1\n1 2 2 2 1\n1 1 2 2 1\n3 2 \n4\n###---###SEPERATOR---###---\n1 1 1 1 1 \n1 2 1 0 0 \n1 0 0 1 1 \n1 4 4 4 1 \n1 1 4 4 1 ", "TESTCASE_2": "2 1 2 1 1 \n1 0 1 1 0\n2 1 0 1 1\n1 1 1 1 0\n1 1 2 2 1\n2 4\n7\n###---###SEPERATOR---###---\n2 1 2 7 7 \n1 0 7 7 0 \n2 7 0 7 7 \n7 7 7 7 0 \n7 7 2 2 1 ", "TESTCASE_3": "2 0 2 1 1 \n1 0 0 1 2\n2 1 0 1 1\n0 0 0 1 0\n0 1 2 2 1\n0 1\n5\n###---###SEPERATOR---###---\n2 5 2 1 1 \n1 5 5 1 2 \n2 1 5 1 1 \n5 5 5 1 0 \n5 1 2 2 1 ", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}