{"Q_ID": "1417210014", "S_NAME": "Queue Implementation", "Q_NAME": "Little Monk and Virat", "Q_DESC": "Little Monk also met who he thinks is the new God of Indian cricket: Virat Kohli. Now Monk is extremely fond of Kohli -- not just as a T20 player, but a player in all formats. He loves the statistics involved in Kohli's career.\n\nLittle Monk knows that Kohli has played N matches in all three formats of his career, ODI, T20 and Test Cricket. He wants to show-off his knowledge about Kohli's career so he decides to answer Q questions asked by Kohli. Kohli gives the Monk three different arrays with N numbers each denoting the runs in the ith ODI match, ith Test Match and ith T-20 match respectively.\n\nThe value of Kohli's ith match would be the sum of his score in the ith T-20 match, ith Test match and ith ODI match. Kohli knows that Monk is extremely quick at finding the k th smallest value of all his innings, so he twists his query a bit. He asks the Monk to delete the kth smallest value once that is answered by the Monk. If Kohli comes up with a number k which is greater than the number of matches remaining in Kohli's career, the Monk should say that the answer is 1.\n\nSo much complication confuses the Little Monk and he asks for your help!Use priority queue and solve the problem.\n\nINPUT:\nThe first line contains an integer N, which denotes the number of matches played by Virat Kohli. The next three lines contain N integers each denoting the number of runs scored in ODI, T20 and Test respectively. The next line contains an integer Q, denoting the number of questions Virat is going to ask. The next Q lines contain an integer K, denoting the Kth smallest value which the Monk has to answer.\n\nOUTPUT:\nPrint answer to each query in a new line. In case of an invalid query, print 1.\n\nEXPLANATION:\nConsider the input as:\n5\n1 2 3 4 5\n1 2 3 4 5\n1 2 3 4 5\n3\n1\n3\n11\nThe N values are: 3, 6, 9, 12, 15. So, the first smallest is 3, and now the new value array is: 6, 9, 12, 15, so the third smallest value now is 12. In the third query is invalid because the value array contains only 3 numbers, and we're asking the Monk to find the 11th smallest number, so the answer is 1.\nThe output should be:\n3\n12\n-1", "TESTCASE_1": "5\n1 2 3 4 5\n1 2 3 4 5\n1 2 3 4 5\n3\n1\n3\n11\n###---###SEPERATOR---###---\n3\n12\n-1", "TESTCASE_2": "7\n20 70 50 43 47 35 56\n10 50 60 73 97 135 46\n120 60 60 83 67 85 76\n4\n2\n4\n6\n1\n###---###SEPERATOR---###---\n170\n199\n-1\n150", "TESTCASE_3": "9\n120 170 50 43 47 35 56 100 98\n10 50 60 73 97 135 46 89 45\n120 60 60 83 67 85 76 23 7\n6\n1\n4\n5\n2\n1\n8\n###---###SEPERATOR---###---\n150\n211\n250\n178\n170\n-1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}