{"Q_ID": "1417310001", "S_NAME": "Queue Implementation", "Q_NAME": "Long ATM Queue ", "Q_DESC": "Due to the demonetization move, there is a long queue of people in front of ATMs. Due to withdrawal limit per person per day, people come in groups to withdraw money. Groups come one by one and line up behind the already present queue. The groups have a strange way of arranging themselves. In a particular group, the group members arrange themselves in increasing order of their height(not necessarily strictly increasing).\nSwapy observes a long queue standing in front of the ATM near his house. Being a curious kid, he wants to count the total number of groups present in the queue waiting to withdraw money. Since groups are standing behind each other, one cannot differentiate between different groups and the exact count cannot be given. Can you tell him the minimum number of groups that can be observed in the queue?\n\nINPUT:\nThe first line of input contains one positive integer N. The second line contains N space-separated integers H[i] denoting the height of i-th person. Each group has group members standing in increasing order of their height.\n\nOUTPUT:\nPrint the minimum number of groups that are at least present in the queue.\n\nEXPLANATION:\nConsider the input:\n4\n1 2 3 4\nIn the second test case, Swapy observes all the people standing in increasing order of their height so at least one group is observed. Though it might be that 1st and 2nd came together and 3rd and 4th person came together but Swapy cannot differentiate.In the third test case, he observes all the people standing in decreasing order of their height, hence it is certain that all of them came separately, so at least three groups are observed.Hence,the output will be 1.", "TESTCASE_1": "4\n1 2 3 4\n###---###SEPERATOR---###---\n1", "TESTCASE_2": "7\n130 135 145 169 155 159 148\n###---###SEPERATOR---###---\n3", "TESTCASE_3": "9\n140 149 167 175 155 145 170 182 165 \n###---###SEPERATOR---###---\n4", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}