{"Q_ID": "1417310012", "S_NAME": "Queue Implementation", "Q_NAME": "Mr Swegwan and His GirlFriends", "Q_DESC": "Now you must have come across the sweg of Mr. Swegwan, so is the case with girls. So it is pretty obvious that he has many girlfriends. But Mr Swegwan is a very busy man and does not talk to all of his girlfriends at the same time. He stores the information about which girlfriend to talk to and which girlfriend to not talk to, in a string (1 indexed). Also he has assigned a unique id to each of his girlfriend and this id corresponds to the the index of the string assigned to that girlfriend. For instance, if the id = 3 then the third location in the string corresponds to this girlfriend. Now in the string there are two types of characters, X and O. \n\nX - If this is present, it indicates that Mr. Swegwan talks to that girlfriend.\n\nO - If this is present, it indicates that Mr. Swegwan does not talk to that girlfriend.\n\nNow, Mr. Swegwan is a very flicker-minded person and keeps on changing his string i.e. the girl he wants to talk to. These changes are done in form of update operation. He performs a total of k update operations. In each update he takes three integers a, L, R. L and R correspond to the left and right limit (both inclusive) in the string for that update operation. This means that if L = 2 and R = 6 for a particular case then in that particular update operation only the string characters from index 2 to 6 are updated. Now, a denotes the type of update operation. Update operation are of two types:\n\na=1 : Type 1 - All the characters in that range become X\n\na=2 : Type 2 - All the characters in that range become O\n\nAfter a series of these update operations Mr. Swegwan now wants to know the minimum number of toggles required in order to transform the string such that all the X if they occur, occur in the beginning. This implies that during the transformation the number of X and O may change but the length of the string remains the same.\n\nNote: Input string is 1 indexed.\n Input\nFirst line of input contains T, the number of test cases.\n\nThe description of a test case starts with a input string.\n\nFollowed by the string is, k, the number of update operations.\n\nThis is followed by k lines each consisting of three integers a,L,R.\n Output\nFor each test case, output a single integer, the answer that Mr. Swegwan requires.\n", "TESTCASE_1": "1\nXOXO\n2\n2 1 2\n1 3 4\n###---###SEPERATOR---###---\n2", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}