{"Q_ID": "1417210026", "S_NAME": "Queue Implementation", "Q_NAME": "Little Monk and Goblet of Fire", "Q_DESC": "Albus Dumbledore announced that the school will host the legendary event known as Wizard Tournament where four magical schools are going to compete against each other in a very deadly competition by facing some dangerous challenges. Since the team selection is very critical in this deadly competition. Albus Dumbledore asked Little Monk to help him in the team selection process. There is a long queue of students from all the four magical schools. Each student of a school have a different roll number. Whenever a new student will come, he will search for his schoolmate from the end of the queue. As soon as he will find any of the schoolmate in the queue, he will stand behind him, otherwise he will stand at the end of the queue. At any moment Little Monk will ask the student, who is standing in front of the queue, to come and put his name in the Goblet of Fire and remove him from the queue. There are QQ operations of one of the following types:\n Exy: A new student of school x (1x4) whose roll number is y(1y50000) will stand in queue according to the method mentioned above.\n D: Little Monk will ask the student, who is standing in front of the queue, to come and put his name in the Goblet of Fire and remove him from the queue\nNow Albus Dumbledore asked Little Monk to tell him the order in which student put their name. Little Monk is too lazy to that so he asked you to write a program to print required order.\nNote: Number of dequeue operations will never be greater than enqueue operations at any point of time.\nInput Format:\nFirst line contains an integer Q (1Q100000), denoting the number of operations. Next Q lines will contains one of the 2 types of operations.\nOutput Format:\nFor each 2nd type of operation, print two space separated integers, the front student's school and roll number.\n", "TESTCASE_1": "5\nE 1 1\nE 2 1\nE 1 2\nD\nD\n###---###SEPERATOR---###---\n1 1\n1 2", "TESTCASE_2": "8\nE 3 1\nD\nE 3 1\nE 3 2\nE 2 1\nD\nD\n###---###SEPERATOR---###---\n3 1\n3 1\n3 2\n2 1", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}