{"Q_ID": "1417210015", "S_NAME": "Queue Implementation", "Q_NAME": "Little Monk and Steve Smith", "Q_DESC": "Little Monk knows what a dangerous batsman the captain of Australia, Steven Smith is. The bigger problem is that Monk and his team have no idea about the weakness of Smith. But their coach tells them Smith's trick of scoring runs. His trick is pretty simple: he is going to score maximum runs off bowlers who have minimum balls left to be bowled.\n\nFor instance, if there are three bowlers -- with 10, 11, 6 balls left respectively in their quota, then Smith would be able to score maximum runs off bowler number 3, then bowler number 1 and then bowler number 2. Let's say bowler 2 bowls the first ball so he'll also have 10 balls remaining, similar to bowler number 1. Now bowler 2 and bowler 1 are on the same number of balls remaining, any of them can bowl the next delivery. But, Monk as the captain in such a case prefers the bowler with in order of occurrence. So, the next ball will be bowled by bowler 1.So as the captain of the team, Monk needs to know the order of bowlers so that Smith scores minimum runs possible off the K balls he is going to face!\nNote: None of the bowlers can get Steven Smith out. Also, they are not allowed to bowl once their number of deliveries left is 0.Use priority queue and solve the problem.\n\nINPUT:\nThe first line contains two integers N and K, which denote the number of bowlers faced by Smith and the total number of balls Smith is going to play. The next line contains N space separated integers denoting the quota of each bowler.\n\nOUTPUT: \nPrint K space separated integers denoting the order of the bowlers chosen by Monk. The bowlers are 1-indexed.\n\nEXPLANATION:\nConsider the input to be:\n3 6\n6 6 6\nInitially, every bowler has 6 balls. So, the first bowler bowls his ball. And now he has 5 balls remaining. So, the next highest bowler, that is, bowler number 2 bowls the next delivery and so on.The output will be : 1 2 3 1 2 3 ", "TESTCASE_1": "3 6\n6 6 6\n###---###SEPERATOR---###---\n1 2 3 1 2 3 ", "TESTCASE_2": "5  15\n2 5 1 5 2\n###---###SEPERATOR---###---\n2 4 2 4 2 4 1 2 4 5 1 2 3 4 5 ", "TESTCASE_3": "5 25\n12 12 40 24 32\n###---###SEPERATOR---###---\n3 3 3 3 3 3 3 3 3 5 3 5 3 5 3 5 3 5 3 5 3 5 3 5 3 ", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}