{"Q_ID": "1417110028", "S_NAME": "Queue  Implementation", "Q_NAME": "Monk and Goblet of Fire using queues", "Q_DESC": "Albus Dumbledore announced that the school will host the legendary event known as Wizard Tournament where four magical schools are going to compete against each other in a very deadly competition by facing some dangerous challenges. Since the team selection is very critical in this deadly competition. Albus Dumbledore asked Little Monk to help him in the team selection process. There is a long queue of students from all the four magical schools. Each student of a school have a different roll number. Whenever a new student will come, he will search for his schoolmate from the end of the queue. As soon as he will find any of the schoolmate in the queue, he will stand behind him, otherwise he will stand at the end of the queue. At any moment Little Monk will ask the student, who is standing in front of the queue, to come and put his name in the Goblet of Fire and remove him from the queue. There are Q operations of one of the following types:\n\n(1) E x y : A new student of school x ( where x is between 1 & 4) whose roll number is y will stand in queue according to the method mentioned above.\n(2) D  : Little Monk will ask the student, who is standing in front of the queue, to come and put his name in the Goblet of Fire and remove him from the queue. Now, Albus Dumbledore asked Little Monk to tell him the order in which student put their name. Little Monk is too lazy to that so he asked you to write a program to print required order.\n\nNote: Number of dequeue operations will never be greater than enqueue operations at any point of time.\n\nINPUT:\nFirst line contains an integer Q denoting the number of operations. Next Q lines will contains one of the 2 types of operations.\n\nOUTPUT:\nFor each 2nd type of operation, print two space separated integers, the front student's school and roll number.\n\nEXPLANATION:\nConsider the input,\n5\nE 1 1\nE 2 1\nE 1 2\nD\nD\n\nAfter the first operation, student of 1st school with roll number 1, will stand in the front of the queue as the queue is empty initially.\nAfter second operation, student of 2nd school with roll number 1, will stand behind the first student as there is no other member of the same in the queue.After third operation, student of 1st school with roll number 2, will stand behind the member of his school in the queue.After fourth operation, the student in the front will put his name in the Goblet of Fire and move out of the queue.After fifth operation, the student in the front will put his name in the Goblet of Fire and move out of the queue.Hence, the ouput will be:\n1 1\n1 2", "TESTCASE_1": "5\nE 1 1\nE 2 1\nE 1 2\nD\nD\n###---###SEPERATOR---###---\n1 1\n1 2", "TESTCASE_2": "7\nE 1 10\nE 4  2\nE 3  1\nD\nE 4 1\nD\nD\n###---###SEPERATOR---###---\n1 10\n4 2\n4 1", "TESTCASE_3": "10\nE 1 10\nE 4  2\nE 3  1\nE 3  4\nE 1 3\nD\nE 4 1\nD\nD\nD\n###---###SEPERATOR---###---\n1 10\n1 3\n4 2\n4 1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}