{"Q_ID": "1417210007", "S_NAME": "Queue  Implementation", "Q_NAME": "Little Monk and Williamson", "Q_DESC": "Little Monk is a huge cricket fan, so he decides that he'll meet his five favorite cricketers in this problem-set of heaps and priority queues. And he'll try to impress them. The first cricketer he wants to impress is: Kane Williamson. He asked Kane to answer some queries in a press interview. Kane is irritated by Little Monk's constant interruption during his interview, so he decides to give Monk a run for his money by asking him the answer to various queries.\n\nWilliamson will give a query of the types mentioned below, to the Monk and will expect him to answer those.\n\n-Push X --Insert Williamson's score in an array(Query type1)\n-Diff -- Find out the difference between Willamson's current highest and current lowest score, currently present in the array. And then remove a singular instance of those values from the array.(Query type 2).In case, the current lowest and current highest score are same, then only one instance of that score will be removed from the array.\n-CountHigh -- Find out the number of times Williamson has scored his current highest score, currently present in array.(Query type 3)\n-CountLow -- Find out the number of times Williamson has scored his current lowest score, currently present in array.(Query type 4)\n\nINPUT:\nThe first line contains an integer Q, which denotes the number of queries which have to be dealt by The Monk. The next Q lines will contain a query like the ones mentioned above.\n\nOUTPUT:\nFor the query type 2, 3 and 4, print the answer in a new line. If there is no record of any innings, that is, the array of Williamson's score is empty for query type 2, 3 and 4, then print 1.\n\nEXPLANATION:\nConsider the input:\n10\nCountHigh\nPush 442\nCountHigh\nPush 7555\nDiff\nPush 2799\nDiff\nPush 8543\nDiff\nDiff\nSince there's no score currently, the answer to the first query is1. Then we insert 442 runs as Williamson's score. Since there's only one instance of 442 and that is the highest number in the array, CountHigh would be 1. Then we insert 7555 as Williamson's next score. Then, the difference is 7113 and that means 442 and 7555 are also removed from the array. After pushing 2799, and finding out the difference would be 0 since the highest and the lowest score is same. For the last Diff query, since there is no number in the array, the answer would be 1.\nHence,the output is:\n-1\n1\n7113\n0\n0\n-1", "TESTCASE_1": "10\nCountHigh\nPush 442\nCountHigh\nPush 7555\nDiff\nPush 2799\nDiff\nPush 8543\nDiff\nDiff\n###---###SEPERATOR---###---\n-1\n1\n7113\n0\n0\n-1", "TESTCASE_2": "10\nPush 312\nCountHigh\nPush 6445\nDiff\nPush 3478\nDiff\nCountHigh\nDiff\nPush 8543\nDiff\n###---###SEPERATOR---###---\n1\n6133\n0\n-1\n-1\n0", "TESTCASE_3": "15\nPush 2456\nCountHigh\nPush 6445\nPush 3478\nDiff\nPush 7653\nDiff\nDiff\nCountHigh\nPush 9243\nDiff\nPush 8543\nDiff\nCountHigh\nDiff\n###---###SEPERATOR---###---\n1\n3989\n4175\n-1\n-1\n0\n0\n-1\n-1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}