{"Q_ID": "1417210006", "S_NAME": "Queue  Implementation", "Q_NAME": "Monk and Power of Time", "Q_DESC": "The Monk is trying to explain to its users that even a single unit of time can be extremely important and to demonstrate this particular fact he gives them a challenging task.There are N processes to be completed by you, the chosen one, since you're Monk's favorite student. All the processes have a unique number assigned to them from 1 to N.\nNow, you are given two things:\n-The calling order in which all the processes are called.\n-The ideal order in which all the processes should have been executed.\nNow, let us demonstrate this by an example. Let's say that there are 3 processes, the calling order of the processes is: 3 - 2 - 1. The ideal order is: 1 - 3 - 2, i.e., process number 3 will only be executed after process number 1 has been completed; process number 2 will only be executed after process number 3 has been executed.\nIteration #1: Since the ideal order has process #1 to be executed firstly, the calling ordered is changed, i.e., the first element has to be pushed to the last place. Changing the position of the element takes 1 unit of time. The new calling order is: 2 - 1 - 3. Time taken in step #1: 1.\n\nIteration #2: Since the ideal order has process #1 to be executed firstly, the calling ordered has to be changed again, i.e., the first element has to be pushed to the last place. The new calling order is: 1 - 3 - 2. Time taken in step #2: 1.\n\nIteration #3: Since the first element of the calling order is same as the ideal order, that process will be executed. And it will be thus popped out. Time taken in step #3: 1.\n\nIteration #4: Since the new first element of the calling order is same as the ideal order, that process will be executed. Time taken in step #4: 1.\n\nIteration #5: Since the last element of the calling order is same as the ideal order, that process will be executed. Time taken in step #5: 1.\n\nTotal time taken: 5 units. Note: Executing a process takes 1 unit of time. Changing the position takes 1 unit of time.\n\nINPUT:\nThe first line a number N, denoting the number of processes. The second line contains the calling order of the processes. The third line contains the ideal order of the processes.\n\nOUTPUT:\nPrint the total time taken for the entire queue of processes to be executed.", "TESTCASE_1": "3\n3 2 1\n1 3 2\n###---###SEPERATOR---###---\n5", "TESTCASE_2": "4\n4 2 3 1\n1 3 2 4\n###---###SEPERATOR---###---\n10", "TESTCASE_3": "10\n1 4 5 6 2 3 7 8 9 10\n1 6 5 4 2 3 7 8 10 9\n###---###SEPERATOR---###---\n26", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}