{"Q_ID": "1417110024", "S_NAME": "Queue  Implementation", "Q_NAME": "Monk and IQ using priority queue", "Q_DESC": "Monk and his P-1 friends recently joined a college. He finds that N students have already applied for different courses before him. Courses are assigned numbers from 1 to C. He and his friends will follow the following conditions when choosing courses:\n\nThey will choose the course i (1 = i = C), for which the value of z is minimum. Here, z = x*c where c is the number of students already enrolled in the course i and x is the sum of IQ of the last two students who enrolled in that course. If a single student has applied for a course, then the value of x will be that student's IQ. If no student has enrolled for that course, then value of x will be 0. If the value of z is same for two courses, then they will choose the course with the minimum course number. You need to find which courses Monk and his friends should take after following the above conditions.\n\nNote: Each of them will choose their courses, one at a time. Monk will choose his course first followed by his friends.Use priority queues for finding the solution.\n\nINPUT:\nThe first line contains the numbers C, P and N where C denotes the number of courses in that college, P denotes Monk and his friends and N denotes the number of students who have already applied for the courses.\nThe next line consists of N space separated integers Y[i] which denotes the IQ of the ith student. Here, the ith student chooses the ith course. \nThe next line consists of P space separated integers X[i] which denotes the IQ of Monk and his friends.\n\nOUTPUT:\nPrint P space separated integers in a line which denotes the course number which Monk and his friends have applied for.\n\nEXPLANATION:\nFor input,\n5 4 4\n2 8 5 1\n9 10 5 1\n\nIn the sample test case, the last course has not been applied by anyone. So, its sum will be 0 initially. Hence, Monk will apply there(5th course)as the value of z = 0.\nNow Monk's first friend will apply for the 4th course as its value of z = 1, which is minimum of all the four courses.\nMonk's second friend will apply for the 1st course as its value of z = 2, which is minimum of all the four courses.\nSimilarly, Monk's third friend will apply for the 3rd course as its value of z = 5, which is minimum of all the four courses.\nThe output is 5 4 1 3.", "TESTCASE_1": "5 4 4\n2 8 5 1\n9 10 5 1\n###---###SEPERATOR---###---\n5 4 1 3", "TESTCASE_2": "7 5 6\n6 5 2 1 5 7\n10 9 5 7 8\n###---###SEPERATOR---###---\n7 4 3 2 5", "TESTCASE_3": "7 7 3\n6 4 2 \n10 9 8 7 8 9 10\n###---###SEPERATOR---###---\n4 5 6 7 3 2 1", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}