{"Q_ID": "1417210025", "S_NAME": "Queue Implementation", "Q_NAME": "Monk Celebrating Checkpoint", "Q_DESC": "Monk is feeling happy to reach the first checkpoint in his journey. in order to have fun, he asked Mishki to solve a problem for him.\nShe will be given an array of N distinct elements, and needs to perform at most X arbitrary operations. In each operation she can select any element from the array and can increase it by exactly 1. She can perform at max 1 operation over any element of the array.\nThe special thing about this array is that, for any 2 elements (A[i],A[j]), where (ij), abs(A[i]A[j])K, where  abs(x) denotes the absolute value of any integer x.\nNow, we define 3 functions :\nF(i,j): =  Max(i,j)Min(i,j)\nMax(i,j) = Maximum element present in the sub array ranging from i,i+1...j in array A.\nMin(i,j) = Minimum element present in the sub array ranging from i,i+1..j in array A.\nMishki needs to perform exactly X operations, and then needs to tell Monk the following :\nanswer = i=1Nj=iN(F(i,j))  {Summation i=1 to N then Summation j=1 to N of F(i,j) }\nIn short, she needs to tell Monk the summation of the difference between the maximum and minimum element of each sub array of array A . Considering Mishki performs the X operations given to her optimally what is the maximum value of answer that she can achieve ?\nHelp Mishki for the same.\nInput Format :\nThe first line will consists of 3 space separated integers N, X and K , denoting the number of elements in the array, operations needs to be performed and minimum absolute difference between any 2 elements of the array respectively.\nIn next line, there will be N space separated integers, A[i] , where 1iN, denoting the elements of array.\nOutput Format\nPrint the required maximum possible maximum value of answer.\n", "TESTCASE_1": "3 1 2\n2 4 6\n###---###SEPERATOR---###---\n10", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}