{"Q_ID": "1417210009", "S_NAME": "Queue  Implementation", "Q_NAME": "CGPA Priority Queue ", "Q_DESC": "A priority queue is an abstract data type which is like a regular queue, but where additionally each element has a priority associated with it. In a priority queue, an element with high priority is served before an element with low priority. \n\nYou have to deal with  types of events: ENTER (a student enters the queue) or SERVED.A unique token is assigned to any student entering the queue. The queue serves the students based on the following criteria:\n-The student having the highest Cumulative Grade Point Average (CGPA) is served first.\n-Any students having the same CGPA will be served by name in ascending case-sensitive alphabetical order.\n-Any students having the same CGPA and name will be served in ascending token order.\nGiven a sequence of events, print the names of students who are yet to be served(based on above criteria). If the queue is empty, print EMPTY.\nNote: CGPA can be between 0 and 4.00\n\nINPUT:\nThe first line contains an integer, N,denoting the total number of events. Each of the  subsequent lines will be of the following two forms:\n-ENTER name CGPA token - The student to be inserted into the priority queue.\n-SERVED - The highest priority student in the queue was served.\n\nOUTPUT:\nPrint the names (based on the criteria) of the students who are not served at all after executing all  events; if every student in the queue was served, then print EMPTY.\n\nEXPLANATION:\nConsider the input as:\n12\nENTER John 3.75 50\nENTER Mark 3.8 24\nENTER Shafaet 3.7 35\nSERVED\nSERVED\nENTER Samiha 3.85 36\nSERVED\nENTER Ashley 3.9 42\nENTER Maria 3.6 46\nENTER Anik 3.95 49\nENTER Dan 3.95 50\nSERVED\nLet's call our queue: Q, We add John to the empty queue. We add Mark to the queue; We add Shafaet to the queue; Mark is served as he has the highest CGPA; John is served next as he has the highest CGPA; We add Samiha to the queue; Samiha is served as she has the highest CGPA; the next four students are added giving us: Anik is served because though both Anil and Dan have the highest CGPA but Anik comes first when sorted in alphabetic order; As all events are completed, we print names of each remaining students on a new line.\nThe output will be:\nDan\nAshley\nShafaet\nMaria", "TESTCASE_1": "12\nENTER John 3.75 50\nENTER Mark 3.8 24\nENTER Shafaet 3.7 35\nSERVED\nSERVED\nENTER Samiha 3.85 36\nSERVED\nENTER Ashley 3.9 42\nENTER Maria 3.6 46\nENTER Anik 3.95 49\nENTER Dan 3.95 50\nSERVED\n###---###SEPERATOR---###---\nDan\nAshley\nShafaet\nMaria", "TESTCASE_2": "10\nENTER Zucker 3.51 40\nENTER Larry  3.76 28\nENTER Shah  3.56 33\nSERVED\nENTER Sami 3.85 36\nSERVED\nSERVED\nENTER Ram 3.6 46\nENTER Mario 3.54 40\nSERVED\n\n###---###SEPERATOR---###---\nMario\nZucker", "TESTCASE_3": "12\nENTER Larry  3.76 28\nSERVED\nENTER Shah  3.56 33\nSERVED\nSERVED\nENTER Sami 3.85 36\nENTER Ram 3.6 36\nSERVED\nENTER Mario 3.74 40\nSERVED\nSERVED\nSERVED\n\n###---###SEPERATOR---###---\nEMPTY", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}