{"Q_ID": "1417310008", "S_NAME": "Queue Implementation", "Q_NAME": "Chinky and diamonds ", "Q_DESC": "One day Chinky was roaming around the park and suddenly she found N bags with diamonds.\nThe i'th of these bags contains Ai diamonds. She felt greedy and started to pick up the bag very fastly. But due to quick movement, she drops it on the ground. But as soon as she drops the bag, a genie appears in front of her and he increases the number of diamonds in the bag suddenly!\nNow the bag which was used to contain P diamonds(before picking up), now contains [P/2] diamonds, where [p] is the greatest integer less than p. Then genie gave her the time K minutes in which she can take as many as diamonds. In a single minute , she can take all the diamonds in a single bag, regardless the number of diamonds in it. Find the maximum number of diamonds that Chinky can take with her.Using heaps and priority queue, solve the problem.\n\nINPUT:\nFirst line contains an integer T. T test cases follow.\nFirst line of each test case contains two space-separated integers N and K.\nSecond line of each test case contains N space-separated integers,the number of diamonds in the bags.\n\nOUTPUT:\nPrint the answer to each test case in a new line.\n\nExample:\nInput:                                            \n1\n5 3\n2 1 7 4 2\nOutput:\n14\n\nEXPLANATION:\n\nThe state of bags is:\n2 1 7 4 2\nChinky takes all diamonds from Third bag (7). The state of bags becomes:\n2 1 3 4 2 \nChinky takes all diamonds from Fourth bag (4). The state of bags becomes:\n2 1 3 2 2\nChinky takes all diamonds from Third bag (3). The state of bags becomes:\n2 1 1 2 2 \nHence, the Chinky takes 7+4+3= 14", "TESTCASE_1": "1\n5 3\n2 1 7 4 2\n###---###SEPERATOR---###---\n14", "TESTCASE_2": "2\n6 2\n5 3 8 7 2 9\n5 3\n10 23 40 14 5\n###---###SEPERATOR---###---\n17\n83", "TESTCASE_3": "3\n6 4\n12 34 56 78 45 23\n3 1\n21 43 56\n5 2\n67 54 32 12 32\n###---###SEPERATOR---###---\n218\n56\n121", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}