{"Q_ID": "1418210008", "S_NAME": "Tree", "Q_NAME": "Chris and BST", "Q_DESC": "Chris as always has brought a new task for Fredo. He asks Fredo to create a Binary Search Tree (BST) with L levels and 2^L1 nodes. Let the sum of all node values in the BST be M. He further adds that M should be smallest possible integer greater than S, where S is an integer given by Chris. He states the rules of creating BST as follows:\n\nThe left sub-tree contains only nodes with values less than or equal to the parent node; the right sub-tree contains only nodes with values greater than the parent node.\nIf a node has level i, then the subtree rooted at that node should have exactly 2^Li number of distinct values in the subtree. Note that it is the number of distinct values in the subtree and not the number of nodes in the subtree.\nIf a is the smallest value in the tree and b is the largest value, then all values from a to b must come atleast once in the tree.\nLevel of root is 1, next level is 2 and so on.\n\nNow, he will ask two type of queries to Fredo.\nType 0: Find the closest node to root whose value is equal to val and print path to that node from the root. If root has value equal to val, print root. Else print l when we visit left child of any node and r when we visit right child of any node. \nType 1: Tell the value of kth node in the tree. The nodes are numbered as:\n\nenter image description here\nHere 1,2 and so on are node numbers and A,B etc. are values of nodes.\n\nFinally, he will ask Fredo \nQ queries, each query belonging to one of the types mentioned above. Since, Fredo is new to this concept, help him complete this task.\n\nInput Format:\nFirst line consists of two integers L and S as described in the question.\nSecond line consists of Q, denoting the number of queries.\nEach of the following Q lines consists of two integers. The first integer denoting the type of query and second denoting either val or k as described in the queries.\n\nOutput Format:\nFor each query, print the required answer in a separate line.\n\nInput Constraints:\n1L30\n1S10^18\n1Q10^5\n0type1\n1k2^L1\nval is in between minimum and maximum value in tree(inclusive).\nValues of S, val and k are such that answer would always exist for them.\nNode values will be non-negative for all inputs. \nM will never exceed \n210^18", "TESTCASE_1": "3 16\n5\n0 3\n0 4\n1 4\n1 7\n0 5\n###---###SEPERATOR---###---\nroot\nr\n2\n5\nrr", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}