{"Q_ID": "1418110106", "S_NAME": "Tree", "Q_NAME": "Chef and his best friend", "Q_DESC": "Chef and Chhotu are best friends. Chef knows that Chhotu is very intelligent. So, Chef gives Chhotu a simple problem and wants him to solve this problem by today. The problem is as follows.\n\nThere are N students in a classroom. The students are sitting in a single row. Chef wants that all the girls should sit in left side of the row and all the boys should sit in right side of the row. You are provided the initial row of the students by N binary integers, where if i-th integer is zero, then it means that at the i-th position, there is a boy, where 1 will mean girl. For example, if the initial arrangement be [0 1 0 1 1], then final arrangement should be [1 1 1 0 0].\n\nIn a single second, if a boy finds that a girl is sitting to his immediate right i.e. if a boy is sitting at ith position and a girl is sitting at (i+1)th position then they swap their positions. For example, let the initial arrangement be [0 1 0 1 1]. Boys are sitting at positions 1, 3 (1-based indexing) and girls are sitting at positions 2, 4, 5. In a single second, boy at position 1 swaps his seat with girl at position 2, and similarly boy at position 3 swaps his seat with girl at position 4. So, after one second, the arrangement becomes [1 0 1 0 1].\n\nFor detailed explanation, please see the explanation of the sample provided at the end of this statement.Now Chef wants to determine the total time after which all the girls move to the left side of the row and all the boys towards the right side of the row.\nChhotu can solve this problem very easily but today he is very busy. Please help Chhotu to solve this problem.\n\nInput:\n\nThe first line of the input contains T denoting the number of test cases. The description of T test cases follows.\n\nThe first line of each test case contains an integer N denoting the number of students in the row.\n\nThe second line contains N space-separated integers - A1, A2, ..., AN denoting the initial arrangement of the students.\n\nOutput\nFor each test case, output a single integer on a new line corresponding to the number of seconds required such that all girls are to the left of boys.", "TESTCASE_1": "2\n10\n0 1 1 1 0 1 1 0 1 1\n5\n0 1 0 1 1\n###---###SEPERATOR---###---\n7\n3", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}