{"Q_ID": "1418210004", "S_NAME": "Tree", "Q_NAME": "The Silly Snail", "Q_DESC": "Silly Snail was a very intelligent snail on Snail Island. In order to get eligible for marriage, he had to pass the Graduation Exam conducted by C.B.S.E ( Central Board of Snail Education ). Seeing the intelligence level of the Silly Snail, the head of C.B.S.E decided to conduct the exam himself. Silly Snail performed very well in all the levels of the exam but got stuck on the last one.\n\nAt the final level of the exam, the Head of C.B.S.E sent him to one of the the Silly trees and Silly Snail's task was to report all the fruits on the tree in a specific way. Silly tree was a very special tree which had fruits of various colors. Even the smallest Silly trees have a fruit with color 1. As the tree grows larger, two more fruits with unique colors get attached to some existing fruit of the tree as Fruit left and Fruit right. Silly Snail has to travel the Silly Tree in a very specific way and report the answer at the end.\n\nA fruit with color 1 is assumed to be present on every Silly Tree. Silly Sail starts with color 1 and notes it down. On reaching any fruit, he notes down its color and then moves to the left part of the tree. on completing the entire left sub-tree, he moves to the right subtree and does the same. Refer the sample test cases for more clarity.\n\nWhile he was going to submit the answer sheet, the sheet was blown away by wind. You need to help the Silly Snail generate all the answers without traveling the entire tree again.\n\nINPUT :\nthe first line of the input contains the number of test cases. The first line of each test case consists of a single integer n ( the number of relations describing the tree ). n lines follow describing the n relations. Each relation has 3 space separated integers X, Y and Z. X is some existing fruit on the tree. Y and Z are the colors of the left fruit and right fruit of X respectively. If Y or Z = 0, it implies that X has no left fruit or right fruit respectively.\n\nOUTPUT :\nYou need to display all the fruit colors on the Silly Tree in the described manner.\n\nCONSTRAINTS :\n1<=t<=50\n0<=n<=100000\n2<=Y,Z<=100000\n1<=X<=100000", "TESTCASE_1": "2\n7\n1 7 3\n7 9 14\n3 10 5\n9 6 12\n14 8 4\n10 2 0\n5 11 0\n4\n1 11 13\n11 14 7\n14 5 9\n7 6 4\n###---###SEPERATOR---###---\n1 7 9 6 12 14 8 4 3 10 2 5 11 \n1 11 14 5 9 7 6 4 13", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}