{"Q_ID": "1418210016", "S_NAME": "Tree", "Q_NAME": "Michael in the Grass Fields", "Q_DESC": "Michael, high on excitement after solving the rest of the problems , goes on a trek in the mountains . \nOn his way, he encounters Janemba, the evil magician! Janemba takes our Michael to a poison field and plays a game with him described as follows: \nThe poison field is described as NxN matrix,divided into N * N cells. Each cell of the field has a value of discomfort in it pertaining to the poison content. Michael has been cursed with K curses. In each curse, Michael must do one of the following: \n\n1) Choose one row of the field and consume the poisonous fumes from all the cells in that row. The discomfort caused is the sum of discomfort from each cell in the row. After consuming, the discomfort of all cells in the row increases by one. \n2) Choose one column of the field and consume the poisonous fumes from all the cells in that column. The discomfort caused is the sum of discomfort from each cell in the column. After consuming, the discomfort of all cells in the column increases by one. \n\nOur Michael has a level of tolerance. A very high level of discomfort will cause him to die! \nHelp him out by finding the Minimum discomfort possible by optimally completing the curses.\n\nInput:\nFirst line contains T, the number of test cases. T test cases follow. \nFirst line of each test case contains two space separated integers N and K. N lines follow. Each of the lines contains N space-separated integers representing Mij, the value of discomfort of cells in that row.\n\nOutput: \nFor each test case, output the minimum discomfort possible in a new line.\n\nConstraints:\n1  T  100\n1  N  200\n1  K  400\n1  Mij  1000", "TESTCASE_1": "4\n2 1\n1 3\n2 4\n2 2\n1 3\n2 4\n2 3\n1 3\n2 4\n2 4\n1 3\n2 4\n###---###SEPERATOR---###---\n3\n8\n14\n22", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}