{"Q_ID": "1418310004", "S_NAME": "Tree", "Q_NAME": "Rebuild", "Q_DESC": "All roads of Byteland have been destroyed by a recent epic fight between good and evil. Unfortunately, the citizens need to get back to work and need to rebuild their road network.\n\nThere are n interesting points in the city, and there are m proposals for roads to build between the points. The i-th proposal is to build an undirected road between the ai-th point and the bi-th point with a cost of ci.\n\nThe city would like to build a set of roads such that it's possible to go from any one interesting point to any other interesting point through some series of built roads. They know that at least one such set of roads exists. If there are multiple sets of roads that satisfy the condition, they would like to find a set that minimizes the total cost of roads built. If there are multiple sets with minimum total cost, they will break ties in a process described in the next paragraph.\n\nIn the process of rebuilding, the city would also like to lower congestion in some points. More specifically, if there are multiple sets of roads with the same minimum cost, they would like to choose a set that minimizes the number of roads incident to the first interesting point (while keeping the cost minimum). If there are still ties, they would like to minimize the number of roads incident to the second interesting point (while keeping the cost and the number of roads incident to the first interesting point to be small). This continues on until the last interesting point.\n\nMore formally, we can say the degree sequence of a set of roads is the sequence {deg(1),deg(2),...,deg(n)}, where deg(i) is the number of roads incident to the i-th interesting point. Given two sets of roads R1,R2 that each connect all the points, we can say the city prefers R1 to R2 if R1's cost is strictly smaller than R2's cost, or R1 and R2 costs are equal and the degree sequence of R1 is lexicographically smaller than the degree sequence of R2.\n\nGiven n and the description of the m proposals of roads, print the minimum cost of a set of roads that connects the points and the degree sequence of that set of roads.\n\nInput Format\n\nThe first line of the input will contain an integer T, denoting the number of test cases.\nEach test case will be formatted as follows:\nThe first line of the test case will contain 2 integers, n, m.\nThen m lines will follow, each with 3 integers ai, bi, ci.\n\nOutput Format\n\nPrint two lines for each test case.\nThe first line contains the minimum cost of a set of roads that connects all the points.\nThe second line contains n space separated integers, the degree sequence of the set of roads chosen. The i-th number on this line represents the number of roads incident to the i-th interesting point. \n\nConstraints\n\nFor all files\n1  T  5\n1  ai, bi  n \n1  ci  1,000,000,000 \nn-1  m  100,000 \n\nFile 1 -- 40 pts:\n2  n  50\nAll road costs are distinct.\n\nFile 2 -- 30 pts:\n2  n  50\nAll road costs are equal to 1.\n\nFile 3 -- 20 pts:\n2  n  50\n\nFile 4 -- 10 pts:\n2  n  50,000", "TESTCASE_1": "3\n5 7\n2 5 7\n1 4 3\n2 3 5\n1 3 2\n1 5 4\n3 4 6\n1 2 1\n4 6\n1 2 1000000000\n2 3 1000000000\n3 4 1000000000\n4 1 1000000000\n1 1 1\n2 3 1000000000\n6 7\n1 2 1\n2 3 1\n3 1 1\n4 5 2\n5 6 2\n6 4 2\n1 4 100000\n###---###SEPERATOR---###---\n10\n4 1 1 1 1\n3000000000\n1 1 2 2\n100006\n2 1 2 2 1 2", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}