{"Q_ID": "1418210011", "S_NAME": "Tree", "Q_NAME": "Haunted", "Q_DESC": "The king of ghosts is really disappointed when he sees that all the human beings on Planet Earth have stopped fearing the ghost race. He knows the reason for this. The existing ghost race has become really lazy and has stopped visiting Planet Earth to scare the human race. Hence, he decides to encourage the entire ghost race into scaring the humans by holding a competition. The king, however, never visits Planet Earth.\n\nThis competition will go on for N days. Currently, there are a total of M ghosts (apart from the king) existing in the ghost race such that :\n- The youngest ghost is 1 year old.\n- The oldest ghost is M years old.\n- No two ghosts have the same age.\n- The age of each and every ghost is a positive integer.\n\nOn each day of the competition, ghosts have to visit Planet Earth to scare people. At the end of each day, a Ghost of the Day title is awarded to the ghost who scares the most number of humans on that particular day. However, the king of ghosts believes in consistency. Once this title has been given, the ghost who has won the most number of such titles until that particular moment is presented with a Consistency Trophy. If there are many such ghosts, the oldest among them is given the trophy. Note that this Title Giving and Trophy Giving happens at the end of each day of the competition.\n\nYou will be given the age of the ghost who won the Ghost of the Day title on each day of the competition. Your job is to find out the age of the ghost who was awarded with the Consistency Trophy on each day of the competition.\n\nInput\nThe first line consists of 2 space separated integers N and M. The next line consists of N space separated integers such that the ith integer denotes the age of the ghost who was awarded with the Ghost of the Day title on the ith day of the competition.\n\nOutput\nPrint N lines. The ith line should contain 2 space separated integers such that the first integer denotes the age of the ghost who was awarded with the Consistency Trophy on the ith day and the second integer denotes the number of Ghost of the Day titles won by this ghost until the end of the ith day of the competition.\n\nConstraints\n1  N  10^5\n1  M  10^9", "TESTCASE_1": "7 5\n1 3 1 3 2 2 2\n###---###SEPERATOR---###---\n1 1\n3 1\n1 2\n3 2\n3 2\n3 2\n2 3", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}