{"Q_ID": "1419110024", "S_NAME": "Graphs", "Q_NAME": "Graph Problem 16", "Q_DESC": "In India, there are many railway stations. There's no way you could avoid one. So, the protagonist in our problem is given N railway stations and M direct two way connections for these railway stations. Let us say that we connect railway station u and v directly - that is to say, you can go from u to v directly without passing any other station.\n\nYou have been hired by the Indian Railways (Congratulations!) to compute the shortest path between two railway stations, so that they can minimize the time taken to travel between those stations. M direct connections will be of the following form: Station1 Station2 D, this means there is a direct connection between Station1 and Station2 and there's a distance of D Kilometers.\n\nKeep in mind that each train takes 1 minute to travel 1 km. The stoppage time is too small, and thus can be ignored.\n\nYou will be given Q queries of type Source Destination. You have to find the shortest path from Source to Destination.\n\nInput:\n\nFirst line of input contains two integers N and M denoting number of railway stations and number of direct connections respectively.\nNext line contains N strings denoting the name of the stations.\nNext M lines contains two strings Station1, Station2 and an integer D denoting that there is a direct connection between Station1 and Station2 having D distance between them.\nNext line contains a single integer Q denoting number of queries.\nNext Q lines contain two strings Source and Destination.\n\nOutput:\nFor each query output a single integer denoting the cost of the shortest path between source and destination.", "TESTCASE_1": "4 4\nHowrah Trivandram Vashi Mysore\nHowrah Trivandram 10\nHowrah Vashi 20\nTrivandram Mysore 100\nMysore Vashi 50\n6\nHowrah Trivandram\nHowrah Vashi\nHowrah Mysore\nTrivandram Vashi\nTrivandram Mysore\nMysore Vashi\n###---###SEPERATOR---###---\n10\n20\n70\n30\n80\n50", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "4 4\nHowrah Trivandram Vashi Mysore\nHowrah Trivandram 50\nHowrah Vashi 200\nTrivandram Mysore 150\nMysore Vashi 250\n6\nHowrah Trivandram\nHowrah Vashi\nHowrah Mysore\nTrivandram Vashi\nTrivandram Mysore\nMysore Vashi\n###---###SEPERATOR---###---\n50\n200\n200\n250\n150\n250", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}