{"Q_ID": "1419110026", "S_NAME": "Graphs", "Q_NAME": "Graph Problem 18", "Q_DESC": "The secret services of Armin, an otherwise peace-loving country, have decided to perform a surgical strike in the war-torn city of Tashka. Tashka is under enemy control and the objective of the strike is to gain control over the city. The mission is subdivided into the following steps:\n1) Divide in groups and infiltrate all enemy bases in Tashka as unarmed civilians, and find the status of enemy's defense strength at that base. ( You can assume that the number of groups are sufficiently large to cover each base separately )\n2) Pick up the required amount of ammunition from our secret ammunition store in the city.\n3) Return to the bases and destroy the enemy defense.\n4) Rush to the Town Hall for the Helicopter pick up out of the town.\n\nThere are a total of N buildings in Tashka, numbered from 1 to N . The agents will be dropped at building denoted by S, post which they will divide into groups and each enemy base will have a group moving towards it. The ammunition store is denoted by A and town hall is denoted by H . All the buildings except these three are enemy bases and are to be infiltrated. There are a total of M bidirectional roads in the city, each road connects two cities. There can be multiple roads between a pair of cities and each road has a time taken to cross associated with its terrain. Monk is made in charge of the pickup. He can not land the Helicopter before all the groups have arrived at the Town Hall. Find the Minimum units of Time, post dropping the agents, that the Helicopter should be landed such that all groups are able to reach the Town Hall.\n\nInput:\nFirst line contains an integer T. T test cases follow.\nFirst line of each test cases contains two space-separated integers N, M.\nEach of the next M lines contains three space-separated integers X, Y, C, denoting that there is a bidirectional road between X and Y that needs C units of time to cross. \nThe next line contains three space-separated integers S, A and H (not necessarily distinct) .\n\nOutput:\nPrint the answer to each test case in a new line.", "TESTCASE_1": "1\n4 4\n1 4 1\n1 2 1\n2 3 1\n2 4 1\n1 2 3\n###---###SEPERATOR---###---\n5", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "1\n5 8\n3 4 5\n4 5 3\n2 1 1\n5 4 3\n5 4 1\n4 2 1\n4 5 1\n3 5 2\n3 4 4\n###---###SEPERATOR---###---\n11", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}