{"Q_ID": "1419110027", "S_NAME": "Graphs", "Q_NAME": "Graph Problem 19", "Q_DESC": "Globsoft has a network of N computers connected by M lan cables. It is possible to communicate between any two computers in the network using these cables. There can be multiple cables connecting 2 computers. A computer may be connected via a cable to itself.\n\nWe say that computer A can communicate with computer B, if there exists a sequence of cables connecting these 2 computers directly or undirectly. Each cable has a latency associated with it. Now, the company has decided to revamp the existing network and replace some existing cables with newer cables. You are given Q new cables, each having its own latency. You can pick any number of cables (maybe 0) from these Q cables and use it to replace any cable in the existing network. Each new Cable can be used at most once. It is not necessary to replace every cable from the existing network.\n\nNow, considering you use an arbitrary number of new cables and embed them into the existing network, you need to pick N1 cables from this network (Can consist of old as well as new ) such that using these N1 cables, it is posible to communicate beween any 2 computers present in the network. What can be the minimum sum of latencies of these N1 cables satisfying the above constraints, considering you perform the replacement of the cables optimally ?\n\nInput Format:\n\nThe First line consists of two integers N and M, N is the number of computers in the network and M is the number of cables in the network. Next M lines consists of three integers each: A, B and L, denoting there is a cable connecting computers A and B and having latency L. Next line consists of an integer Q denoting the number of cables available for use.\nNext line consists of an array C denoting the latencies of the Q cables.\n\nOutput Format:\n\nOutput the required answer on a single line\n\n", "TESTCASE_1": "4 6\n1 2 1\n1 3 5\n1 4 5\n1 2 3\n2 1 4\n2 3 6\n5\n5 8 2 2 3\n###---###SEPERATOR---###---\n5", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "10 15\n1 8 17\n1 9 13\n1 5 18\n1 6 16\n1 4 14\n1 3 19\n1 10 14\n1 7 14\n1 2 15\n7 1 18\n2 7 10\n1 7 13\n6 1 11\n1 6 10\n4 6 14\n10\n6 45 7 23 4 33 26 30 27 16\n###---###SEPERATOR---###---\n91", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}