{"Q_ID": "1420110006", "S_NAME": "Hashing", "Q_NAME": "Will Rick Survive or Not", "Q_DESC": "After Governor's attack on prison, Rick found himself surrounded by walkers. They are coming towards him from all sides. Now, suppose Rick have infinite number of bullets with him. Suppose Rick need 1 bullet to kill each walker (yeah he is good in killing walkers. They need to be shot at head. See, how good he is). Now as soon as he kills 1 walker rest of the walkers move forward by 1 m. There are n walkers each at some distance from Rick. If any walker is able to reach Rick, he dies. Now, you need to tell if he survives or not. If he survives print Rick now go and save Carl and Judas else print Goodbye Rick followed by no.of walkers he was able to kill before he died in next line. One more thing Rick's gun can fire 6 shots without reload. It takes him 1 sec to reload and during this time walkers move 1 m forward.                            \n\nINPUT:                                  \n\nFirst line contains an integer t indicating number of test cases. Next line contains an integer n denoting no.of walkers followed by n space separated integers denoting the distance of walkers from him.                                 \n\nOUTPUT:                              \n\nFor each test case output one line denoting the answer as explained above.          \n\nCONSTRAINTS:               \n\n1=t=100\n1=n=100000\n1=dis[i]=50000", "TESTCASE_1": "2\n5\n2 4 2 5 6\n4\n2 2 2 2\n###---###SEPERATOR---###---\nRick now go and save Carl and Judas\nGoodbye Rick\n2", "TESTCASE_2": "1\n15\n2 2 3 4 5 6 6 7 9 10 11 12 12 13 14\n###---###SEPERATOR---###---\nGoodbye Rick\n6", "TESTCASE_3": "2\n15\n2 2 3 4 5 6 6 7 9 10 11 12 12 13 14\n10 \n1 2 3 4 5 6 8 10 11 12\n###---###SEPERATOR---###---\nGoodbye Rick\n6\nRick now go and save Carl and Judas", "TESTCASE_4": "3\n15\n2 2 3 4 5 6 6 7 9 10 11 12 12 13 14\n10 \n1 2 3 4 5 6 8 10 11 12 \n20\n1 2 3 4 5 6 7 11 20 21 22 26 5 7 18 21 34 19 21 20\n###---###SEPERATOR---###---\nGoodbye Rick\n6\nRick now go and save Carl and Judas\nGoodbye Rick\n5", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}