{"Q_ID": "1420110002", "S_NAME": "Hashing", "Q_NAME": "Difficult Characters", "Q_DESC": "Yesterday while Omar was trying to learn English, he saw that there are letters repeated many times in words while some other letters repeated only few times or not repeated at all!  \n\nOf course anyone can memorize the letters (repeated many times) better than the letters repeated few times, so Omar will concatenate all the words in the context he has, and try to know the difficulty of each letter according to the number of repetitions of each letter.                                                  \n\nSo Omar has now the whole context and wants to arrange the letters from the most difficult letter (repeated few times) to the less difficult letter.   If there are 2 letters with the same level of difficulty, the letter with higher value of ASCII code will be more difficult.                                               \n\nINPUT FORMAT: \n\nGiven an integer (T), 1<=T<=10 (number of test cases).\nFor each test case:  Given a string of (lower English characters), 1<=size of string<=10^6\n\n1<=sizeofstring<=106.  (each string in a new line). \n\nOUTPUT FORMAT:\n\nOutput the English lower case characters from the most difficult letter to the less difficult letter. (leave a space between 2 successive letters) (Output each test case in a separate line).                                                                                            ", "TESTCASE_1": "1\noomar\n###---###SEPERATOR---###---\nz y x w v u t s q p n l k j i h g f e d c b r m a o", "TESTCASE_2": "2\nHello\nBye\n###---###SEPERATOR---###---\nz y x w v u t s r q p n m k j i h g f d c b a o e l \nz x w v u t s r q p o n m l k j i h g f d c b a y e", "TESTCASE_3": "1\nbxbbxxsxsx\n###---###SEPERATOR---###---\nz y w v u t r q p o n m l k j i h g f e d c a s b x", "TESTCASE_4": "1\ndinosaurs\n###---###SEPERATOR---###---\nz y x w v t q p m l k j h g f e c b u r o n i d a s", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}