{"Q_ID": "1420210023", "S_NAME": "Hashing", "Q_NAME": "Mic..Mon...Alex?(Name Lookup)", "Q_DESC": "Our friend Alex has been made teacher for the day today by his school professors . He is going to teach informatics to his colleagues as that is his favorite subject . Before entering the class, Alex realized that he does not remember the names of all his colleagues clearly . He thinks this will cause problems and will not allow him to teach the class well. However, Alex remembers the roll number of all his colleagues very well . Alex now wants you to help him out. He will initially give you a list indicating the name and roll number of all his colleagues. When he enters the class he will give you the roll number of any of his colleagues belonging to the class. You need to revert to him with the name of that colleague.\n\nInput Format\n\nThe first line contains a single integers \nN\nN denoting the number of Alex's colleagues. Each of the next \nN\nN lines contains an integer and a String denoting the roll number and name of the \ni\ni th colleague of Alex. The next Line contains a single integer \nq\nq denoting the number of queries Alex shall present to you when he starts teaching in class. Each of the next \nq\nq lines contains a single integer \nx\nx denoting the roll number of the student whose name Alex wants to know.\n\nOutput Format\n\nYou need to print \nq\nq Strings, each String on a new line, indicating the answers to each of Alex's queries.\n\nConstrains\n\n1\n\nN\n\n10\n5\n1N105\n\n1\n\nR\no\nl\nl\nN\nu\nm\nb\ne\nr\n\n10\n9\n1RollNumber109\n1\n\n|\nN\na\nm\ne\n|\n\n25\n1|Name|25\n\n1\n\nq\n\n10\n4\n1q104\n\n1\n\nx\n\n10\n9\n1x109\n\nNote\n\nThe name of each student shall consist of lowercase English alphabets only. It is guaranteed that the roll number appearing in each query shall belong to some student from the class.", "TESTCASE_1": "5\n1 vasya\n2 petya\n3 kolya\n4 limak\n5 illya\n2\n1\n2\n###---###SEPERATOR---###---\nvasya\npetya", "TESTCASE_2": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_3": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_4": "0\n###---###SEPERATOR---###---\n0", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}