{"Q_ID": "1420210001", "S_NAME": "Hashing", "Q_NAME": "Little Jhool and the match maker", "Q_DESC": "Little Jhool is back, with his matchmaker friend Dawgie.\n\nDawgie's logic for approving a girl with a boy or a boy with a girl, is simple: if the name of a girl has maximum similar characters to the name of a guy, they are definitely not fit for being with each other. For example, a couple with Shubhami and Shubham is less ideal than a couple with Shubham and Dhinsat. Since Shubhami and Shubham have 6 characters in common while the other couple has 3 characters in common, so the other couple is much more ideal.\n\nNow our Little Jhool gives the list of all the crushes in his life to Dawgie, and asks him to tell the top K numbers of girls out of the list of N girls, he gives who'll be a good match for Little Jhool.\n\nNote-1: The case of the letters does NOT matter.\nNote-2: The name of Little Jhool is: LittleJhool, without the space and quotes, where the unique characters present in his name are: [l, i, t, e, j,h,o].\nNote-3: In case of a tie, print the names in order of their occurrence.                          Input format:\nThe first line contains an integer, T, denoting the number of test-cases possible. The first line for every test case would contain two integers denoting the values of N and K. The next line would contain N names separated by a space.\n\nOutput format:\nPrint the names of the top K girls who will be a good match for our Little Jhool. Constraints:\n1  Test Cases  50\n1  N  2000\n1  K  N. \n1  Length of names  26.", "TESTCASE_1": "3\n5 1\njhoolz littleboy cooldude findingathar findingnemo\n3 1\nbawa chunnu kundan\n3 2\nkaddu babykaddu littlejhool\n###---###SEPERATOR---###---\ncooldude \nbawa \nkaddu babykaddu", "TESTCASE_2": "4\n1 1\nalmnsvy\n1 1\naabkkklmmnnooopqrrtwz\n3 1\naadehijklnnnoqqrsuxz dgikqrstuvz abdffggiijnoopqv\n1 1\nbcfgghijlnnpprstvvwxz\n###---###SEPERATOR---###---\nalmnsvy \naabkkklmmnnooopqrrtwz \ndgikqrstuvz \nbcfgghijlnnpprstvvwxz", "TESTCASE_3": "10\n1 1\nalmnsvy\n10 4\nbcgikklnpsvz bccdhiijkklmpprrtt iillpxz bdgnr bccfggikkkllmmpqstuvwwxyz adefggghkllmpqttuvyz afgmottz aaaaacdeghijklmmquyy agjkorswx egjklpssxy\n10 6\nhwyz dfggkknnooqstuuvxyy befgghiijkkkppuz acddghhijjlmmnoooqtuuvwwwy aabbbdefjnnoooqrsuvvvyz abbffgiknnopvw abfggjlmnnooprstuuuv i bijnnoqqtuvwxy eilmpuvx\n9 7\naeimqsvyy abcchkoootz cdgiimoqrrrtuvwx aabbcdegijkmmmprttvwxxxx aaddefhhmmnnopqrvvvwxyy ddehimssvwwyz ccgikmnnpqqsxz acciimmnooqrrrww bbccefhhijjlmnrrs\n5 1\nabcdeghhiiijjjklnosuwwxxy cdeefijkort efhijjllnpsssstuuwx dffglnnoopuuvx aaccfgijjkppvwxy\n5 1\nh bcddegghhikoouvvz bcefghhikllnnnoppppqrruz bghjjloqrruvwwx aabcdghiiijjkmqtuuuw\n1 1\naabkkklmmnnooopqrrtwz\n3 1\naadehijklnnnoqqrsuxz dgikqrstuvz abdffggiijnoopqv\n1 1\nbcfgghijlnnpprstvvwxz\n10 8\nddfhhiiijjkmmnoopprsuxyyzz acccefghhllmnopwwwxz dhhkmmoopsstwyyyy abbceeegiimnnopqsuvwwyyz abbfggjjkmnnnosuvxyz hrt aacfggjllqtvxx bbcdhiinoopqstuvvxz bbccdiklmmppqqrttuxxz aehhhoortvvwxxy\n###---###SEPERATOR---###---\nalmnsvy \nbdgnr bcgikklnpsvz iillpxz afgmottz \nhwyz i dfggkknnooqstuuvxyy abbffgiknnopvw aabbbdefjnnoooqrsuvvvyz eilmpuvx \nccgikmnnpqqsxz aeimqsvyy acciimmnooqrrrww abcchkoootz cdgiimoqrrrtuvwx aaddefhhmmnnopqrvvvwxyy ddehimssvwwyz \ndffglnnoopuuvx \nh \naabkkklmmnnooopqrrtwz \ndgikqrstuvz \nbcfgghijlnnpprstvvwxz \nabbfggjjkmnnnosuvxyz hrt dhhkmmoopsstwyyyy abbceeegiimnnopqsuvwwyyz aacfggjllqtvxx bbccdiklmmppqqrttuxxz ddfhhiiijjkmmnoopprsuxyyzz acccefghhllmnopwwwxz", "TESTCASE_4": "2\n1 1\nfootcricket\n1 1\najdad\n###---###SEPERATOR---###---\nfootcricket \najdad", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}