{"Q_ID": "1420110008", "S_NAME": "Hashing", "Q_NAME": "ICPC Team Management", "Q_DESC": "Little Chandan is an exceptional manager - apart from his role in HackerEarth - as the person who has to bug everyone, in general... and if possible, try to get some work done.\n\nHe's also offered a job as the coach of the best Russian teams participating for ACM-ICPC World Finals. Now, Chandan is an extremely good coach, too. But he's a weird person who thrives on patterns in life, in general. So, he has decided that if there are n number of students in total, and he is supposed to divide them in camps of k students - he want them to be arranged in such a way that the length of names of all the students in a camp is equal.\n\nI know, totally weird, right? \n\nINPUT:\nThe first line will contain the number of test cases. Which will be followed by two integers, n, k - denoting the number of total students, and the number of total students which will be allowed in one camp. After which, n lines will follow denoting the names of all the students who're willing to learn by the great coach. \n\nOUTPUT:                                \n\nIf it is possible for all the students be arranged in a camp of k students, print \"Possible\", else print \"Not possible\".                                 \n\nCONSTRAINTS:\n1 <= Test Cases <= 50\n1 <= N <= 1000\n1 <= K <= 1000\n1 <= LengthOfAString <= 100\n\nPS: n%k will ALWAYS be equal to zero - that is, it will possible to divide the n students in equal sized camps of k.", "TESTCASE_1": "2\n6 3\narjit\ntijra\ngenius\nchanda\nashish\narjit\n4 2\nbond\ncoder\nbond\nlol\n###---###SEPERATOR---###---\nPossible\nNot possible", "TESTCASE_2": "1\n6 3\nishani\nuditya\nabhiprae\ngaurav\ntanmay\nparth\n###---###SEPERATOR---###---\nNot possible", "TESTCASE_3": "2\n6 3\nishani\nuditya\nabhiprae\ngaurav\ntanmay\nparth\n2 1\nramesh\nsuresh\n###---###SEPERATOR---###---\nNot possible\nPossible", "TESTCASE_4": "3\n6 3\nishani\nuditya\nabhiprae\ngaurav\ntanmay\nparth\n2 1\nramesh\nsuresh\n4 2\npriyank\nrannvijay\nsamyukta\nsamar\n###---###SEPERATOR---###---\nNot possible\nPossible\nNot possible", "TESTCASE_5": "0\n###---###SEPERATOR---###---\n0"}